using System;
using System.Collections.Generic;
using Config.Common;

namespace Config;

[Serializable]
public class LocalNames : IConfigData
{
	public static class DefKey
	{
		public const short BrotherOrder0 = 0;

		public const short BrotherOrder1 = 1;

		public const short BrotherOrder2 = 2;

		public const short BrotherOrder3 = 3;

		public const short BrotherOrder4 = 4;

		public const short GeneralBegin = 100;
	}

	public static LocalNames Instance = new LocalNames();

	public HanNameItem[] AllNamesCore;

	public IReadOnlyDictionary<string, int> RefNameMap
	{
		get
		{
			throw new NotImplementedException();
		}
	}

	public int GetItemId(string refName)
	{
		throw new NotImplementedException();
	}

	public int AddExtraItem(string identifier, string refName, object configItem)
	{
		throw new NotImplementedException();
	}

	public void Init()
	{
		HanNameItem[] array = new HanNameItem[2440];
		array[0] = new HanNameItem(0, "伯", new string[187]
		{
			"涛", "志", "通", "奋", "乾", "奇", "彦", "当", "龙", "虎",
			"安", "康", "英", "胜", "诚", "魁", "铮", "昌", "驹", "徽",
			"衡", "沧", "超", "兴", "承", "勋", "俊", "强", "远", "贤",
			"平", "泉", "刚", "敖", "达", "敏", "良", "玉", "华", "文",
			"常", "冲", "崇", "恪", "俭", "仁", "雷", "进", "存", "催",
			"鹏", "善", "元", "垣", "韬", "玄", "昭", "辉", "方", "飞",
			"雄", "景", "贤", "禹", "坦", "弘", "琮", "宏", "菁", "淳",
			"良", "楷", "绍", "谷", "言", "舟", "鉴", "岳", "新", "亭",
			"直", "敏", "巍", "居", "俅", "誉", "材", "隆", "嵩", "荣",
			"商", "骏", "慈", "益", "丘", "烈", "若", "槐", "权", "祥",
			"忠", "贵", "瑞", "麟", "图", "喜", "庸", "聪", "毅", "守",
			"温", "廉", "腾", "旺", "维", "振", "夏", "驰", "勤", "朗",
			"威", "玮", "绅", "勇", "永", "仑", "耀", "用", "伦", "严",
			"亨", "允", "羲", "磊", "才", "茂", "榕", "回", "雨", "谏",
			"嘉", "慧", "良", "翻", "佳", "剑", "乔", "伟", "甫", "瑛",
			"凌", "逵", "普", "逍", "缨", "让", "能", "由", "颖", "理",
			"逸", "襄", "枢", "惟", "程", "斐", "习", "钰", "遥", "莹",
			"孺", "协", "昂", "寓", "醇", "赏", "昶", "攸", "幼", "纮",
			"珅", "烨", "焕", "儒", "会", "翔", "晨"
		}, new string[0], new string[0], new string[24]
		{
			"山", "流", "箫", "年", "清", "光", "明", "尹", "约", "秋",
			"豪", "叶", "升", "辰", "怀", "际", "继", "功", "圣", "夷",
			"厚", "尘", "晓", "堂"
		}, new string[0], new string[0]);
		array[1] = new HanNameItem(1, "仲", new string[187]
		{
			"涛", "志", "通", "奋", "乾", "奇", "彦", "当", "龙", "虎",
			"安", "康", "英", "胜", "诚", "魁", "铮", "昌", "驹", "徽",
			"衡", "沧", "超", "兴", "承", "勋", "俊", "强", "远", "贤",
			"平", "泉", "刚", "敖", "达", "敏", "良", "玉", "华", "文",
			"常", "冲", "崇", "恪", "俭", "仁", "雷", "进", "存", "催",
			"鹏", "善", "元", "垣", "韬", "玄", "昭", "辉", "方", "飞",
			"雄", "景", "贤", "禹", "坦", "弘", "琮", "宏", "菁", "淳",
			"良", "楷", "绍", "谷", "言", "舟", "鉴", "岳", "新", "亭",
			"直", "敏", "巍", "居", "俅", "誉", "材", "隆", "嵩", "荣",
			"商", "骏", "慈", "益", "丘", "烈", "若", "槐", "权", "祥",
			"忠", "贵", "瑞", "麟", "图", "喜", "庸", "聪", "毅", "守",
			"温", "廉", "腾", "旺", "维", "振", "夏", "驰", "勤", "朗",
			"威", "玮", "绅", "勇", "永", "仑", "耀", "用", "伦", "严",
			"亨", "允", "羲", "磊", "才", "茂", "榕", "回", "雨", "谏",
			"嘉", "慧", "良", "翻", "佳", "剑", "乔", "伟", "甫", "瑛",
			"凌", "逵", "普", "逍", "缨", "让", "能", "由", "颖", "理",
			"逸", "襄", "枢", "惟", "程", "斐", "习", "钰", "遥", "莹",
			"孺", "协", "昂", "寓", "醇", "赏", "昶", "攸", "幼", "纮",
			"珅", "烨", "焕", "儒", "会", "翔", "晨"
		}, new string[0], new string[0], new string[24]
		{
			"山", "流", "箫", "年", "清", "光", "明", "尹", "约", "秋",
			"豪", "叶", "升", "辰", "怀", "际", "继", "功", "圣", "夷",
			"厚", "尘", "晓", "堂"
		}, new string[0], new string[0]);
		array[2] = new HanNameItem(2, "叔", new string[187]
		{
			"涛", "志", "通", "奋", "乾", "奇", "彦", "当", "龙", "虎",
			"安", "康", "英", "胜", "诚", "魁", "铮", "昌", "驹", "徽",
			"衡", "沧", "超", "兴", "承", "勋", "俊", "强", "远", "贤",
			"平", "泉", "刚", "敖", "达", "敏", "良", "玉", "华", "文",
			"常", "冲", "崇", "恪", "俭", "仁", "雷", "进", "存", "催",
			"鹏", "善", "元", "垣", "韬", "玄", "昭", "辉", "方", "飞",
			"雄", "景", "贤", "禹", "坦", "弘", "琮", "宏", "菁", "淳",
			"良", "楷", "绍", "谷", "言", "舟", "鉴", "岳", "新", "亭",
			"直", "敏", "巍", "居", "俅", "誉", "材", "隆", "嵩", "荣",
			"商", "骏", "慈", "益", "丘", "烈", "若", "槐", "权", "祥",
			"忠", "贵", "瑞", "麟", "图", "喜", "庸", "聪", "毅", "守",
			"温", "廉", "腾", "旺", "维", "振", "夏", "驰", "勤", "朗",
			"威", "玮", "绅", "勇", "永", "仑", "耀", "用", "伦", "严",
			"亨", "允", "羲", "磊", "才", "茂", "榕", "回", "雨", "谏",
			"嘉", "慧", "良", "翻", "佳", "剑", "乔", "伟", "甫", "瑛",
			"凌", "逵", "普", "逍", "缨", "让", "能", "由", "颖", "理",
			"逸", "襄", "枢", "惟", "程", "斐", "习", "钰", "遥", "莹",
			"孺", "协", "昂", "寓", "醇", "赏", "昶", "攸", "幼", "纮",
			"珅", "烨", "焕", "儒", "会", "翔", "晨"
		}, new string[0], new string[0], new string[24]
		{
			"山", "流", "箫", "年", "清", "光", "明", "尹", "约", "秋",
			"豪", "叶", "升", "辰", "怀", "际", "继", "功", "圣", "夷",
			"厚", "尘", "晓", "堂"
		}, new string[0], new string[0]);
		array[3] = new HanNameItem(3, "季", new string[187]
		{
			"涛", "志", "通", "奋", "乾", "奇", "彦", "当", "龙", "虎",
			"安", "康", "英", "胜", "诚", "魁", "铮", "昌", "驹", "徽",
			"衡", "沧", "超", "兴", "承", "勋", "俊", "强", "远", "贤",
			"平", "泉", "刚", "敖", "达", "敏", "良", "玉", "华", "文",
			"常", "冲", "崇", "恪", "俭", "仁", "雷", "进", "存", "催",
			"鹏", "善", "元", "垣", "韬", "玄", "昭", "辉", "方", "飞",
			"雄", "景", "贤", "禹", "坦", "弘", "琮", "宏", "菁", "淳",
			"良", "楷", "绍", "谷", "言", "舟", "鉴", "岳", "新", "亭",
			"直", "敏", "巍", "居", "俅", "誉", "材", "隆", "嵩", "荣",
			"商", "骏", "慈", "益", "丘", "烈", "若", "槐", "权", "祥",
			"忠", "贵", "瑞", "麟", "图", "喜", "庸", "聪", "毅", "守",
			"温", "廉", "腾", "旺", "维", "振", "夏", "驰", "勤", "朗",
			"威", "玮", "绅", "勇", "永", "仑", "耀", "用", "伦", "严",
			"亨", "允", "羲", "磊", "才", "茂", "榕", "回", "雨", "谏",
			"嘉", "慧", "良", "翻", "佳", "剑", "乔", "伟", "甫", "瑛",
			"凌", "逵", "普", "逍", "缨", "让", "能", "由", "颖", "理",
			"逸", "襄", "枢", "惟", "程", "斐", "习", "钰", "遥", "莹",
			"孺", "协", "昂", "寓", "醇", "赏", "昶", "攸", "幼", "纮",
			"珅", "烨", "焕", "儒", "会", "翔", "晨"
		}, new string[0], new string[0], new string[24]
		{
			"山", "流", "箫", "年", "清", "光", "明", "尹", "约", "秋",
			"豪", "叶", "升", "辰", "怀", "际", "继", "功", "圣", "夷",
			"厚", "尘", "晓", "堂"
		}, new string[0], new string[0]);
		array[4] = new HanNameItem(4, "少", new string[187]
		{
			"涛", "志", "通", "奋", "乾", "奇", "彦", "当", "龙", "虎",
			"安", "康", "英", "胜", "诚", "魁", "铮", "昌", "驹", "徽",
			"衡", "沧", "超", "兴", "承", "勋", "俊", "强", "远", "贤",
			"平", "泉", "刚", "敖", "达", "敏", "良", "玉", "华", "文",
			"常", "冲", "崇", "恪", "俭", "仁", "雷", "进", "存", "催",
			"鹏", "善", "元", "垣", "韬", "玄", "昭", "辉", "方", "飞",
			"雄", "景", "贤", "禹", "坦", "弘", "琮", "宏", "菁", "淳",
			"良", "楷", "绍", "谷", "言", "舟", "鉴", "岳", "新", "亭",
			"直", "敏", "巍", "居", "俅", "誉", "材", "隆", "嵩", "荣",
			"商", "骏", "慈", "益", "丘", "烈", "若", "槐", "权", "祥",
			"忠", "贵", "瑞", "麟", "图", "喜", "庸", "聪", "毅", "守",
			"温", "廉", "腾", "旺", "维", "振", "夏", "驰", "勤", "朗",
			"威", "玮", "绅", "勇", "永", "仑", "耀", "用", "伦", "严",
			"亨", "允", "羲", "磊", "才", "茂", "榕", "回", "雨", "谏",
			"嘉", "慧", "良", "翻", "佳", "剑", "乔", "伟", "甫", "瑛",
			"凌", "逵", "普", "逍", "缨", "让", "能", "由", "颖", "理",
			"逸", "襄", "枢", "惟", "程", "斐", "习", "钰", "遥", "莹",
			"孺", "协", "昂", "寓", "醇", "赏", "昶", "攸", "幼", "纮",
			"珅", "烨", "焕", "儒", "会", "翔", "晨"
		}, new string[0], new string[0], new string[24]
		{
			"山", "流", "箫", "年", "清", "光", "明", "尹", "约", "秋",
			"豪", "叶", "升", "辰", "怀", "际", "继", "功", "圣", "夷",
			"厚", "尘", "晓", "堂"
		}, new string[0], new string[0]);
		array[100] = new HanNameItem(100, "阿", new string[0], new string[1] { "贞" }, new string[2] { "七", "九" }, new string[3] { "牛", "斗", "狗" }, new string[6] { "朱", "碧", "紫", "妹", "猫", "花" }, new string[0]);
		array[101] = new HanNameItem(101, "安", new string[65]
		{
			"通", "乐", "康", "牧", "盛", "邦", "文", "齐", "存", "元",
			"豫", "泰", "度", "弘", "良", "谏", "舟", "迁", "直", "咏",
			"乔", "隆", "甫", "洛", "逵", "植", "骏", "莫", "慕", "益",
			"栖", "丘", "健", "楠", "越", "浦", "遇", "贵", "瑞", "思",
			"隐", "止", "颖", "逊", "毅", "适", "游", "腾", "舒", "维",
			"奎", "绶", "习", "献", "孺", "胄", "绪", "允", "复", "焕",
			"纲", "羲", "济", "会", "才"
		}, new string[12]
		{
			"怡", "雅", "雯", "艳", "霁", "玲", "露", "熙", "颐", "呤",
			"曦", "洁"
		}, new string[15]
		{
			"谊", "华", "澜", "然", "雨", "嘉", "慧", "佳", "欣", "琦",
			"韶", "晏", "涣", "荃", "绮"
		}, new string[20]
		{
			"候", "国", "期", "石", "之", "道", "南", "怀", "际", "中",
			"继", "胤", "标", "根", "厚", "轨", "尘", "世", "施", "民"
		}, new string[3] { "仪", "媚", "歌" }, new string[3] { "梦", "声", "竹" });
		array[102] = new HanNameItem(102, "傲", new string[60]
		{
			"昌", "驹", "兴", "勋", "绅", "邦", "枫", "欢", "琨", "峰",
			"钦", "先", "宗", "东", "坤", "斌", "鹰", "晖", "乾", "龙",
			"诚", "鹏", "玄", "弘", "宏", "权", "严", "纮", "儒", "骅",
			"铨", "杰", "节", "群", "磐", "虎", "远", "勇", "宇", "武",
			"志", "进", "岳", "骏", "烈", "毅", "健", "智", "翰", "骥",
			"信", "正", "迅", "禄", "晋", "锐", "翊", "绩", "松", "雄"
		}, new string[38]
		{
			"贞", "樱", "珍", "茵", "萱", "菲", "芬", "娟", "莺", "珊",
			"芝", "姿", "芳", "雯", "玲", "莲", "妍", "琴", "琳", "婵",
			"芸", "沅", "娴", "荷", "琪", "兰", "荃", "琼", "菊", "梅",
			"雪", "霁", "凤", "燕", "倩", "茜", "霜", "瑛"
		}, new string[14]
		{
			"聪", "英", "星", "清", "邪", "华", "澜", "然", "文", "贤",
			"言", "良", "容", "敏"
		}, new string[15]
		{
			"升", "功", "中", "冬", "天", "候", "国", "甫", "柏", "祖",
			"熠", "世", "命", "山", "之"
		}, new string[5] { "珂", "仙", "男", "凰", "君" }, new string[4] { "空", "奴", "寒", "卿" });
		array[200] = new HanNameItem(200, "白", new string[7] { "泉", "驹", "云", "皎", "枫", "琮", "会" }, new string[11]
		{
			"凤", "莲", "蓉", "樱", "菁", "裳", "雨", "香", "霜", "薇",
			"婕"
		}, new string[6] { "英", "菊", "玉", "梅", "虹", "钰" }, new string[5] { "石", "猿", "鹤", "河", "眉" }, new string[2] { "罗", "萝" }, new string[2] { "衣", "溪" });
		array[201] = new HanNameItem(201, "百", new string[52]
		{
			"胜", "泉", "诚", "熊", "魁", "乐", "当", "安", "通", "盛",
			"宝", "涛", "回", "训", "阔", "火", "慧", "良", "言", "柬",
			"剑", "鉴", "新", "俅", "乔", "材", "隆", "可", "荣", "逵",
			"骏", "莫", "衍", "普", "岩", "峋", "烈", "祥", "遇", "理",
			"坎", "起", "程", "无", "孺", "捷", "欢", "用", "强", "济",
			"会", "才"
		}, new string[2] { "玲", "呤" }, new string[7] { "慧", "雨", "嘉", "佳", "瑛", "柔", "芙" }, new string[15]
		{
			"岁", "龄", "万", "川", "叶", "辰", "继", "藏", "镜", "诗",
			"里", "夷", "日", "知", "骄"
		}, new string[2] { "媚", "依" }, new string[0]);
		array[202] = new HanNameItem(202, "柏", new string[4] { "铮", "康", "苍", "榕" }, new string[2] { "怡", "雅" }, new string[6] { "英", "青", "玉", "华", "春", "芳" }, new string[6] { "年", "之", "秋", "叶", "树", "连" }, new string[0], new string[3] { "仙", "君", "桐" });
		array[203] = new HanNameItem(203, "半", new string[12]
		{
			"昌", "徽", "摧", "愁", "残", "智", "畴", "垣", "良", "舟",
			"情", "缨"
		}, new string[0], new string[1] { "慧" }, new string[7] { "山", "梧", "年", "颜", "叶", "语", "尘" }, new string[1] { "屏" }, new string[0]);
		array[204] = new HanNameItem(204, "邦", new string[38]
		{
			"昌", "翰", "庆", "彦", "安", "康", "盛", "超", "兴", "栋",
			"祐", "异", "垣", "定", "保", "亮", "泰", "固", "弘", "佳",
			"建", "岳", "乔", "隆", "匡", "立", "荣", "欣", "普", "益",
			"晏", "基", "起", "逸", "遥", "协", "威", "宁"
		}, new string[0], new string[0], new string[4] { "继", "胤", "圣", "连" }, new string[0], new string[0]);
		array[205] = new HanNameItem(205, "宝", new string[52]
		{
			"宇", "传", "符", "驹", "琨", "俊", "康", "泉", "铮", "彦",
			"徽", "畴", "亮", "骥", "轩", "丰", "岐", "峰", "谏", "阔",
			"良", "翻", "见", "鉴", "铄", "誉", "材", "锡", "荣", "吟",
			"靖", "笙", "锋", "缨", "槐", "权", "祥", "能", "遇", "瑞",
			"麟", "田", "绶", "献", "芹", "孺", "烛", "璇", "赏", "骅",
			"强", "梁榕"
		}, new string[25]
		{
			"琼", "怡", "霞", "瑗", "媛", "妍", "琴", "莲", "琳", "婵",
			"绣", "珍", "棠", "贞", "佳", "葵", "宣", "灵", "玲", "湘",
			"纶", "颐", "琰", "卓", "滢"
		}, new string[19]
		{
			"青", "玉", "谊", "宝", "瑜", "霖", "婴", "琮", "菁", "慧",
			"瑛", "琦", "林", "荃", "钰", "莹", "璨", "珅", "琛"
		}, new string[15]
		{
			"官", "楼", "川", "山", "象", "树", "辰", "继", "胤", "降",
			"集", "池", "相", "一", "育"
		}, new string[7] { "钗", "阁", "娥", "仪", "珠", "屏", "鸾" }, new string[4] { "桐", "镜", "蓝", "贻" });
		array[206] = new HanNameItem(206, "本", new string[37]
		{
			"钦", "铨", "崇", "恪", "阳", "度", "固", "化", "淳", "阔",
			"良", "绍", "直", "俅", "乔", "誉", "嵩", "商", "普", "笙",
			"慈", "益", "若", "健", "祥", "贵", "逸", "枢", "忌", "惜",
			"遥", "寓", "勤", "经", "威", "强", "梁"
		}, new string[4] { "贞", "佳", "柔", "姣" }, new string[1] { "慧" }, new string[8] { "梧", "柱", "中", "圣", "根", "尘", "书", "一" }, new string[0], new string[0]);
		array[207] = new HanNameItem(207, "辟", new string[4] { "邪", "杀", "摧", "火" }, new string[0], new string[0], new string[2] { "之", "光" }, new string[0], new string[0]);
		array[208] = new HanNameItem(208, "必", new string[18]
		{
			"大", "杀", "安", "通", "胜", "当", "奇", "摧", "归", "兴",
			"达", "坚", "昭", "殊", "成", "回", "训", "见"
		}, new string[0], new string[0], new string[6] { "行", "清", "为", "逢", "升", "怀" }, new string[0], new string[0]);
		array[209] = new HanNameItem(209, "碧", new string[12]
		{
			"宇", "琨", "徽", "渊", "云", "沧", "海", "景", "岐", "峰",
			"波", "笙"
		}, new string[49]
		{
			"霞", "玉", "瑗", "妍", "琴", "莲", "怡", "琼", "媛", "萍",
			"璃", "芸", "蓉", "嫣", "娇", "蕾", "琳", "茵", "彩", "蝶",
			"雯", "婵", "虹", "萱", "芳", "菲", "珍", "雁", "澜", "馨",
			"棠", "红", "雨", "裳", "晶", "幽", "宣", "灵", "玲", "吟",
			"衍", "湘", "逍", "芬", "熙", "荃", "芙", "莹", "瑶"
		}, new string[15]
		{
			"华", "瑜", "英", "菊", "泉", "青", "文", "羽", "染", "皎",
			"璟", "星", "琮", "钰", "绮"
		}, new string[3] { "川", "山", "空" }, new string[25]
		{
			"钗", "仙", "君", "颜", "凝", "罗", "萝", "心", "烟", "花",
			"儿", "阁", "娥", "萼", "凰", "娘", "仪", "寒", "珠", "屏",
			"鸾", "镜", "芷", "蕴", "悠"
		}, new string[9] { "血", "衣", "楼", "清", "梧", "箫", "水", "师", "桐" });
		array[210] = new HanNameItem(210, "璧", new string[1] { "徽" }, new string[9] { "霞", "玉", "怡", "琼", "媛", "琴", "莲", "婵", "珍" }, new string[7] { "青", "璟", "真", "回", "琮", "月", "琅" }, new string[0], new string[14]
		{
			"心", "人", "君", "萝", "钗", "仙", "颜", "花", "儿", "娥",
			"娘", "仪", "寒", "如"
		}, new string[2] { "清", "怀" });
		array[211] = new HanNameItem(211, "冰", new string[4] { "凌", "越", "夏", "炎" }, new string[29]
		{
			"冰", "梅", "燕", "凤", "菊", "琼", "玉", "瑗", "媛", "妍",
			"琴", "莲", "华", "璃", "蓉", "倩", "素", "婵", "雁", "澜",
			"艳", "灵", "惠", "莹", "璇", "琰", "沅", "瑚", "滢"
		}, new string[2] { "琅", "融" }, new string[0], new string[14]
		{
			"心", "罗", "萝", "清", "仙", "颜", "箫", "花", "儿", "娥",
			"萼", "竹", "轻", "芷"
		}, new string[0]);
		array[212] = new HanNameItem(212, "秉", new string[32]
		{
			"文", "恬", "渊", "冈", "安", "谊", "诚", "翰", "彦", "徽",
			"乾", "义", "业", "承", "先", "勋", "刚", "哲", "善", "玄",
			"和", "敦", "信", "正", "贤", "楷", "俅", "吟", "节", "谦",
			"廉", "纲"
		}, new string[0], new string[0], new string[9] { "清", "光", "孝", "诺", "恩", "则", "怀", "中", "一" }, new string[0], new string[0]);
		array[213] = new HanNameItem(213, "不", new string[14]
		{
			"当", "平", "摧", "同", "群", "破", "齐", "回", "化", "谏",
			"慧", "求", "念", "欢"
		}, new string[0], new string[7] { "忧", "归", "弃", "笑", "离", "染", "悔" }, new string[14]
		{
			"败", "换", "畏", "为", "凡", "阿", "渐", "树", "怀", "名",
			"及", "退", "仇", "葬"
		}, new string[0], new string[0]);
		array[214] = new HanNameItem(214, "步", new string[5] { "衡", "云", "先", "鸿", "嵩" }, new string[0], new string[0], new string[2] { "斗", "辰" }, new string[0], new string[0]);
		array[215] = new HanNameItem(215, "博", new string[36]
		{
			"闻", "文", "艺", "通", "谊", "盛", "翰", "铨", "义", "赋",
			"超", "兴", "承", "仁", "洪", "善", "广", "韬", "彰", "昭",
			"辉", "阳", "亮", "丰", "辅", "弘", "见", "鉴", "居", "乔",
			"骏", "普", "逍", "丘", "遇", "贵"
		}, new string[0], new string[2] { "雅", "嘉" }, new string[10] { "容", "斗", "为", "约", "高", "学", "怀", "胤", "标", "育" }, new string[0], new string[0]);
		array[216] = new HanNameItem(216, "辨", new string[41]
		{
			"涛", "通", "昌", "徽", "韬", "辉", "方", "忠", "威", "亨",
			"经", "宽", "恭", "均", "钧", "庚", "开", "彪", "惇", "踪",
			"晖", "章", "尧", "衡", "弘", "宏", "材", "才", "杰", "恒",
			"成", "勇", "理", "信", "雄", "钰", "松", "礼", "直", "荣",
			"名"
		}, new string[38]
		{
			"佳", "贞", "樱", "珍", "姣", "茵", "馨", "幽", "芬", "珈",
			"淑", "芝", "音", "芳", "雯", "琅", "妍", "璃", "芸", "瑶",
			"璇", "荷", "琪", "婷", "琼", "梅", "雪", "彩", "琬", "凤",
			"绣", "秀", "妙", "画", "慧", "瑛", "霞", "英"
		}, new string[22]
		{
			"聪", "星", "殊", "心", "攸", "机", "知", "秋", "瑚", "和",
			"茗", "琦", "瑜", "文", "慈", "麟", "难", "容", "绮", "璟",
			"善", "福"
		}, new string[10] { "根", "中", "危", "豪", "潮", "陶", "恶", "圣", "山", "君" }, new string[7] { "珂", "仙", "萤", "絮", "巧", "仪", "真" }, new string[2] { "空", "己" });
		array[300] = new HanNameItem(300, "残", new string[15]
		{
			"赋", "徽", "风", "志", "生", "存", "续", "辉", "阳", "枫",
			"宵", "慕", "吟", "缨", "让"
		}, new string[6] { "冰", "茵", "雯", "绣", "菲", "雨" }, new string[13]
		{
			"绛", "乐", "青", "玉", "邪", "梅", "愁", "虹", "芳", "星",
			"馨", "述", "霜"
		}, new string[3] { "光", "秋", "冬" }, new string[4] { "烟", "心", "梦", "萼" }, new string[5] { "清", "血", "璧", "箫", "芷" });
		array[301] = new HanNameItem(301, "苍", new string[28]
		{
			"云", "宇", "青", "玉", "冈", "龙", "残", "畴", "鹏", "虹",
			"珉", "玄", "独", "朔", "雄", "骥", "景", "岐", "峰", "雁",
			"枫", "然", "弘", "宏", "雨", "岳", "锋", "楠"
		}, new string[0], new string[1] { "瑛" }, new string[13]
		{
			"天", "候", "柏", "山", "梧", "君", "颜", "客", "秋", "猿",
			"桐", "豪", "鹤"
		}, new string[0], new string[0]);
		array[302] = new HanNameItem(302, "沧", new string[26]
		{
			"浪", "泉", "涛", "平", "洪", "临", "扬", "偃", "至", "伏",
			"远", "洋", "浩", "弘", "鸿", "雨", "良", "舟", "史", "淞",
			"凌", "慕", "楠", "融", "瀛", "沣"
		}, new string[4] { "怡", "莲", "萍", "沅" }, new string[7] { "海", "青", "离", "霖", "怜", "澜", "月" }, new string[4] { "流", "潮", "来", "辰" }, new string[0], new string[4] { "清", "君", "璧", "寒" });
		array[303] = new HanNameItem(303, "昌", new string[61]
		{
			"朝", "平", "业", "迅", "牧", "谊", "盛", "邦", "德", "元",
			"泰", "固", "弘", "宏", "鸿", "阔", "良", "新", "直", "九",
			"咏", "乔", "伟", "隆", "嵩", "荣", "甫", "灵", "逵", "普",
			"益", "健", "浦", "贵", "晏", "瑞", "奕", "颖", "毅", "适",
			"游", "起", "逸", "维", "奎", "瑾", "绶", "宜", "炎", "伦",
			"永", "仑", "纮", "修", "复", "猛", "烨", "穆", "会", "梁",
			"茂"
		}, new string[0], new string[0], new string[10] { "龄", "期", "明", "祖", "升", "怀", "连", "运", "犀", "弼" }, new string[0], new string[0]);
		array[304] = new HanNameItem(304, "常", new string[22]
		{
			"安", "通", "康", "胜", "祐", "丰", "训", "良", "楷", "隆",
			"荣", "念", "韶", "恕", "遇", "贵", "瑞", "喜", "腾", "逸",
			"习", "宽"
		}, new string[1] { "怡" }, new string[7] { "笑", "乐", "青", "悦", "回", "慧", "雨" }, new string[1] { "圣" }, new string[0], new string[0]);
		array[305] = new HanNameItem(305, "长", new string[17]
		{
			"风", "胜", "吉", "源", "皎", "恭", "安", "通", "康", "盛",
			"赋", "生", "丰", "禄", "治", "鸿", "靖"
		}, new string[3] { "倩", "怡", "秀" }, new string[6] { "青", "乐", "春", "馨", "菁", "慧" }, new string[5] { "发", "龄", "明", "空", "升" }, new string[0], new string[1] { "梦" });
		array[306] = new HanNameItem(306, "超", new string[11]
		{
			"兴", "智", "谊", "胜", "青", "群", "博", "先", "雄", "弘",
			"宏"
		}, new string[0], new string[0], new string[4] { "伯", "凡", "之", "清" }, new string[0], new string[0]);
		array[307] = new HanNameItem(307, "朝", new string[10] { "栋", "生", "宗", "徽", "鸣", "东", "阳", "旭", "鸿", "咏" }, new string[0], new string[8] { "英", "谊", "青", "霞", "华", "霖", "昕", "澜" }, new string[3] { "础", "南", "辰" }, new string[0], new string[0]);
		array[308] = new HanNameItem(308, "潮", new string[4] { "生", "归", "临", "偃" }, new string[0], new string[0], new string[3] { "清", "寒", "升" }, new string[0], new string[0]);
		array[309] = new HanNameItem(309, "承", new string[62]
		{
			"先", "志", "勋", "畴", "福", "庆", "实", "祐", "晋", "谊",
			"英", "盛", "昌", "彦", "徽", "乾", "艺", "义", "业", "福",
			"德", "刚", "哲", "典", "玄", "辉", "和", "信", "旭", "贤",
			"铎", "训", "化", "阔", "火", "慧", "良", "绍", "言", "剑",
			"舟", "新", "史", "敏", "咏", "誉", "荣", "越", "祥", "让",
			"贵", "晦", "麟", "均", "廉", "襄", "钧", "殇", "欢", "炎",
			"羲", "会"
		}, new string[1] { "艳" }, new string[0], new string[17]
		{
			"宗", "嗣", "祖", "期", "光", "恩", "孝", "道", "诺", "则",
			"珠", "怀", "金", "运", "轨", "知", "育"
		}, new string[0], new string[0]);
		array[310] = new HanNameItem(310, "乘", new string[7] { "风", "翰", "宇", "云", "玄", "轩", "波" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[311] = new HanNameItem(311, "冲", new string[20]
		{
			"魁", "驹", "钦", "涛", "宵", "平", "云", "晋", "元", "昕",
			"异", "玄", "锐", "阳", "方", "朔", "扬", "景", "庚", "霄"
		}, new string[0], new string[0], new string[4] { "之", "天", "豪", "升" }, new string[0], new string[0]);
		array[312] = new HanNameItem(312, "崇", new string[32]
		{
			"先", "望", "义", "恪", "俭", "谊", "英", "翰", "焕", "彦",
			"华", "志", "乾", "德", "仁", "哲", "善", "玄", "辉", "礼",
			"敦", "信", "武", "贤", "度", "禹", "谏", "火", "乔", "骏",
			"让", "辩"
		}, new string[0], new string[0], new string[9] { "祖", "清", "君", "明", "孝", "道", "恩", "怀", "圣" }, new string[0], new string[0]);
		array[313] = new HanNameItem(313, "楚", new string[11]
		{
			"彦", "源", "贤", "阔", "良", "翻", "乔", "开", "槐", "彬",
			"襄"
		}, new string[19]
		{
			"怡", "琼", "媛", "妍", "莲", "萍", "芸", "嫣", "倩", "娇",
			"茵", "秀", "萱", "曼", "菲", "珍", "红", "幽", "香"
		}, new string[11]
		{
			"谊", "英", "青", "玉", "瑜", "文", "忧", "怜", "雁", "瑛",
			"吟"
		}, new string[2] { "客", "怀" }, new string[4] { "颜", "容", "楚", "儿" }, new string[2] { "衣", "箫" });
		array[314] = new HanNameItem(314, "处", new string[8] { "俊", "仁", "安", "盛", "衡", "正", "亮", "贤" }, new string[0], new string[0], new string[1] { "约" }, new string[0], new string[0]);
		array[315] = new HanNameItem(315, "传", new string[25]
		{
			"霖", "胜", "钦", "徽", "志", "艺", "义", "赋", "鸣", "贤",
			"良", "史", "咏", "誉", "情", "锡", "衍", "益", "逍", "祥",
			"喜", "廉", "钰", "永", "筠"
		}, new string[0], new string[7] { "素", "谊", "英", "莲", "星", "馨", "嘉" }, new string[3] { "道", "裔", "孙" }, new string[0], new string[0]);
		array[316] = new HanNameItem(316, "春", new string[8] { "雷", "徽", "畴", "至", "伏", "槐", "随", "昂" }, new string[36]
		{
			"娇", "蕾", "怡", "菊", "琼", "霞", "媛", "妍", "琴", "莲",
			"梅", "燕", "萍", "芸", "蓉", "嫣", "倩", "蝶", "婵", "秀",
			"芳", "菲", "馨", "棠", "回", "樱", "红", "雨", "娟", "香",
			"宣", "吟", "林", "露", "杏", "馥"
		}, new string[19]
		{
			"华", "霖", "煦", "风", "琳", "英", "泉", "瑜", "恬", "愁",
			"归", "皎", "催", "临", "澜", "悦", "波", "还", "融"
		}, new string[5] { "秋", "柏", "流", "树", "降" }, new string[12]
		{
			"花", "萝", "颜", "凝", "儿", "阁", "娥", "萼", "娘", "叶",
			"竹", "如"
		}, new string[5] { "来", "水", "梧", "桐", "寒" });
		array[317] = new HanNameItem(317, "纯", new string[7] { "刚", "仁", "风", "彦", "徽", "和", "阳" }, new string[0], new string[6] { "谊", "英", "华", "奇", "素", "真" }, new string[0], new string[1] { "儿" }, new string[1] { "清" });
		array[318] = new HanNameItem(318, "从", new string[21]
		{
			"进", "哲", "彦", "志", "乾", "弃", "义", "善", "和", "悌",
			"简", "训", "谏", "火", "楷", "绍", "俅", "匡", "廉", "钧",
			"绪"
		}, new string[0], new string[4] { "谊", "英", "忧", "染" }, new string[14]
		{
			"山", "流", "容", "约", "阁", "孝", "道", "则", "语", "中",
			"圣", "轨", "一", "府"
		}, new string[0], new string[3] { "朱", "清", "声" });
		array[319] = new HanNameItem(319, "翠", new string[1] { "徽" }, new string[45]
		{
			"霞", "茵", "怡", "菊", "琼", "霞", "瑗", "媛", "妍", "琴",
			"莲", "羽", "萍", "璃", "芸", "蓉", "嫣", "青", "娇", "琳",
			"蝶", "雯", "婵", "萱", "芳", "星", "珍", "澜", "馨", "红",
			"裳", "贞", "晶", "香", "宣", "缨", "熙", "颖", "芹", "莹",
			"珈", "莺", "荷", "滢", "洁"
		}, new string[4] { "华", "英", "瑜", "璟" }, new string[1] { "山" }, new string[21]
		{
			"仙", "罗", "萝", "梧", "钗", "君", "颜", "凝", "花", "儿",
			"阁", "娥", "蔼", "萼", "娘", "叶", "鸾", "霭", "依", "环",
			"圆"
		}, new string[3] { "衣", "箫", "桐" });
		array[320] = new HanNameItem(320, "彩", new string[0], new string[36]
		{
			"蝶", "怡", "凤", "英", "琼", "玉", "霞", "瑗", "媛", "妍",
			"琴", "莲", "华", "瑜", "燕", "羽", "萍", "璃", "云", "嫣",
			"倩", "娇", "琳", "雯", "绣", "星", "悦", "裳", "艳", "香",
			"玲", "缨", "纶", "莺", "荷", "洁"
		}, new string[0], new string[0], new string[16]
		{
			"罗", "萝", "衣", "梧", "璧", "箫", "花", "儿", "阁", "娥",
			"凰", "桐", "袖", "珠", "屏", "媚"
		}, new string[0]);
		array[321] = new HanNameItem(321, "赤", new string[9] { "魁", "琨", "云", "崇", "星", "景", "坦", "雨", "锋" }, new string[12]
		{
			"琼", "瑗", "琴", "莲", "萍", "璃", "嫣", "琳", "蝶", "雯",
			"菲", "裳"
		}, new string[10] { "霞", "白", "英", "泉", "华", "瑜", "羽", "染", "虹", "雁" }, new string[3] { "辰", "照", "晴" }, new string[2] { "钗", "凰" }, new string[7] { "罗", "衣", "梧", "仙", "君", "心", "桐" });
		array[322] = new HanNameItem(322, "存", new string[32]
		{
			"质", "续", "志", "安", "邦", "彦", "钦", "义", "恪", "仁",
			"丰", "禄", "阔", "良", "楷", "微", "隆", "荣", "衍", "念",
			"慈", "益", "让", "晦", "瑞", "喜", "节", "奕", "毅", "谅",
			"夏", "钰"
		}, new string[3] { "艳", "香", "琰" }, new string[7] { "谊", "英", "玉", "忧", "芳", "殊", "熙" }, new string[8] { "孝", "碧", "道", "恩", "中", "声", "镜", "犀" }, new string[0], new string[0]);
		array[323] = new HanNameItem(323, "催", new string[16]
		{
			"杀", "涛", "平", "归", "衡", "晋", "冲", "进", "达", "悼",
			"迪", "和", "偃", "远", "度", "衍"
		}, new string[0], new string[7] { "英", "青", "邪", "华", "文", "离", "澜" }, new string[1] { "之" }, new string[1] { "弟" }, new string[0]);
		array[324] = new HanNameItem(324, "晨", new string[31]
		{
			"涛", "辉", "舟", "嵩", "枫", "峰", "渊", "沧", "徽", "乾",
			"鹏", "元", "翔", "畴", "潜", "磐", "朗", "磊", "昶", "宇",
			"骏", "瑞", "毅", "耀", "茂", "烨", "焕", "骥", "风", "松",
			"新"
		}, new string[21]
		{
			"菁", "岚", "芝", "姿", "樱", "娟", "莺", "芳", "薇", "萱",
			"馨", "幽", "莲", "妍", "雪", "蕾", "蕙", "英", "曦", "雨",
			"澜"
		}, new string[10] { "青", "星", "霜", "熙", "昭", "康", "光", "宁", "礼", "露" }, new string[5] { "潮", "山", "晓", "熠", "灏" }, new string[6] { "溪", "竹", "海", "霭", "梦", "月" }, new string[0]);
		array[325] = new HanNameItem(325, "慈", new string[53]
		{
			"商", "绅", "亨", "锋", "恭", "惇", "斌", "彰", "徽", "忠",
			"韬", "诚", "仁", "勤", "捷", "传", "哲", "节", "成", "远",
			"俭", "朗", "武", "彦", "胜", "俊", "恪", "绍", "烈", "毅",
			"茂", "烨", "焕", "盛", "泰", "健", "献", "翰", "建", "骥",
			"信", "浩", "穆", "禄", "悌", "义", "慎", "康", "弼", "简",
			"顺", "敬", "恕"
		}, new string[41]
		{
			"贞", "樱", "娟", "芳", "茵", "萱", "菲", "音", "珍", "嫣",
			"娇", "馨", "淑", "珊", "莲", "媛", "妍", "萍", "璃", "芸",
			"芙", "瑶", "璇", "娴", "琼", "婕", "洁", "颖", "苇", "巧",
			"琬", "谨", "倩", "秀", "静", "懿", "慧", "心", "雅", "敏",
			"清"
		}, new string[11]
		{
			"婴", "英", "安", "昭", "和", "宁", "文", "贤", "斐", "礼",
			"善"
		}, new string[5] { "恩", "圣", "胤", "孝", "灏" }, new string[5] { "蕴", "君", "真", "怀", "意" }, new string[2] { "幼", "先" });
		array[326] = new HanNameItem(326, "初", new string[19]
		{
			"辉", "晖", "兴", "乾", "承", "元", "宏", "纮", "杰", "哲",
			"成", "启", "毅", "耀", "茂", "烨", "焕", "复", "济"
		}, new string[18]
		{
			"芬", "芳", "雯", "蝶", "妍", "萍", "娴", "菊", "梅", "雪",
			"颖", "谨", "霁", "秀", "静", "湛", "璨", "慧"
		}, new string[12]
		{
			"煦", "嘉", "英", "春", "归", "秋", "和", "宁", "霖", "晏",
			"奕", "照"
		}, new string[0], new string[0], new string[2] { "冬", "夏" });
		array[327] = new HanNameItem(327, "川", new string[9] { "宏", "杰", "珉", "彦", "翰", "建", "骥", "浩", "旭" }, new string[6] { "樱", "雯", "滢", "静", "霞", "虹" }, new string[2] { "英", "澄" }, new string[3] { "流", "潮", "明" }, new string[2] { "镜", "月" }, new string[0]);
		array[400] = new HanNameItem(400, "达", new string[19]
		{
			"平", "海", "通", "康", "胜", "昌", "摧", "衡", "超", "开",
			"宏", "鸿", "舟", "隆", "楠", "三", "襄", "奎", "寓"
		}, new string[0], new string[1] { "瑛" }, new string[1] { "明" }, new string[0], new string[0]);
		array[401] = new HanNameItem(401, "大", new string[29]
		{
			"鸣", "彪", "洪", "鹏", "平", "善", "全", "海", "元", "锦",
			"安", "典", "昕", "异", "渊", "业", "坚", "临", "牛", "通",
			"同", "鼎", "敦", "炳", "成", "弘", "宏", "训", "力"
		}, new string[0], new string[0], new string[7] { "有", "千", "眼", "壮", "川", "富", "树" }, new string[0], new string[0]);
		array[402] = new HanNameItem(402, "待", new string[7] { "铨", "衡", "朝", "超", "兴", "翊", "柬" }, new string[0], new string[1] { "雨" }, new string[5] { "价", "举", "辰", "胤", "鉴" }, new string[0], new string[0]);
		array[403] = new HanNameItem(403, "黛", new string[0], new string[20]
		{
			"英", "青", "玉", "媛", "莲", "华", "文", "蕾", "琳", "雯",
			"艳", "嘉", "懿", "幽", "娟", "誉", "香", "月", "纤", "姣"
		}, new string[0], new string[0], new string[4] { "君", "罗", "儿", "娥" }, new string[0]);
		array[404] = new HanNameItem(404, "丹", new string[5] { "垣", "生", "阳", "洛", "林" }, new string[30]
		{
			"凤", "菊", "琼", "玉", "瑗", "媛", "妍", "琴", "莲", "燕",
			"萍", "蓉", "倩", "蕾", "琳", "雯", "婵", "雁", "樱", "红",
			"幽", "娟", "露", "杏", "贵", "颐", "呤", "卓", "娅", "姣"
		}, new string[12]
		{
			"虹", "霞", "珉", "英", "泉", "青", "华", "瑜", "文", "琅",
			"越", "晏"
		}, new string[4] { "石", "鹤", "照", "晓" }, new string[6] { "罗", "萝", "钗", "君", "娥", "珠" }, new string[3] { "心", "梧", "桐" });
		array[405] = new HanNameItem(405, "悼", new string[9] { "崇", "熊", "钦", "杀", "摧", "残", "生", "先", "存" }, new string[0], new string[9] { "怜", "英", "青", "莲", "忧", "愁", "离", "悔", "真" }, new string[5] { "之", "秋", "非", "怀", "民" }, new string[0], new string[1] { "君" });
		array[406] = new HanNameItem(406, "道", new string[30]
		{
			"通", "广", "安", "康", "诚", "传", "奇", "同", "衡", "博",
			"源", "仁", "从", "元", "玄", "惇", "和", "正", "远", "坦",
			"恒", "弘", "宏", "化", "淳", "微", "权", "显", "毅", "铁"
		}, new string[0], new string[0], new string[9] { "周", "清", "凡", "明", "寒", "升", "树", "极", "施" }, new string[0], new string[0]);
		array[407] = new HanNameItem(407, "得", new string[9] { "海", "韬", "康", "胜", "魁", "福", "彪", "锡", "羲" }, new string[2] { "怡", "琼" }, new string[1] { "谊" }, new string[5] { "象", "语", "中", "继", "胤" }, new string[0], new string[0]);
		array[408] = new HanNameItem(408, "德", new string[69]
		{
			"华", "璟", "玄", "裕", "彰", "昭", "真", "审", "惇", "辉",
			"康", "盛", "诚", "铮", "源", "超", "先", "勋", "刚", "存",
			"全", "彰", "敦", "培", "炳", "正", "贤", "宏", "弘", "训",
			"良", "绍", "言", "柬", "见", "剑", "微", "巍", "居", "誉",
			"隆", "嵩", "宣", "荣", "欣", "逵", "弥", "骏", "慕", "衍",
			"普", "韶", "槐", "祥", "让", "贵", "瑞", "均", "显", "旺",
			"程", "延", "范", "永", "烨", "尚", "羲", "济", "磊"
		}, new string[4] { "怡", "琼", "莲", "雅" }, new string[9] { "英", "华", "瑜", "恬", "秀", "芳", "馨", "嘉", "懿" }, new string[17]
		{
			"时", "诺", "容", "年", "本", "为", "明", "处", "怀", "辰",
			"继", "偕", "标", "镜", "照", "施", "育"
		}, new string[0], new string[1] { "清" });
		array[409] = new HanNameItem(409, "蝶", new string[0], new string[9] { "英", "媛", "华", "羽", "嫣", "彩", "裳", "幽", "香" }, new string[0], new string[0], new string[10] { "衣", "清", "钗", "仙", "君", "心", "梦", "花", "儿", "仪" }, new string[0]);
		array[410] = new HanNameItem(410, "迪", new string[3] { "先", "嗣", "志" }, new string[0], new string[0], new string[2] { "清", "孝" }, new string[0], new string[0]);
		array[411] = new HanNameItem(411, "鼎", new string[15]
		{
			"和", "锐", "元", "兴", "勋", "阳", "弘", "宏", "言", "誉",
			"材", "开", "隆", "嵩", "荣"
		}, new string[0], new string[0], new string[4] { "臣", "清", "伯", "运" }, new string[0], new string[0]);
		array[412] = new HanNameItem(412, "定", new string[29]
		{
			"保", "安", "康", "牧", "邦", "宇", "冈", "涛", "乾", "坤",
			"齐", "伯", "沧", "海", "业", "风", "刚", "元", "玄", "阳",
			"方", "雄", "禹", "回", "火", "巍", "楠", "权", "羲"
		}, new string[6] { "玉", "霞", "娇", "蕾", "雯", "婵" }, new string[2] { "虹", "澜" }, new string[14]
		{
			"之", "斗", "候", "国", "山", "伯", "约", "恩", "则", "升",
			"怀", "中", "标", "轨"
		}, new string[0], new string[0]);
		array[413] = new HanNameItem(413, "东", new string[5] { "风", "阳", "华", "起", "洵" }, new string[0], new string[0], new string[6] { "来", "梧", "行", "潮", "升", "狮" }, new string[0], new string[0]);
		array[414] = new HanNameItem(414, "冬", new string[4] { "莫", "缨", "祥", "鸥" }, new string[15]
		{
			"琼", "莲", "燕", "萍", "蕾", "婵", "樱", "雨", "娟", "月",
			"美", "吟", "露", "芙", "莹"
		}, new string[9] { "梅", "琴", "华", "青", "霖", "临", "雁", "澜", "越" }, new string[5] { "候", "柏", "寒", "照", "日" }, new string[4] { "萝", "花", "娥", "萼" }, new string[2] { "梧", "初" });
		array[415] = new HanNameItem(415, "洞", new string[4] { "玄", "潜", "霞", "宾" }, new string[0], new string[0], new string[3] { "清", "光", "仙" }, new string[0], new string[0]);
		array[416] = new HanNameItem(416, "独", new string[10] { "魁", "彦", "赋", "质", "鸣", "异", "回", "吟", "栖", "敖" }, new string[4] { "倩", "娇", "艳", "美" }, new string[5] { "秀", "素", "芳", "馨", "嘉" }, new string[7] { "行", "豪", "辰", "怀", "标", "狮", "骄" }, new string[0], new string[1] { "仙" });
		array[417] = new HanNameItem(417, "端", new string[9] { "礼", "徽", "艺", "义", "哲", "善", "仁", "然", "直" }, new string[0], new string[4] { "谊", "华", "文", "纯" }, new string[1] { "本" }, new string[0], new string[0]);
		array[418] = new HanNameItem(418, "敦", new string[11]
		{
			"培", "仁", "信", "谊", "文", "义", "哲", "阔", "植", "益",
			"丘"
		}, new string[0], new string[0], new string[2] { "之", "孝" }, new string[0], new string[0]);
		array[419] = new HanNameItem(419, "登", new string[19]
		{
			"舟", "嵩", "丰", "先", "昌", "魁", "奎", "献", "穆", "晋",
			"荣", "平", "龙", "贤", "康", "顺", "远", "兴", "义"
		}, new string[2] { "善", "慧" }, new string[1] { "宁" }, new string[4] { "科", "堂", "岳", "圣" }, new string[0], new string[0]);
		array[420] = new HanNameItem(420, "典", new string[11]
		{
			"邦", "纲", "丰", "锡", "钦", "渊", "彰", "章", "昌", "宏",
			"浩"
		}, new string[2] { "雅", "慧" }, new string[0], new string[1] { "明" }, new string[0], new string[0]);
		array[421] = new HanNameItem(421, "笃", new string[19]
		{
			"坚", "先", "恭", "谦", "昌", "忠", "诚", "常", "节", "群",
			"恒", "成", "志", "胜", "恪", "进", "义", "慎", "康"
		}, new string[13]
		{
			"贞", "芬", "珍", "姣", "娇", "洁", "颖", "妙", "慧", "嘉",
			"佳", "柔", "慈"
		}, new string[4] { "宁", "直", "贤", "善" }, new string[2] { "学", "孝" }, new string[0], new string[2] { "良", "真" });
		array[500] = new HanNameItem(500, "恩", new string[98]
		{
			"炳", "盛", "徽", "博", "赋", "皎", "福", "祐", "嗣", "存",
			"洪", "昭", "培", "贤", "宏", "淳", "阔", "翻", "绍", "见",
			"建", "剑", "迁", "铄", "微", "居", "俅", "咏", "伟", "誉",
			"开", "隆", "嵩", "求", "葵", "锡", "立", "宣", "荣", "甫",
			"洛", "逵", "弥", "沛", "骏", "慕", "衍", "普", "靖", "慈",
			"佩", "丘", "峋", "林", "健", "韶", "槐", "祥", "让", "遇",
			"晦", "瑞", "宾", "思", "节", "显", "泽", "毅", "适", "涣",
			"随", "起", "护", "惟", "维", "程", "奎", "斌", "瑾", "殇",
			"惜", "绶", "献", "钰", "遥", "驰", "勃", "宿", "宜", "延",
			"威", "永", "纮", "复", "尚", "穆", "澄", "布"
		}, new string[5] { "贞", "裳", "佳", "露", "滢" }, new string[8] { "谊", "华", "奇", "霖", "回", "嘉", "懿", "熙" }, new string[24]
		{
			"伯", "容", "怀", "际", "中", "胤", "标", "鉴", "藏", "圣",
			"集", "连", "名", "晴", "厚", "弼", "双", "仇", "施", "晓",
			"贻", "堂", "育", "民"
		}, new string[0], new string[0]);
		array[501] = new HanNameItem(501, "尔", new string[51]
		{
			"昌", "维", "贤", "礼", "禄", "恒", "勇", "恭", "谦", "慎",
			"恪", "恕", "顺", "旺", "悌", "靖", "显", "志", "诚", "义",
			"勤", "弘", "崇", "俭", "仁", "进", "毅", "威", "纮", "坦",
			"良", "聪", "焕", "伟", "亨", "沛", "俊", "博", "齐", "晋",
			"彰", "章", "平", "善", "永", "翔", "才", "衍", "扬", "浩",
			"新"
		}, new string[24]
		{
			"雅", "慧", "韵", "贞", "蓉", "欣", "静", "秀", "婕", "淳",
			"恬", "婷", "颖", "宜", "娟", "颐", "琼", "懿", "熙", "柔",
			"慈", "美", "容", "笙"
		}, new string[7] { "善", "华", "祥", "明", "英", "仪", "宁" }, new string[9] { "孝", "升", "颢", "辰", "怀", "鉴", "真", "凡", "君" }, new string[1] { "欢" }, new string[0]);
		array[502] = new HanNameItem(502, "萼", new string[0], new string[5] { "秀", "芳", "香", "华", "雪" }, new string[0], new string[0], new string[0], new string[0]);
		array[600] = new HanNameItem(600, "发", new string[4] { "兴", "晋", "冲", "朔" }, new string[0], new string[3] { "春", "桂", "华" }, new string[0], new string[0], new string[1] { "清" });
		array[601] = new HanNameItem(601, "方", new string[46]
		{
			"正", "朔", "豫", "质", "旭", "英", "盛", "当", "彦", "青",
			"栋", "生", "畴", "刚", "雄", "泰", "度", "坦", "阔", "岳",
			"敬", "俅", "骏", "莫", "佩", "烈", "槐", "恕", "晏", "轼",
			"奕", "适", "敖", "逸", "维", "纪", "遥", "宿", "绪", "宜",
			"耀", "踪", "儒", "筠", "磊", "茂"
		}, new string[1] { "露" }, new string[0], new string[8] { "受", "叔", "清", "天", "明", "豪", "怀", "咎" }, new string[0], new string[0]);
		array[602] = new HanNameItem(602, "芳", new string[9] { "亮", "松", "源", "畴", "质", "垣", "培", "景", "偃" }, new string[41]
		{
			"曼", "菲", "怡", "菊", "琼", "玉", "霞", "媛", "妍", "琴",
			"莲", "梅", "萍", "芸", "蓉", "雅", "嫣", "春", "蕾", "纯",
			"茵", "彩", "蝶", "雯", "虹", "秀", "萱", "芳", "澜", "馨",
			"樱", "菁", "艳", "静", "葵", "灵", "玲", "欣", "韶", "泽",
			"娅"
		}, new string[14]
		{
			"华", "谊", "英", "泉", "青", "瑜", "皎", "霖", "催", "昕",
			"临", "昭", "贤", "淳"
		}, new string[5] { "候", "流", "客", "处", "树" }, new string[22]
		{
			"蔼", "碧", "萝", "衣", "梧", "钗", "君", "颜", "心", "容",
			"梦", "花", "儿", "阁", "娥", "萼", "仪", "桐", "初", "袖",
			"叶", "怀"
		}, new string[2] { "清", "来" });
		array[603] = new HanNameItem(603, "飞", new string[16]
		{
			"雄", "文", "武", "骥", "宇", "鹏", "扬", "景", "轩", "羽",
			"龙", "虎", "云", "鸿", "霄", "蛟"
		}, new string[9] { "燕", "凤", "霞", "雯", "婵", "飞", "裳", "霜", "莺" }, new string[5] { "虹", "英", "华", "星", "雁" }, new string[5] { "猿", "斗", "豪", "鹤", "升" }, new string[5] { "萼", "花", "儿", "凰", "屏" }, new string[1] { "竹" });
		array[604] = new HanNameItem(604, "非", new string[6] { "残", "常", "俅", "情", "过", "欢" }, new string[2] { "莲", "倩" }, new string[7] { "玉", "邪", "瑜", "奇", "忧", "愁", "真" }, new string[7] { "道", "阿", "石", "山", "凡", "天", "臣" }, new string[4] { "儿", "烟", "仙", "君" }, new string[3] { "花", "璧", "梦" });
		array[605] = new HanNameItem(605, "菲", new string[0], new string[5] { "妍", "嫣", "茵", "菲", "嘉" }, new string[5] { "青", "殊", "英", "华", "霖" }, new string[1] { "候" }, new string[1] { "萝" }, new string[0]);
		array[606] = new HanNameItem(606, "风", new string[6] { "翰", "云", "翻", "丘", "林", "啸" }, new string[1] { "玲" }, new string[2] { "愁", "华" }, new string[2] { "发", "尘" }, new string[0], new string[1] { "清" });
		array[607] = new HanNameItem(607, "丰", new string[5] { "稷", "盛", "齐", "洪", "和" }, new string[0], new string[0], new string[2] { "斗", "柏" }, new string[0], new string[0]);
		array[608] = new HanNameItem(608, "逢", new string[6] { "泰", "震", "朔", "火", "新", "逍" }, new string[1] { "怡" }, new string[1] { "春" }, new string[0], new string[0], new string[0]);
		array[609] = new HanNameItem(609, "福", new string[80]
		{
			"偃", "寿", "至", "亥", "牛", "安", "康", "盛", "泉", "宝",
			"琨", "玉", "瑜", "涛", "海", "业", "源", "生", "承", "勋",
			"畴", "祐", "嗣", "德", "存", "催", "洪", "全", "元", "临",
			"裕", "昭", "辉", "旭", "骥", "轩", "稷", "贤", "禄", "成",
			"弘", "宏", "阔", "良", "翻", "言", "柬", "见", "剑", "微",
			"九", "巍", "开", "隆", "求", "锡", "凌", "衍", "靖", "楠",
			"越", "祥", "让", "遇", "贵", "瑞", "由", "显", "泽", "殷",
			"起", "襄", "田", "惜", "献", "钰", "宽", "永", "招", "筠"
		}, new string[0], new string[0], new string[17]
		{
			"山", "楼", "天", "处", "来", "阁", "恩", "裔", "升", "胤",
			"鉴", "集", "连", "竹", "照", "厚", "兆"
		}, new string[0], new string[0]);
		array[610] = new HanNameItem(610, "凤", new string[0], new string[59]
		{
			"冕", "怡", "玉", "霞", "瑗", "媛", "妍", "琴", "莲", "冰",
			"梅", "羽", "萍", "归", "芸", "雅", "嫣", "皎", "倩", "娇",
			"蕾", "琳", "纯", "彩", "蝶", "雯", "婵", "怜", "秀", "绣",
			"菲", "飞", "珍", "馨", "棠", "丽", "回", "裳", "七", "晶",
			"九", "霄", "俅", "宣", "瑛", "灵", "珊", "玲", "琦", "吟",
			"祥", "熙", "三", "颐", "呤", "淑", "惠", "婕", "滢"
		}, new string[19]
		{
			"岐", "英", "泉", "庆", "宝", "青", "华", "瑜", "文", "奇",
			"生", "鸣", "锦", "临", "轩", "贤", "还", "麟", "翔"
		}, new string[4] { "明", "南", "裔", "眉" }, new string[22]
		{
			"凰", "娘", "罗", "衣", "梧", "钗", "仙", "君", "颜", "凝",
			"烟", "约", "儿", "阁", "娥", "丹", "寒", "初", "珠", "屏",
			"骄", "依"
		}, new string[9] { "师", "仪", "朱", "楼", "清", "血", "箫", "来", "怀" });
		array[611] = new HanNameItem(611, "伏", new string[5] { "虎", "邪", "龙", "骥", "岳" }, new string[0], new string[0], new string[2] { "辰", "狮" }, new string[0], new string[0]);
		array[612] = new HanNameItem(612, "妃", new string[0], new string[20]
		{
			"怡", "琼", "霞", "媛", "妍", "蓉", "雅", "嫣", "琴", "羽",
			"芸", "燕", "红", "雪", "萱", "青", "雯", "艳", "瑛", "月"
		}, new string[0], new string[0], new string[10] { "花", "萝", "君", "颜", "心", "凝", "仙", "梦", "袖", "屏" }, new string[0]);
		array[613] = new HanNameItem(613, "斐", new string[15]
		{
			"亨", "渊", "宽", "恭", "惇", "彰", "谦", "昌", "冲", "诚",
			"仁", "玄", "哲", "恒", "翰"
		}, new string[5] { "宁", "颖", "秀", "静", "慧" }, new string[1] { "然" }, new string[0], new string[0], new string[0]);
		array[614] = new HanNameItem(614, "奉", new string[32]
		{
			"诚", "魁", "衡", "仁", "廉", "杰", "哲", "节", "恒", "俭",
			"勇", "典", "武", "智", "信", "正", "慎", "孝", "乾", "安",
			"康", "沧", "勋", "良", "常", "贤", "宏", "淳", "直", "威",
			"平", "昌"
		}, new string[11]
		{
			"贞", "音", "淑", "珍", "莲", "荃", "英", "心", "和", "宁",
			"慈"
		}, new string[3] { "贤", "英", "文" }, new string[5] { "公", "君", "明", "民", "圣" }, new string[2] { "仙", "真" }, new string[0]);
		array[615] = new HanNameItem(615, "扶", new string[11]
		{
			"辉", "邦", "宗", "斌", "晖", "基", "威", "微", "谦", "忠",
			"元"
		}, new string[0], new string[1] { "光" }, new string[3] { "危", "民", "生" }, new string[1] { "摇" }, new string[0]);
		array[616] = new HanNameItem(616, "复", new string[7] { "志", "康", "诚", "昌", "勇", "仁", "全" }, new string[5] { "嘉", "雅", "洁", "莹", "慧" }, new string[4] { "清", "华", "文", "真" }, new string[0], new string[0], new string[0]);
		array[617] = new HanNameItem(617, "富", new string[32]
		{
			"辉", "邦", "恭", "彰", "威", "谦", "忠", "庸", "通", "兴",
			"韬", "诚", "仁", "廉", "勤", "杰", "哲", "宜", "恒", "朋",
			"成", "勇", "康", "铮", "新", "良", "德", "泽", "昌", "义",
			"荣", "清"
		}, new string[24]
		{
			"贞", "芝", "樱", "娟", "湘", "萱", "珍", "姣", "琳", "媛",
			"妍", "纯", "婷", "荃", "琼", "婕", "洁", "怡", "颖", "谨",
			"嘉", "佳", "敏", "雅"
		}, new string[11]
		{
			"聪", "英", "襄", "宁", "博", "慈", "贤", "淳", "群", "礼",
			"逸"
		}, new string[4] { "家", "国", "民", "贵" }, new string[0], new string[0]);
		array[618] = new HanNameItem(618, "奋", new string[23]
		{
			"业", "威", "信", "武", "勇", "勋", "济", "跃", "越", "雄",
			"捷", "志", "立", "才", "龙", "进", "学", "弘", "宏", "习",
			"昶", "杰", "英"
		}, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[619] = new HanNameItem(619, "枫", new string[5] { "熠", "炜", "林", "涛", "声" }, new string[3] { "芸", "玉", "婷" }, new string[3] { "云", "青", "丹" }, new string[0], new string[0], new string[0]);
		array[620] = new HanNameItem(620, "峰", new string[8] { "青", "云", "远", "岚", "天", "毅", "石", "立" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[621] = new HanNameItem(621, "芙", new string[0], new string[18]
		{
			"蓉", "英", "瑛", "华", "佩", "芳", "仪", "容", "玉", "欢",
			"锦", "芸", "云", "宁", "苒", "婷", "兰", "香"
		}, new string[0], new string[0], new string[6] { "蕖", "君", "珺", "儿", "苓", "仙" }, new string[0]);
		array[622] = new HanNameItem(622, "粉", new string[0], new string[2] { "蝶", "霞" }, new string[0], new string[0], new string[2] { "桃", "黛" }, new string[0]);
		array[623] = new HanNameItem(623, "拂", new string[0], new string[1] { "香" }, new string[8] { "衣", "剑", "霜", "雪", "光", "星", "云", "月" }, new string[0], new string[1] { "青" }, new string[0]);
		array[624] = new HanNameItem(624, "服", new string[8] { "业", "礼", "义", "邦", "威", "纪", "昌", "兴" }, new string[2] { "宜", "宁" }, new string[0], new string[2] { "君", "卿" }, new string[0], new string[0]);
		array[700] = new HanNameItem(700, "敢", new string[10] { "当", "邪", "摧", "超", "先", "晋", "进", "化", "誉", "辩" }, new string[0], new string[0], new string[2] { "为", "敌" }, new string[0], new string[0]);
		array[701] = new HanNameItem(701, "高", new string[12]
		{
			"峰", "邦", "梅", "博", "扬", "弘", "宏", "鸿", "巍", "嵩",
			"植", "节"
		}, new string[0], new string[0], new string[3] { "君", "升", "怀" }, new string[0], new string[0]);
		array[702] = new HanNameItem(702, "庚", new string[7] { "康", "俊", "钦", "徽", "平", "兴", "典" }, new string[0], new string[0], new string[3] { "身", "之", "高" }, new string[0], new string[0]);
		array[703] = new HanNameItem(703, "公", new string[100]
		{
			"远", "礼", "贤", "泰", "度", "辅", "亮", "胜", "著", "禹",
			"坦", "望", "英", "义", "正", "谏", "嘉", "良", "剑", "敬",
			"直", "誉", "甫", "履", "美", "琦", "植", "骏", "衍", "佩",
			"烈", "健", "楠", "露", "韶", "越", "权", "让", "恕", "晏",
			"瑞", "隐", "翼", "基", "奕", "颖", "毅", "绩", "矩", "适",
			"守", "廉", "游", "起", "逸", "豹", "馥", "惠", "枢", "旺",
			"舒", "惟", "维", "纪", "瑾", "殇", "惜", "绶", "习", "献",
			"遥", "孺", "协", "驰", "绪", "宜", "洵", "延", "曦", "昶",
			"威", "绅", "耀", "永", "攸", "严", "修", "跃", "复", "烨",
			"尚", "穆", "拯", "羲", "勉", "儒", "济", "磊", "梁", "翔"
		}, new string[0], new string[0], new string[11]
		{
			"则", "政", "继", "胤", "鉴", "照", "书", "晓", "贻", "牙",
			"育"
		}, new string[0], new string[0]);
		array[704] = new HanNameItem(704, "恭", new string[8] { "铭", "寿", "谊", "彦", "钦", "徽", "誉", "绩" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[705] = new HanNameItem(705, "贡", new string[3] { "邦", "奇", "源" }, new string[0], new string[7] { "珍", "宝", "琴", "莲", "瑜", "青", "馨" }, new string[1] { "之" }, new string[0], new string[0]);
		array[706] = new HanNameItem(706, "孤", new string[27]
		{
			"泉", "熊", "魁", "铮", "云", "残", "沧", "俊", "鸣", "鹏",
			"鸿", "锐", "独", "雄", "骥", "扬", "峰", "火", "剑", "嵩",
			"植", "佩", "槐", "鸥", "鹰", "欢", "绅"
		}, new string[8] { "嫣", "倩", "蕾", "芳", "蝶", "雯", "婵", "樱" }, new string[19]
		{
			"雁", "燕", "英", "星", "玉", "琴", "莲", "华", "羽", "忧",
			"愁", "虹", "珍", "澜", "悦", "馨", "棠", "雪", "薇"
		}, new string[10] { "光", "明", "潮", "桐", "豪", "寒", "鹤", "怀", "标", "歌" }, new string[5] { "萝", "烟", "花", "凰", "屏" }, new string[2] { "梦", "阁" });
		array[707] = new HanNameItem(707, "固", new string[3] { "恒", "衡", "铎" }, new string[0], new string[0], new string[4] { "怀", "语", "中", "犀" }, new string[0], new string[0]);
		array[708] = new HanNameItem(708, "观", new string[5] { "承", "生", "衡", "宏", "艳" }, new string[0], new string[0], new string[1] { "辰" }, new string[0], new string[0]);
		array[709] = new HanNameItem(709, "冠", new string[6] { "英", "诚", "魁", "承", "贤", "宏" }, new string[0], new string[0], new string[3] { "南", "伯", "升" }, new string[0], new string[0]);
		array[710] = new HanNameItem(710, "光", new string[34]
		{
			"胜", "杰", "雄", "德", "澜", "辂", "禄", "溥", "启", "悌",
			"熊", "勋", "悦", "业", "大", "染", "皎", "祐", "亮", "贤",
			"辅", "坦", "浩", "化", "剑", "誉", "琦", "沛", "骏", "烈",
			"晏", "起", "纪", "耀"
		}, new string[1] { "露" }, new string[0], new string[9] { "豪", "佐", "裔", "明", "宗", "祖", "寒", "怀", "弼" }, new string[0], new string[0]);
		array[711] = new HanNameItem(711, "广", new string[78]
		{
			"元", "波", "洋", "业", "安", "通", "康", "牧", "谊", "胜",
			"盛", "泉", "当", "昌", "庆", "涛", "博", "赋", "超", "福",
			"祐", "晋", "德", "存", "达", "洪", "全", "元", "昭", "彰",
			"和", "信", "丰", "禄", "成", "浩", "弘", "宏", "莫", "鸿",
			"化", "九", "佳", "剑", "敬", "巍", "凌", "骏", "普", "念",
			"慈", "益", "栖", "峋", "烈", "林", "楠", "越", "能", "恕",
			"融", "思", "敖", "程", "田", "纪", "习", "献", "莹", "经",
			"函", "纮", "穆", "征", "朋", "茗", "筠", "才"
		}, new string[4] { "贞", "美", "缨", "露" }, new string[0], new string[17]
		{
			"明", "川", "容", "天", "富", "佐", "升", "怀", "中", "名",
			"竹", "日", "尘", "如", "知", "敌", "施"
		}, new string[0], new string[0]);
		array[712] = new HanNameItem(712, "桂", new string[3] { "康", "兴", "丰" }, new string[10] { "妍", "琴", "莲", "萍", "芸", "蓉", "雅", "芳", "芬", "芹" }, new string[5] { "馨", "英", "文", "贤", "淳" }, new string[2] { "南", "集" }, new string[2] { "珠", "叶" }, new string[1] { "清" });
		array[713] = new HanNameItem(713, "国", new string[24]
		{
			"杰", "治", "安", "英", "彦", "义", "鸿", "楷", "建", "乔",
			"立", "骏", "普", "磐", "护", "醇", "镇", "焕", "强", "拯",
			"征", "勉", "梁", "才"
		}, new string[0], new string[0], new string[5] { "柱", "祚", "怀", "功", "鉴" }, new string[0], new string[0]);
		array[714] = new HanNameItem(714, "贵", new string[27]
		{
			"勋", "商", "绅", "亨", "坚", "先", "宗", "均", "谦", "忠",
			"庸", "诚", "衡", "仁", "廉", "勤", "才", "同", "群", "恒",
			"俭", "义", "良", "民", "祥", "奇", "博"
		}, new string[31]
		{
			"贞", "芝", "珈", "萱", "珍", "淑", "雯", "玲", "媛", "妍",
			"琴", "琳", "婵", "瑶", "璇", "娴", "纯", "琪", "荃", "琼",
			"洁", "菊", "谨", "素", "秀", "欣", "英", "瑛", "菁", "清",
			"慈"
		}, new string[12]
		{
			"仪", "佳", "聪", "知", "和", "宁", "文", "平", "贤", "淳",
			"言", "善"
		}, new string[6] { "藏", "本", "友", "胤", "孝", "荫" }, new string[3] { "真", "桐", "竹" }, new string[0]);
		array[715] = new HanNameItem(715, "刚", new string[17]
		{
			"勇", "武", "毅", "峰", "锋", "志", "龙", "虎", "诚", "义",
			"永", "旭", "岳", "松", "岩", "石", "剑"
		}, new string[2] { "倩", "兰" }, new string[0], new string[0], new string[0], new string[0]);
		array[716] = new HanNameItem(716, "更", new string[4] { "新", "明", "华", "兴" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[717] = new HanNameItem(717, "归", new string[1] { "鸿" }, new string[1] { "燕" }, new string[6] { "云", "月", "思", "雁", "玉", "真" }, new string[1] { "鹄" }, new string[2] { "春", "梦" }, new string[3] { "璧", "心", "尘" });
		array[718] = new HanNameItem(718, "贯", new string[7] { "杰", "中", "月", "云", "虹", "志", "辰" }, new string[0], new string[0], new string[2] { "之", "日" }, new string[0], new string[0]);
		array[800] = new HanNameItem(800, "还", new string[5] { "安", "邦", "庆", "志", "舟" }, new string[2] { "凤", "艳" }, new string[10] { "真", "玉", "素", "述", "英", "宝", "忧", "愁", "笑", "雨" }, new string[1] { "恩" }, new string[0], new string[5] { "清", "君", "璧", "心", "梦" });
		array[801] = new HanNameItem(801, "海", new string[5] { "泉", "沧", "生", "见", "蛟" }, new string[3] { "棠", "琼", "妍" }, new string[2] { "英", "澜" }, new string[4] { "石", "豪", "怀", "歌" }, new string[0], new string[0]);
		array[802] = new HanNameItem(802, "寒", new string[29]
		{
			"松", "枫", "琨", "杀", "渊", "冈", "沧", "风", "景", "波",
			"剑", "舟", "淞", "甫", "岩", "丘", "林", "锋", "越", "宾",
			"止", "瀛", "随", "田", "习", "遥", "烛", "绅", "朋"
		}, new string[7] { "萍", "琳", "艳", "香", "玲", "露", "芙" }, new string[19]
		{
			"英", "泉", "琴", "莲", "梅", "羽", "霖", "春", "芳", "星",
			"雁", "澜", "雨", "霄", "葵", "钰", "莹", "雪", "曦"
		}, new string[7] { "柏", "山", "天", "处", "冬", "语", "藏" }, new string[5] { "烟", "花", "娥", "芷", "雀" }, new string[8] { "清", "君", "璧", "箫", "梦", "诗", "竹", "如" });
		array[803] = new HanNameItem(803, "行", new string[12]
		{
			"龙", "成", "简", "顺", "安", "通", "阔", "嘉", "舟", "殇",
			"过", "欢"
		}, new string[0], new string[2] { "云", "雨" }, new string[7] { "空", "本", "渐", "歌", "己", "孙", "侠" }, new string[0], new string[0]);
		array[804] = new HanNameItem(804, "浩", new string[10] { "然", "谊", "徽", "文", "博", "阳", "宏", "鸿", "开", "荣" }, new string[1] { "丽" }, new string[1] { "霞" }, new string[7] { "天", "学", "初", "伯", "明", "空", "辰" }, new string[0], new string[1] { "清" });
		array[805] = new HanNameItem(805, "鹤", new string[9] { "回", "泉", "华", "文", "羽", "鸣", "飞", "还", "七" }, new string[0], new string[0], new string[5] { "年", "龄", "楼", "仙", "来" }, new string[0], new string[0]);
		array[806] = new HanNameItem(806, "弘", new string[11]
		{
			"昌", "礼", "牧", "谊", "钦", "义", "贤", "逵", "念", "节",
			"纪"
		}, new string[0], new string[0], new string[4] { "明", "孝", "道", "辰" }, new string[0], new string[0]);
		array[807] = new HanNameItem(807, "红", new string[3] { "琨", "云", "枫" }, new string[20]
		{
			"玉", "樱", "霞", "菊", "媛", "琴", "莲", "萍", "嫣", "蕾",
			"琳", "翠", "茵", "蝶", "雯", "婵", "珍", "红", "裳", "艳"
		}, new string[8] { "英", "婴", "琮", "石", "华", "瑜", "梅", "棠" }, new string[1] { "柏" }, new string[14]
		{
			"袖", "衣", "钗", "珠", "萝", "罗", "凝", "花", "阁", "娥",
			"萼", "娘", "尘", "眉"
		}, new string[4] { "血", "叶", "梧", "箫" });
		array[808] = new HanNameItem(808, "洪", new string[26]
		{
			"铎", "乐", "盛", "铮", "文", "渊", "涛", "乾", "沧", "超",
			"兴", "福", "冲", "刚", "广", "亮", "丰", "澜", "波", "浩",
			"九", "淞", "毅", "玮", "沣", "磊"
		}, new string[0], new string[0], new string[7] { "龄", "川", "伯", "明", "根", "里", "施" }, new string[0], new string[0]);
		array[809] = new HanNameItem(809, "宏", new string[19]
		{
			"星", "丰", "牧", "盛", "昌", "宇", "博", "韬", "辉", "化",
			"楷", "逵", "骏", "普", "健", "晏", "图", "基", "斐"
		}, new string[0], new string[0], new string[6] { "斗", "明", "极", "运", "犀", "知" }, new string[0], new string[0]);
		array[810] = new HanNameItem(810, "鸿", new string[26]
		{
			"训", "翊", "通", "胜", "翰", "彦", "驹", "志", "羽", "愁",
			"祐", "晋", "望", "哲", "鸣", "临", "飞", "骥", "轩", "远",
			"雁", "剑", "乔", "普", "游", "儒"
		}, new string[0], new string[0], new string[9] { "渐", "升", "心", "客", "来", "鹤", "升", "鉴", "日" }, new string[0], new string[0]);
		array[811] = new HanNameItem(811, "花", new string[0], new string[5] { "媛", "芸", "蕾", "红", "艳" }, new string[1] { "青" }, new string[1] { "郎" }, new string[6] { "娘", "罗", "颜", "容", "儿", "娥" }, new string[1] { "梧" });
		array[812] = new HanNameItem(812, "华", new string[6] { "彦", "驹", "琨", "徽", "赋", "剑" }, new string[20]
		{
			"怡", "琼", "玉", "瑗", "媛", "妍", "琴", "莲", "萍", "璃",
			"嫣", "蕾", "琳", "茵", "蝶", "雯", "珍", "菁", "裳", "韶"
		}, new string[11]
		{
			"真", "菁", "谊", "白", "英", "泉", "霞", "瑜", "梅", "文",
			"羽"
		}, new string[3] { "树", "候", "枝" }, new string[10] { "碧", "萝", "罗", "钗", "颜", "凝", "萼", "珠", "屏", "芷" }, new string[7] { "衣", "年", "清", "光", "君", "璧", "阁" });
		array[813] = new HanNameItem(813, "化", new string[14]
		{
			"龙", "淳", "生", "残", "吉", "禹", "火", "慈", "锋", "楠",
			"坎", "腾", "程", "强"
		}, new string[2] { "雯", "婵" }, new string[5] { "雨", "霞", "虹", "璟", "美" }, new string[2] { "语", "声" }, new string[0], new string[2] { "碧", "仙" });
		array[814] = new HanNameItem(814, "怀", new string[89]
		{
			"仁", "谏", "远", "阔", "安", "铮", "宇", "琨", "钦", "艺",
			"风", "恭", "生", "先", "勋", "恪", "质", "续", "彪", "善",
			"韬", "昭", "惇", "东", "阳", "敦", "信", "豫", "旭", "景",
			"殊", "悌", "训", "阔", "火", "良", "谷", "新", "俅", "咏",
			"情", "宵", "伤", "商", "莫", "慕", "衍", "普", "靖", "慈",
			"益", "烈", "林", "越", "能", "恕", "瑞", "图", "思", "均",
			"喜", "奕", "毅", "钧", "舒", "瑾", "斐", "殇", "惜", "过",
			"绶", "夏", "纤", "宽", "孺", "烛", "胄", "绪", "醇", "赏",
			"经", "曦", "昶", "勇", "烨", "尚", "征", "梁", "晨"
		}, new string[18]
		{
			"凤", "琼", "玉", "瑗", "萍", "娇", "琳", "翠", "雯", "绣",
			"萱", "菲", "珍", "贞", "慧", "缨", "柔", "珈"
		}, new string[34]
		{
			"嘉", "七", "英", "霞", "瑜", "文", "忧", "愁", "笑", "青",
			"素", "春", "纯", "锦", "昕", "悼", "璟", "真", "秀", "芳",
			"星", "贤", "馨", "淳", "敬", "幽", "香", "瑛", "琅", "美",
			"吟", "融", "钰", "雪"
		}, new string[27]
		{
			"道", "斗", "天", "秋", "孝", "冬", "恩", "语", "中", "继",
			"声", "运", "诗", "夷", "轨", "溪", "书", "咎", "施", "河",
			"歌", "一", "堂", "古", "荫", "友", "民"
		}, new string[2] { "雀", "蕴" }, new string[9] { "珠", "璧", "清", "仙", "箫", "梦", "丹", "里", "竹" });
		array[815] = new HanNameItem(815, "黄", new string[2] { "龙", "虎" }, new string[3] { "燕", "雯", "裳" }, new string[6] { "裳", "霞", "琴", "华", "梅", "琮" }, new string[3] { "梧", "明", "鹤" }, new string[1] { "罗" }, new string[0]);
		array[816] = new HanNameItem(816, "辉", new string[9] { "彦", "俊", "文", "同", "元", "弘", "宏", "鸿", "铄" }, new string[0], new string[0], new string[6] { "祖", "斗", "之", "清", "明", "金" }, new string[0], new string[0]);
		array[817] = new HanNameItem(817, "慧", new string[14]
		{
			"传", "铨", "闻", "残", "源", "畴", "存", "质", "韬", "玄",
			"迪", "伏", "剑", "经"
		}, new string[49]
		{
			"艳", "怡", "琼", "玉", "霞", "瑗", "媛", "妍", "琴", "莲",
			"冰", "萍", "雅", "娇", "蕾", "琳", "茵", "蝶", "雯", "婵",
			"怜", "萱", "芳", "珍", "丽", "菁", "贞", "嘉", "慧", "晶",
			"敬", "娟", "静", "宣", "瑛", "灵", "玲", "欣", "吟", "芬",
			"越", "让", "抒", "琪", "纤", "雪", "琰", "姣", "荷"
		}, new string[20]
		{
			"英", "泉", "邪", "华", "瑜", "梅", "文", "奇", "羽", "霖",
			"昕", "临", "璟", "昭", "真", "贤", "植", "慕", "衍", "绮"
		}, new string[8] { "处", "空", "学", "中", "鉴", "根", "书", "施" }, new string[13]
		{
			"语", "钗", "仙", "君", "约", "儿", "娥", "娘", "仪", "初",
			"里", "竹", "如"
		}, new string[6] { "光", "血", "心", "明", "桐", "集" });
		array[818] = new HanNameItem(818, "好", new string[39]
		{
			"问", "游", "闻", "晋", "望", "仁", "义", "哲", "龙", "文",
			"武", "然", "艳", "谷", "言", "舟", "岳", "俅", "嵩", "商",
			"烈", "楠", "让", "宾", "辩", "均", "彬", "腾", "逸", "瑾",
			"习", "孺", "勤", "醇", "赏", "勇", "函", "朋", "才"
		}, new string[0], new string[3] { "忧", "愁", "雨" }, new string[10] { "逑", "辰", "语", "功", "声", "鸾", "诗", "歌", "古", "侠" }, new string[0], new string[0]);
		array[819] = new HanNameItem(819, "含", new string[12]
		{
			"涛", "辉", "恭", "晖", "谦", "元", "潜", "成", "光", "锋",
			"斐", "愁"
		}, new string[16]
		{
			"姿", "娟", "芬", "香", "珍", "幽", "纯", "巧", "倩", "素",
			"秀", "静", "情", "晴", "歌", "佳"
		}, new string[6] { "曦", "英", "菁", "星", "清", "宁" }, new string[3] { "虚", "藏", "圣" }, new string[7] { "仙", "悠", "韵", "梦", "笑", "悦", "月" }, new string[4] { "真", "如", "意", "乐" });
		array[820] = new HanNameItem(820, "晗", new string[25]
		{
			"涛", "辉", "舟", "嵩", "枫", "峰", "渊", "沧", "徽", "乾",
			"元", "朗", "磊", "宇", "骏", "瑞", "毅", "耀", "茂", "烨",
			"焕", "骥", "风", "松", "新"
		}, new string[18]
		{
			"菁", "芝", "姿", "樱", "娟", "莺", "芳", "薇", "萱", "馨",
			"莲", "雪", "蕙", "英", "曦", "雨", "霜", "星"
		}, new string[8] { "青", "熙", "昭", "康", "光", "宁", "礼", "露" }, new string[4] { "潮", "山", "晓", "熠" }, new string[4] { "溪", "竹", "梦", "月" }, new string[0]);
		array[821] = new HanNameItem(821, "汉", new string[20]
		{
			"涛", "昌", "商", "绅", "忠", "韬", "仁", "哲", "成", "俭",
			"彦", "胜", "俊", "盛", "骥", "康", "雄", "广", "新", "杰"
		}, new string[22]
		{
			"樱", "娟", "芳", "茵", "珍", "嫣", "馨", "淑", "珊", "莲",
			"媛", "妍", "萍", "璃", "芙", "瑶", "璇", "琼", "苇", "巧",
			"琬", "清"
		}, new string[12]
		{
			"舒", "英", "安", "生", "襄", "宁", "霖", "文", "慈", "贤",
			"德", "泽"
		}, new string[4] { "潮", "波", "臣", "胤" }, new string[1] { "悠" }, new string[1] { "月" });
		array[822] = new HanNameItem(822, "厚", new string[21]
		{
			"勋", "商", "绅", "邦", "先", "恭", "宗", "坤", "宾", "斌",
			"诚", "仁", "廉", "才", "杰", "哲", "群", "福", "俭", "武",
			"庆"
		}, new string[8] { "贞", "芬", "茵", "馨", "淑", "洁", "颖", "谨" }, new string[5] { "英", "生", "贤", "德", "良" }, new string[1] { "公" }, new string[0], new string[0]);
		array[823] = new HanNameItem(823, "湖", new string[14]
		{
			"蛟", "涛", "舟", "枫", "峰", "锡", "沣", "鸥", "鹰", "晖",
			"广", "彦", "洲", "松"
		}, new string[12]
		{
			"樱", "薇", "湘", "茵", "翠", "梅", "杏", "秀", "烟", "澜",
			"瑛", "英"
		}, new string[3] { "曦", "清", "宁" }, new string[1] { "潮" }, new string[1] { "月" }, new string[0]);
		array[824] = new HanNameItem(824, "惠", new string[16]
		{
			"邦", "坚", "先", "谦", "昌", "忠", "诚", "仁", "传", "杰",
			"哲", "成", "贤", "康", "良", "安"
		}, new string[17]
		{
			"贞", "娟", "芬", "芳", "珍", "淑", "纯", "荃", "琼", "怡",
			"巧", "颖", "谨", "嘉", "佳", "欣", "清"
		}, new string[4] { "瑛", "宁", "文", "淳" }, new string[2] { "公", "国" }, new string[1] { "仙" }, new string[1] { "真" });
		array[1000] = new HanNameItem(1000, "际", new string[7] { "云", "邪", "霞", "渊", "齐", "衡", "玄" }, new string[0], new string[0], new string[5] { "中", "本", "光", "明", "空" }, new string[0], new string[0]);
		array[1001] = new HanNameItem(1001, "继", new string[10] { "鹏", "翻", "彦", "徽", "志", "忠", "楷", "言", "剑", "衍" }, new string[2] { "雯", "裳" }, new string[7] { "英", "玉", "莲", "贤", "嘉", "慧", "瑛" }, new string[5] { "期", "本", "祖", "偕", "根" }, new string[0], new string[0]);
		array[1002] = new HanNameItem(1002, "佳", new string[0], new string[8] { "怡", "媛", "妍", "琴", "蕾", "琳", "慧", "妙" }, new string[3] { "谊", "文", "慕" }, new string[2] { "胤", "候" }, new string[1] { "人" }, new string[2] { "梦", "儿" });
		array[1003] = new HanNameItem(1003, "家", new string[5] { "安", "福", "泰", "求", "镇" }, new string[3] { "燕", "蕾", "琳" }, new string[2] { "玉", "英" }, new string[2] { "升", "怀" }, new string[0], new string[0]);
		array[1004] = new HanNameItem(1004, "嘉", new string[5] { "俊", "楷", "绍", "谷", "誉" }, new string[1] { "欣" }, new string[4] { "言", "懿", "谊", "文" }, new string[0], new string[0], new string[0]);
		array[1005] = new HanNameItem(1005, "柬", new string[4] { "迪", "钦", "奇", "素" }, new string[0], new string[0], new string[1] { "之" }, new string[0], new string[0]);
		array[1006] = new HanNameItem(1006, "见", new string[10] { "岱", "义", "远", "火", "岳", "林", "祥", "让", "腾", "寓" }, new string[0], new string[8] { "素", "青", "霞", "华", "忧", "愁", "贤", "澜" }, new string[2] { "鸾", "里" }, new string[0], new string[2] { "君", "珠" });
		array[1007] = new HanNameItem(1007, "建", new string[6] { "泰", "安", "通", "衡", "成", "植" }, new string[0], new string[0], new string[1] { "功" }, new string[0], new string[0]);
		array[1008] = new HanNameItem(1008, "剑", new string[29]
		{
			"和", "生", "通", "诚", "熊", "魁", "残", "承", "畴", "冲",
			"刚", "存", "鸣", "鹏", "玄", "辉", "鼎", "和", "雄", "扬",
			"殊", "伏", "峰", "枫", "舟", "植", "烈", "钰", "雪"
		}, new string[22]
		{
			"蓉", "怡", "兰", "琼", "瑗", "媛", "妍", "莲", "冰", "萍",
			"雅", "娇", "蕾", "琳", "蝶", "雯", "婵", "秀", "芳", "菲",
			"棠", "芬"
		}, new string[22]
		{
			"白", "英", "泉", "霞", "琴", "华", "瑜", "忧", "愁", "归",
			"素", "昕", "临", "虹", "昭", "真", "飞", "星", "贤", "馨",
			"还", "然"
		}, new string[12]
		{
			"川", "梧", "凡", "明", "秋", "南", "豪", "寒", "鹤", "狮",
			"书", "贻"
		}, new string[3] { "钗", "娥", "娘" }, new string[7] { "清", "屏", "心", "君", "箫", "仪", "桐" });
		array[1009] = new HanNameItem(1009, "降", new string[1] { "龙" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1010] = new HanNameItem(1010, "娇", new string[0], new string[14]
		{
			"娇", "怡", "霞", "媛", "妍", "琴", "莲", "华", "倩", "蕾",
			"雯", "婵", "艳", "贞"
		}, new string[0], new string[0], new string[8] { "娘", "妹", "梧", "颜", "人", "儿", "阁", "娥" }, new string[0]);
		array[1011] = new HanNameItem(1011, "金", new string[27]
		{
			"雄", "魁", "鹏", "鉴", "全", "牛", "泉", "诚", "熊", "羽",
			"虎", "超", "福", "存", "彪", "坚", "玄", "裕", "旭", "轩",
			"丰", "岐", "铎", "铄", "誉", "豹", "寓"
		}, new string[14]
		{
			"凤", "琼", "玉", "瑗", "妍", "琴", "莲", "萍", "蕾", "蝶",
			"雯", "婵", "萱", "棠"
		}, new string[8] { "虹", "霞", "英", "华", "梅", "桂", "雁", "蝉" }, new string[14]
		{
			"狮", "圣", "斗", "川", "山", "楼", "梧", "秋", "阁", "赤",
			"诺", "豪", "标", "根"
		}, new string[9] { "钗", "罗", "娥", "萼", "娘", "珠", "屏", "鸾", "竹" }, new string[4] { "銮", "衣", "璧", "桐" });
		array[1012] = new HanNameItem(1012, "锦", new string[20]
		{
			"泉", "熊", "翰", "彦", "琨", "羽", "虎", "赋", "生", "俊",
			"存", "鹏", "辉", "亮", "轩", "弘", "鸿", "荣", "槐", "珂"
		}, new string[10] { "凤", "霞", "玉", "妍", "琴", "莲", "雯", "婵", "绣", "红" }, new string[6] { "文", "华", "瑜", "素", "虹", "棠" }, new string[8] { "柏", "梧", "客", "秋", "鹤", "升", "树", "狮" }, new string[7] { "仪", "罗", "钗", "阁", "娥", "娘", "袖" }, new string[3] { "衣", "君", "颜" });
		array[1013] = new HanNameItem(1013, "进", new string[5] { "宝", "乾", "超", "冲", "催" }, new string[0], new string[0], new string[4] { "斗", "之", "官", "升" }, new string[0], new string[0]);
		array[1014] = new HanNameItem(1014, "晋", new string[11]
		{
			"元", "安", "先", "韬", "通", "昌", "徽", "志", "忠", "敦",
			"柬"
		}, new string[0], new string[3] { "芳", "华", "文" }, new string[5] { "本", "宗", "升", "中", "功" }, new string[0], new string[0]);
		array[1015] = new HanNameItem(1015, "晶", new string[0], new string[16]
		{
			"晶", "琼", "玉", "霞", "莲", "英", "华", "萍", "嫣", "素",
			"琳", "翠", "蝶", "婵", "虹", "芬"
		}, new string[0], new string[0], new string[7] { "钗", "凝", "璧", "儿", "阁", "萼", "如" }, new string[0]);
		array[1016] = new HanNameItem(1016, "景", new string[18]
		{
			"岳", "达", "迁", "通", "新", "阳", "铄", "盛", "衡", "残",
			"元", "玄", "亮", "弘", "宏", "化", "阔", "巍"
		}, new string[0], new string[3] { "伊", "华", "融" }, new string[2] { "亭", "书" }, new string[0], new string[4] { "清", "初", "怀", "连" });
		array[1017] = new HanNameItem(1017, "敬", new string[9] { "元", "直", "铭", "史", "仁", "玄", "贤", "悌", "楷" }, new string[0], new string[0], new string[8] { "之", "宗", "则", "祖", "孝", "道", "恩", "怀" }, new string[0], new string[0]);
		array[1018] = new HanNameItem(1018, "镜", new string[0], new string[8] { "琴", "冰", "璃", "嫣", "琳", "婵", "秀", "菲" }, new string[7] { "敏", "莲", "华", "奇", "忧", "虹", "雨" }, new string[1] { "明" }, new string[3] { "钗", "儿", "娥" }, new string[8] { "花", "人", "楼", "仙", "君", "心", "箫", "阁" });
		array[1019] = new HanNameItem(1019, "九", new string[30]
		{
			"巍", "通", "胜", "当", "彦", "杀", "涛", "衡", "义", "残",
			"苍", "恪", "进", "玄", "峰", "迁", "匡", "凌", "烈", "宾",
			"敖", "蛟", "维", "珂", "无", "啸", "宿", "耀", "修", "翔"
		}, new string[3] { "翠", "珍", "灵" }, new string[10] { "真", "佳", "英", "邪", "霞", "华", "素", "纯", "昭", "九" }, new string[11]
		{
			"龄", "川", "天", "辰", "怀", "夷", "慎", "命", "河", "歌",
			"刀"
		}, new string[1] { "媚" }, new string[4] { "梧", "梦", "珠", "连" });
		array[1020] = new HanNameItem(1020, "居", new string[19]
		{
			"正", "仲", "俅", "安", "胜", "魁", "忠", "衡", "义", "沧",
			"俭", "元", "玄", "朔", "泰", "岐", "贤", "简", "嵩"
		}, new string[3] { "怡", "雯", "惠" }, new string[3] { "幽", "恬", "素" }, new string[6] { "道", "梧", "伯", "凡", "天", "南" }, new string[0], new string[0]);
		array[1021] = new HanNameItem(1021, "娟", new string[0], new string[4] { "琼", "霞", "妍", "雅" }, new string[0], new string[0], new string[1] { "儿" }, new string[0]);
		array[1022] = new HanNameItem(1022, "君", new string[45]
		{
			"安", "牧", "泉", "彦", "宝", "义", "生", "嗣", "仁", "从",
			"质", "鸣", "玄", "定", "培", "正", "亮", "辅", "禹", "坦",
			"恒", "鸿", "谏", "剑", "岳", "敬", "乔", "材", "嵩", "洛",
			"植", "莫", "烈", "越", "瑞", "思", "由", "敖", "腾", "逸",
			"遥", "孺", "玮", "昉", "函"
		}, new string[28]
		{
			"怡", "凤", "琼", "霞", "玉", "瑗", "媛", "妍", "琴", "莲",
			"梅", "萍", "雅", "倩", "娇", "翠", "彩", "雯", "婵", "怜",
			"曼", "馨", "艳", "慧", "见", "幽", "珊", "琰"
		}, new string[28]
		{
			"谊", "白", "英", "华", "瑜", "文", "忧", "愁", "归", "笑",
			"素", "纯", "虹", "悼", "璟", "昭", "秀", "芳", "飞", "贤",
			"悦", "还", "淳", "嘉", "幽", "香", "慕", "念"
		}, new string[13]
		{
			"柏", "伯", "明", "赤", "孝", "诺", "恩", "豪", "佐", "寒",
			"辰", "集", "厚"
		}, new string[6] { "钗", "儿", "娥", "萼", "凰", "如" }, new string[4] { "梦", "梧", "来", "仪" });
		array[1023] = new HanNameItem(1023, "俊", new string[24]
		{
			"乔", "杰", "伟", "雄", "誉", "斯", "康", "彦", "宝", "琨",
			"文", "风", "超", "仁", "义", "鹏", "锦", "虹", "昭", "贤",
			"材", "凌", "晏", "丞"
		}, new string[4] { "慧", "丽", "娇", "雯" }, new string[5] { "爽", "雅", "英", "青", "秀" }, new string[8] { "明", "之", "山", "官", "梧", "颜", "容", "豪" }, new string[0], new string[0]);
		array[1024] = new HanNameItem(1024, "静", new string[8] { "彦", "铨", "徽", "恪", "俭", "质", "和", "偃" }, new string[32]
		{
			"怡", "菊", "琼", "霞", "瑗", "媛", "妍", "莲", "梅", "萍",
			"蓉", "雅", "嫣", "倩", "娇", "蕾", "琳", "纯", "茵", "蝶",
			"雯", "婵", "秀", "萱", "芳", "菲", "珍", "雨", "贞", "慧",
			"幽", "纤"
		}, new string[13]
		{
			"淞", "泉", "文", "恬", "忧", "愁", "素", "昕", "虹", "贤",
			"悦", "述", "思"
		}, new string[3] { "之", "处", "空" }, new string[11]
		{
			"萝", "钗", "颜", "约", "儿", "娥", "萼", "仪", "寒", "初",
			"溪"
		}, new string[7] { "梧", "光", "箫", "楚", "水", "师", "桐" });
		array[1025] = new HanNameItem(1025, "坚", new string[8] { "白", "平", "雄", "文", "勇", "志", "胜", "恪" }, new string[2] { "慧", "英" }, new string[0], new string[3] { "石", "国", "甫" }, new string[0], new string[2] { "真", "意" });
		array[1026] = new HanNameItem(1026, "鉴", new string[35]
		{
			"涛", "勋", "辉", "亨", "邦", "晖", "彰", "昌", "忠", "魁",
			"衡", "常", "崇", "诚", "仁", "材", "才", "铨", "杰", "哲",
			"成", "勇", "伟", "宇", "武", "炳", "刚", "铮", "彬", "麟",
			"良", "荣", "源", "雄", "直"
		}, new string[41]
		{
			"贞", "芝", "樱", "娟", "莺", "芳", "萱", "珍", "娇", "馨",
			"幽", "媛", "妍", "琴", "琳", "婵", "萍", "璃", "瑶", "璇",
			"纯", "琪", "琼", "婕", "菊", "梅", "雪", "琬", "彩", "巧",
			"颖", "霞", "莹", "虹", "柔", "岚", "嘉", "佳", "欣", "澜",
			"茗"
		}, new string[33]
		{
			"聪", "英", "瑛", "熙", "安", "昭", "清", "松", "心", "歌",
			"愁", "邪", "琦", "瑜", "琮", "云", "文", "泉", "慈", "贤",
			"淳", "情", "由", "德", "泽", "敏", "琰", "绮", "染", "雅",
			"锦", "玉", "善"
		}, new string[9] { "道", "恩", "虚", "公", "敌", "本", "友", "圣", "世" }, new string[3] { "珂", "珑", "凰" }, new string[4] { "真", "空", "宝", "机" });
		array[1027] = new HanNameItem(1027, "谨", new string[16]
		{
			"宽", "恭", "均", "谦", "昌", "忠", "韬", "衡", "诚", "仁",
			"恒", "成", "博", "良", "澄", "德"
		}, new string[10] { "恬", "和", "宁", "柔", "慈", "贤", "淳", "雅", "礼", "善" }, new string[3] { "聪", "文", "晏" }, new string[0], new string[0], new string[2] { "之", "如" });
		array[1028] = new HanNameItem(1028, "经", new string[40]
		{
			"涛", "辉", "邦", "渊", "先", "宗", "章", "威", "微", "谦",
			"昌", "韬", "崇", "玄", "仁", "弘", "宏", "廉", "才", "儒",
			"哲", "同", "武", "志", "奋", "彦", "胜", "恪", "绍", "毅",
			"盛", "泰", "祐", "业", "赋", "浩", "义", "慎", "博", "天"
		}, new string[9] { "芳", "幽", "雯", "梅", "雪", "和", "宁", "敏", "雅" }, new string[0], new string[4] { "民", "纶", "世", "圣" }, new string[0], new string[0]);
		array[1029] = new HanNameItem(1029, "竞", new string[41]
		{
			"亨", "先", "均", "彪", "晖", "威", "刚", "超", "辉", "成",
			"雄", "翔", "超", "元", "乾", "鹏", "崇", "宏", "隆", "杰",
			"哲", "恒", "远", "勇", "永", "武", "彦", "胜", "恪", "绍",
			"毅", "耀", "茂", "焕", "牧", "盛", "泰", "智", "力", "义",
			"新"
		}, new string[26]
		{
			"贞", "姿", "娟", "芬", "菲", "姣", "嫣", "娇", "媛", "妍",
			"婷", "琼", "婕", "曼", "慧", "秀", "丽", "妙", "曦", "欣",
			"聪", "英", "华", "霞", "淳", "绮"
		}, new string[2] { "烨", "言" }, new string[1] { "豪" }, new string[0], new string[0]);
		array[1030] = new HanNameItem(1030, "均", new string[35]
		{
			"亨", "先", "彪", "晖", "威", "徽", "辉", "元", "乾", "鹏",
			"崇", "宏", "杰", "哲", "恒", "远", "勇", "永", "武", "彦",
			"胜", "恪", "毅", "耀", "茂", "烨", "焕", "盛", "泰", "智",
			"义", "慎", "锐", "烈", "尧"
		}, new string[16]
		{
			"贞", "芬", "嫣", "妍", "婷", "琼", "慧", "秀", "丽", "妙",
			"华", "淳", "纯", "绮", "慧", "灵"
		}, new string[0], new string[1] { "圣" }, new string[0], new string[0]);
		array[1100] = new HanNameItem(1100, "开", new string[11]
		{
			"泰", "文", "隆", "嵩", "盛", "邦", "先", "玄", "阳", "宏",
			"化"
		}, new string[0], new string[0], new string[2] { "山", "天" }, new string[0], new string[0]);
		array[1101] = new HanNameItem(1101, "可", new string[21]
		{
			"求", "寿", "钦", "铨", "闻", "赋", "承", "祐", "俊", "进",
			"存", "保", "豫", "启", "鸿", "谏", "匡", "念", "显", "洵",
			"征"
		}, new string[14]
		{
			"秀", "情", "嫣", "倩", "娇", "纯", "佳", "翠", "怜", "珍",
			"馨", "然", "贞", "慧"
		}, new string[4] { "嘉", "庆", "贤", "喜" }, new string[2] { "怀", "际" }, new string[2] { "人", "儿" }, new string[0]);
		array[1102] = new HanNameItem(1102, "克", new string[10] { "通", "敬", "胜", "当", "邪", "杀", "摧", "忧", "愁", "残" }, new string[0], new string[1] { "雨" }, new string[6] { "难", "西", "之", "败", "非", "己" }, new string[0], new string[0]);
		array[1103] = new HanNameItem(1103, "匡", new string[13]
		{
			"肃", "仁", "礼", "翰", "徽", "齐", "衡", "义", "德", "典",
			"正", "史", "甫"
		}, new string[0], new string[0], new string[1] { "世" }, new string[0], new string[0]);
		array[1104] = new HanNameItem(1104, "葵", new string[2] { "生", "景" }, new string[2] { "妍", "彩" }, new string[4] { "英", "青", "华", "星" }, new string[0], new string[0], new string[0]);
		array[1105] = new HanNameItem(1105, "恺", new string[11]
		{
			"丰", "惟", "歌", "声", "康", "归", "胜", "图", "泽", "征",
			"礼"
		}, new string[1] { "悦" }, new string[3] { "乐", "然", "风" }, new string[3] { "之", "运", "旋" }, new string[0], new string[0]);
		array[1106] = new HanNameItem(1106, "刻", new string[8] { "礼", "业", "俭", "勤", "用", "守", "廉", "诚" }, new string[0], new string[0], new string[1] { "学" }, new string[0], new string[0]);
		array[1107] = new HanNameItem(1107, "蔻", new string[0], new string[30]
		{
			"华", "妍", "娇", "芸", "芳", "玉", "月", "香", "丽", "英",
			"芝", "芷", "茵", "瑛", "莹", "秀", "琼", "萱", "瑶", "柔",
			"薇", "琴", "咏", "娟", "菁", "绮", "嫣", "霞", "文", "蝶"
		}, new string[0], new string[0], new string[4] { "丹", "朱", "儿", "语" }, new string[0]);
		array[1108] = new HanNameItem(1108, "宽", new string[11]
		{
			"衡", "仁", "信", "直", "慎", "邦", "诚", "敬", "敏", "正",
			"宏"
		}, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1109] = new HanNameItem(1109, "狂", new string[3] { "虎", "龙", "云" }, new string[0], new string[1] { "歌" }, new string[2] { "人", "客" }, new string[0], new string[0]);
		array[1110] = new HanNameItem(1110, "魁", new string[20]
		{
			"佑", "荣", "诚", "忠", "仁", "贤", "昌", "隆", "亨", "勇",
			"德", "儒", "安", "武", "胜", "元", "连", "智", "文", "泰"
		}, new string[0], new string[0], new string[1] { "星" }, new string[0], new string[0]);
		array[1111] = new HanNameItem(1111, "阔", new string[4] { "海", "如", "明", "江" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1112] = new HanNameItem(1112, "珂", new string[4] { "宗", "景", "钰", "轩" }, new string[17]
		{
			"莹", "雪", "玥", "润", "滢", "珠", "瑗", "珍", "英", "贞",
			"月", "嘉", "玉", "瑾", "琳", "真", "秀"
		}, new string[1] { "明" }, new string[0], new string[1] { "儿" }, new string[1] { "君" });
		array[1200] = new HanNameItem(1200, "来", new string[1] { "锡" }, new string[1] { "香" }, new string[1] { "乐" }, new string[0], new string[0], new string[0]);
		array[1201] = new HanNameItem(1201, "立", new string[15]
		{
			"德", "魁", "衡", "仁", "春", "存", "垣", "鼎", "信", "楷",
			"剑", "新", "直", "峋", "磐"
		}, new string[0], new string[0], new string[6] { "人", "身", "本", "极", "升", "世" }, new string[0], new string[0]);
		array[1202] = new HanNameItem(1202, "丽", new string[0], new string[25]
		{
			"琼", "霞", "瑗", "媛", "妍", "琴", "芸", "蓉", "雅", "雯",
			"婵", "秀", "芳", "珍", "文", "英", "华", "羽", "贤", "菁",
			"裳", "慧", "瑾", "姬", "滢"
		}, new string[0], new string[0], new string[5] { "钗", "君", "颜", "容", "娥" }, new string[0]);
		array[1203] = new HanNameItem(1203, "连", new string[8] { "虎", "荣", "横", "胜", "福", "晋", "阔", "胄" }, new string[0], new string[0], new string[3] { "潮", "举", "辰" }, new string[0], new string[0]);
		array[1204] = new HanNameItem(1204, "怜", new string[0], new string[2] { "慧", "霄" }, new string[4] { "霞", "忧", "愁", "星" }, new string[0], new string[2] { "君", "媚" }, new string[1] { "花" });
		array[1205] = new HanNameItem(1205, "莲", new string[0], new string[5] { "怡", "萍", "珍", "贞", "慧" }, new string[8] { "生", "英", "泉", "青", "华", "忧", "愁", "芳" }, new string[1] { "舟" }, new string[3] { "钗", "儿", "娥" }, new string[4] { "花", "衣", "清", "君" });
		array[1206] = new HanNameItem(1206, "良", new string[52]
		{
			"辅", "甫", "牧", "熊", "彦", "驹", "琨", "艺", "栋", "畴",
			"锐", "骥", "楷", "伟", "履", "植", "笙", "丘", "峋", "槐",
			"让", "能", "宾", "辩", "基", "止", "显", "彬", "绩", "适",
			"逸", "珂", "绶", "习", "钰", "寓", "捷", "勤", "绪", "宜",
			"洵", "醇", "延", "玮", "伦", "圭", "珪", "骅", "儒", "朋",
			"筠", "会"
		}, new string[3] { "瑗", "媛", "芬" }, new string[12]
		{
			"玉", "英", "庆", "玉", "华", "瑜", "纯", "贤", "嘉", "懿",
			"荃", "馥"
		}, new string[10] { "嗣", "金", "佐", "梧", "裔", "辰", "根", "夫", "相", "育" }, new string[0], new string[1] { "梦" });
		array[1207] = new HanNameItem(1207, "灵", new string[7] { "风", "琨", "俊", "祐", "质", "骥", "甫" }, new string[20]
		{
			"珊", "凤", "玉", "瑗", "媛", "霞", "妍", "嫣", "素", "蕾",
			"茵", "蝶", "雯", "婵", "秀", "绣", "燕", "萱", "香", "月"
		}, new string[14]
		{
			"云", "素", "桂", "芝", "泉", "宝", "华", "羽", "昕", "虹",
			"璟", "真", "芳", "殊"
		}, new string[3] { "运", "象", "月" }, new string[9] { "萝", "钗", "烟", "花", "儿", "娥", "萼", "珠", "雀" }, new string[7] { "梧", "君", "璧", "心", "箫", "梦", "溪" });
		array[1208] = new HanNameItem(1208, "玲", new string[1] { "琨" }, new string[4] { "瑗", "艳", "敏", "月" }, new string[2] { "琅", "华" }, new string[0], new string[3] { "珑", "钗", "儿" }, new string[2] { "心", "箫" });
		array[1209] = new HanNameItem(1209, "凌", new string[4] { "云", "宵", "风", "甫" }, new string[3] { "波", "敏", "月" }, new string[0], new string[0], new string[0], new string[0]);
		array[1210] = new HanNameItem(1210, "龙", new string[20]
		{
			"生", "锡", "泉", "魁", "铮", "驹", "华", "涛", "虎", "兴",
			"鼎", "飞", "骥", "轩", "回", "九", "见", "图", "蛟", "襄"
		}, new string[0], new string[2] { "英", "霞" }, new string[2] { "升", "鉴" }, new string[0], new string[1] { "珠" });
		array[1211] = new HanNameItem(1211, "洛", new string[1] { "生" }, new string[0], new string[3] { "华", "雨", "缨" }, new string[3] { "山", "明", "河" }, new string[0], new string[0]);
		array[1212] = new HanNameItem(1212, "履", new string[0], new string[0], new string[3] { "冰", "霜", "云" }, new string[1] { "际" }, new string[0], new string[0]);
		array[1213] = new HanNameItem(1213, "绿", new string[1] { "谅" }, new string[23]
		{
			"华", "怡", "英", "琼", "霞", "妍", "琴", "莲", "华", "梅",
			"羽", "萍", "芸", "嫣", "娇", "蕾", "茵", "蝶", "雯", "婵",
			"秀", "绣", "馨"
		}, new string[0], new string[0], new string[13]
		{
			"萼", "珠", "萝", "衣", "梧", "钗", "颜", "凝", "箫", "阁",
			"娥", "桐", "叶"
		}, new string[0]);
		array[1214] = new HanNameItem(1214, "乐", new string[23]
		{
			"康", "成", "安", "归", "闻", "兴", "生", "仁", "进", "存",
			"鸣", "泰", "庚", "恒", "弘", "谏", "艳", "谷", "新", "笙",
			"林", "辩", "芙"
		}, new string[16]
		{
			"怡", "琼", "媛", "妍", "琴", "莲", "蓉", "嫣", "娇", "雯",
			"婵", "萱", "珍", "贞", "咏", "缨"
		}, new string[17]
		{
			"欣", "谊", "菊", "泉", "奇", "忧", "愁", "霖", "纯", "催",
			"临", "昭", "贤", "然", "雨", "霄", "吟"
		}, new string[8] { "山", "天", "明", "逢", "学", "升", "语", "中" }, new string[5] { "仪", "容", "颜", "儿", "娘" }, new string[10] { "心", "凡", "约", "来", "师", "桐", "怀", "声", "集", "溪" });
		array[1215] = new HanNameItem(1215, "兰", new string[4] { "舟", "枫", "松", "质" }, new string[20]
		{
			"英", "芳", "珍", "凤", "芝", "芷", "秀", "霞", "蕙", "馨",
			"贞", "姿", "樱", "娟", "芬", "茵", "萱", "嫣", "婷", "桂"
		}, new string[1] { "清" }, new string[0], new string[4] { "菊", "竹", "卿", "香" }, new string[0]);
		array[1216] = new HanNameItem(1216, "览", new string[4] { "沧", "彦", "奇", "乾" }, new string[6] { "英", "华", "瑛", "星", "霜", "清" }, new string[5] { "贤", "文", "月", "真", "琛" }, new string[1] { "灏" }, new string[0], new string[0]);
		array[1217] = new HanNameItem(1217, "璃", new string[2] { "光", "琨" }, new string[7] { "玉", "彩", "琼", "瑗", "瑶", "冰", "玉" }, new string[2] { "文", "华" }, new string[0], new string[1] { "儿" }, new string[0]);
		array[1218] = new HanNameItem(1218, "理", new string[11]
		{
			"明", "达", "文", "纲", "博", "仁", "正", "恒", "宏", "邦",
			"微"
		}, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1219] = new HanNameItem(1219, "礼", new string[7] { "杰", "仁", "贤", "渊", "先", "弘", "崇" }, new string[5] { "琴", "素", "嘉", "慧", "淳" }, new string[1] { "文" }, new string[1] { "先" }, new string[0], new string[0]);
		array[1220] = new HanNameItem(1220, "临", new string[4] { "安", "渊", "海", "风" }, new string[5] { "馨", "星", "月", "雪", "幽" }, new string[2] { "雨", "清" }, new string[0], new string[0], new string[0]);
		array[1221] = new HanNameItem(1221, "令", new string[5] { "新", "安", "康", "辉", "晖" }, new string[6] { "贞", "淑", "英", "姿", "芬", "华" }, new string[2] { "文", "言" }, new string[1] { "朋" }, new string[0], new string[0]);
		array[1222] = new HanNameItem(1222, "璐", new string[0], new string[17]
		{
			"珈", "晶", "琳", "璃", "瑶", "璇", "琪", "琼", "琬", "秀",
			"翠", "英", "瑛", "华", "琮", "璟", "瑾"
		}, new string[0], new string[0], new string[0], new string[0]);
		array[1223] = new HanNameItem(1223, "露", new string[0], new string[4] { "瑶", "云", "霞", "琼" }, new string[0], new string[1] { "寒" }, new string[0], new string[0]);
		array[1300] = new HanNameItem(1300, "梅", new string[0], new string[4] { "妍", "琴", "嫣", "香" }, new string[7] { "兰", "生", "英", "铮", "青", "华", "芳" }, new string[1] { "山" }, new string[1] { "钗" }, new string[2] { "衣", "仙" });
		array[1301] = new HanNameItem(1301, "美", new string[0], new string[13]
		{
			"玉", "琼", "霞", "瑜", "琴", "婵", "珍", "艳", "玲", "琦",
			"林", "露", "琪"
		}, new string[0], new string[0], new string[2] { "人", "娥" }, new string[0]);
		array[1302] = new HanNameItem(1302, "媚", new string[0], new string[29]
		{
			"怡", "宝", "琼", "邪", "霞", "媛", "妍", "琴", "莲", "华",
			"瑜", "文", "羽", "萍", "蓉", "嫣", "娇", "琳", "彩", "蝶",
			"雯", "婵", "馨", "然", "红", "霄", "娟", "香", "瑛"
		}, new string[0], new string[0], new string[14]
		{
			"娘", "萝", "衣", "仙", "君", "颜", "凝", "心", "容", "烟",
			"来", "儿", "娥", "仪"
		}, new string[0]);
		array[1303] = new HanNameItem(1303, "梦", new string[85]
		{
			"逵", "龙", "元", "锡", "晋", "安", "渊", "涛", "海", "吉",
			"源", "畴", "福", "望", "存", "续", "垣", "玄", "和", "潜",
			"扬", "景", "轩", "偃", "岐", "伏", "远", "启", "洋", "阔",
			"火", "艳", "翻", "剑", "舟", "岳", "迁", "新", "居", "材",
			"求", "锡", "甫", "履", "逵", "植", "衍", "岩", "丘", "峋",
			"权", "让", "宾", "止", "显", "廉", "腾", "蛟", "起", "奎",
			"田", "斌", "珂", "无", "绶", "习", "献", "遥", "孺", "协",
			"驰", "捷", "辕", "勤", "洵", "醇", "延", "圭", "珪", "骅",
			"儒", "筠", "会", "梁", "才"
		}, new string[92]
		{
			"琦", "琼", "霞", "媛", "妍", "琴", "恬", "萍", "璃", "芸",
			"雅", "嫣", "蕾", "琳", "茵", "彩", "蝶", "雯", "婵", "绣",
			"萱", "菲", "珍", "然", "丽", "樱", "淳", "贞", "七", "嘉",
			"懿", "敏", "霄", "幽", "咏", "娟", "誉", "情", "葵", "香",
			"宣", "霁", "瑛", "灵", "珊", "玲", "欣", "琦", "吟", "湘",
			"缨", "韶", "岚", "熙", "柔", "蝉", "思", "喜", "由", "泽",
			"颖", "适", "颐", "涣", "馥", "抒", "惠", "琪", "惜", "夏",
			"纤", "芹", "莹", "雪", "璇", "曦", "瑶", "珈", "帆", "琰",
			"莺", "珅", "卓", "柳", "澄", "姣", "蕊", "婕", "滢", "巧",
			"洁", "琛"
		}, new string[63]
		{
			"言", "乐", "英", "泉", "邪", "莲", "华", "瑜", "奇", "羽",
			"忧", "愁", "归", "染", "悔", "残", "皎", "霖", "纯", "锦",
			"临", "虹", "悼", "怜", "璟", "昭", "真", "飞", "星", "贤",
			"澜", "悦", "还", "述", "棠", "雨", "可", "琅", "宵", "念",
			"笙", "慈", "槐", "祥", "遇", "隐", "奕", "彬", "随", "逸",
			"枢", "瑾", "斐", "芙", "钰", "寓", "烛", "宿", "绪", "攸",
			"绮", "翔", "晨"
		}, new string[22]
		{
			"候", "伯", "潮", "处", "秋", "诺", "非", "树", "语", "际",
			"狮", "犀", "日", "虚", "世", "施", "河", "晓", "堂", "甲",
			"育", "影"
		}, new string[38]
		{
			"萝", "钗", "仙", "君", "颜", "凝", "心", "烟", "娥", "蔼",
			"娘", "初", "珠", "叶", "辰", "继", "鸾", "镜", "诗", "竹",
			"芷", "晴", "魂", "夷", "月", "尘", "如", "霭", "双", "骄",
			"池", "依", "贻", "环", "圆", "悠", "织", "尹"
		}, new string[19]
		{
			"清", "白", "衣", "梧", "光", "行", "约", "来", "阁", "师",
			"桐", "寒", "怀", "鉴", "轨", "溪", "知", "书", "仇"
		});
		array[1304] = new HanNameItem(1304, "弥", new string[12]
		{
			"远", "伤", "沛", "宛", "昌", "华", "渊", "摧", "忧", "愁",
			"皎", "超"
		}, new string[1] { "霁" }, new string[0], new string[0], new string[0], new string[0]);
		array[1305] = new HanNameItem(1305, "妙", new string[17]
		{
			"植", "安", "传", "闻", "吉", "仁", "存", "质", "玄", "弘",
			"宏", "阔", "剑", "材", "显", "田", "瑾"
		}, new string[40]
		{
			"怡", "凤", "菊", "琼", "玉", "霞", "媛", "妍", "琴", "莲",
			"萍", "芸", "蓉", "雅", "嫣", "倩", "蕾", "琳", "茵", "彩",
			"蝶", "雯", "婵", "秀", "绣", "芳", "曼", "菲", "珍", "馨",
			"红", "菁", "贞", "艳", "嘉", "慧", "静", "吟", "璇", "珈"
		}, new string[25]
		{
			"生", "剑", "测", "谊", "白", "英", "泉", "华", "瑜", "文",
			"奇", "羽", "艺", "风", "霖", "虹", "真", "殊", "贤", "澜",
			"然", "化", "雨", "新", "可"
		}, new string[3] { "候", "为", "发" }, new string[19]
		{
			"萝", "钗", "仙", "君", "颜", "凝", "心", "容", "花", "阁",
			"娥", "萼", "仪", "珠", "鉴", "媚", "芷", "尘", "意"
		}, new string[8] { "诗", "衣", "年", "楼", "梧", "光", "璧", "凡" });
		array[1306] = new HanNameItem(1306, "敏", new string[4] { "铨", "闻", "冲", "亮" }, new string[15]
		{
			"媛", "妍", "莲", "敏", "雯", "婵", "秀", "芳", "菲", "珍",
			"馨", "丽", "樱", "贞", "幽"
		}, new string[7] { "邪", "华", "文", "奇", "真", "殊", "贤" }, new string[2] { "中", "豪" }, new string[8] { "君", "仪", "心", "儿", "娥", "萼", "娘", "金" }, new string[1] { "仙" });
		array[1307] = new HanNameItem(1307, "名", new string[11]
		{
			"生", "安", "通", "盛", "传", "徽", "扬", "鸿", "晏", "枢",
			"振"
		}, new string[0], new string[0], new string[1] { "鉴" }, new string[0], new string[0]);
		array[1308] = new HanNameItem(1308, "明", new string[19]
		{
			"生", "商", "通", "翰", "彦", "朝", "辉", "辅", "谏", "匡",
			"权", "夏", "烛", "宿", "昉", "严", "孚", "焕", "晨"
		}, new string[15]
		{
			"琼", "霞", "瑗", "妍", "嫣", "倩", "琳", "蝶", "婵", "秀",
			"芳", "珍", "艳", "荃", "琪"
		}, new string[5] { "梅", "华", "瑜", "皎", "雨" }, new string[7] { "根", "秋", "川", "光", "佐", "升", "镜" }, new string[0], new string[3] { "珠", "衣", "心" });
		array[1309] = new HanNameItem(1309, "鸣", new string[8] { "骏", "胜", "魁", "铮", "驹", "龙", "雷", "铎" }, new string[0], new string[5] { "乐", "凤", "玉", "琴", "雁" }, new string[3] { "之", "鹤", "辰" }, new string[0], new string[1] { "箫" });
		array[1310] = new HanNameItem(1310, "莫", new string[2] { "伤", "植" }, new string[0], new string[6] { "愁", "忧", "言", "杀", "悔", "谏" }, new string[3] { "及", "咎", "敌" }, new string[0], new string[1] { "怀" });
		array[1311] = new HanNameItem(1311, "牧", new string[4] { "驹", "文", "摧", "残" }, new string[0], new string[0], new string[3] { "之", "仙", "身" }, new string[0], new string[0]);
		array[1312] = new HanNameItem(1312, "慕", new string[7] { "艳", "良", "剑", "嵩", "凌", "丞", "绶" }, new string[7] { "霞", "妍", "莲", "嫣", "雯", "雨", "薇" }, new string[10] { "华", "白", "青", "琴", "梅", "文", "嘉", "楷", "荣", "韶" }, new string[5] { "凡", "怀", "功", "圣", "名" }, new string[1] { "君" }, new string[0]);
		array[1313] = new HanNameItem(1313, "曼", new string[4] { "博", "超", "兴", "生" }, new string[36]
		{
			"丽", "吟", "怡", "琼", "霞", "媛", "妍", "莲", "文", "华",
			"萍", "蓉", "雅", "嫣", "茵", "彩", "雯", "萱", "芳", "菲",
			"樱", "霄", "幽", "玲", "霜", "林", "缨", "芬", "露", "融",
			"淑", "抒", "纤", "珅", "卓", "姣"
		}, new string[6] { "衍", "英", "青", "奇", "荣", "逸" }, new string[1] { "发" }, new string[10] { "语", "萝", "君", "颜", "烟", "蔼", "珠", "芷", "骄", "池" }, new string[0]);
		array[1314] = new HanNameItem(1314, "民", new string[24]
		{
			"强", "安", "德", "孝", "舟", "敦", "恭", "彪", "忠", "韬",
			"乾", "才", "铨", "杰", "哲", "彦", "俊", "恪", "毅", "健",
			"智", "义", "贵", "顺"
		}, new string[10] { "贞", "娟", "珍", "荃", "琼", "颖", "慧", "秀", "英", "芳" }, new string[2] { "贤", "恕" }, new string[2] { "朋", "贤" }, new string[0], new string[0]);
		array[1315] = new HanNameItem(1315, "睦", new string[7] { "宽", "恭", "均", "宾", "斌", "彬", "诚" }, new string[7] { "贞", "珍", "纯", "婷", "秀", "嘉", "慈" }, new string[1] { "文" }, new string[0], new string[0], new string[0]);
		array[1316] = new HanNameItem(1316, "满", new string[10] { "川", "江", "城", "舟", "山", "天", "洲", "宇", "昶", "义" }, new string[5] { "月", "香", "秋", "芳", "茵" }, new string[0], new string[2] { "光", "仓" }, new string[3] { "衣", "秋", "春" }, new string[0]);
		array[1317] = new HanNameItem(1317, "勉", new string[31]
		{
			"学", "思", "进", "勖", "行", "慎", "和", "志", "存", "识",
			"才", "信", "策", "昭", "明", "肇", "轩", "胜", "钰", "业",
			"勤", "德", "仪", "博", "贵", "弘", "祟", "圣", "知", "珅",
			"恪"
		}, new string[0], new string[0], new string[2] { "之", "仕" }, new string[0], new string[0]);
		array[1318] = new HanNameItem(1318, "暮", new string[2] { "江", "山" }, new string[7] { "雪", "云", "芳", "英", "霞", "樱", "雨" }, new string[0], new string[0], new string[5] { "春", "夏", "秋", "冬", "霭" }, new string[0]);
		array[1400] = new HanNameItem(1400, "乃", new string[17]
		{
			"亮", "胜", "当", "昌", "盛", "彦", "义", "恭", "恪", "刚",
			"异", "玄", "敦", "信", "丰", "阔", "谅"
		}, new string[0], new string[3] { "靖", "奇", "真" }, new string[0], new string[0], new string[0]);
		array[1401] = new HanNameItem(1401, "南", new string[9] { "扬", "雁", "驹", "渊", "兴", "望", "飞", "星", "骥" }, new string[0], new string[3] { "青", "燕", "凤" }, new string[2] { "天", "山" }, new string[0], new string[0]);
		array[1402] = new HanNameItem(1402, "念", new string[5] { "笙", "邦", "勋", "伤", "殇" }, new string[8] { "慈", "霞", "琴", "萍", "雅", "娇", "婵", "湘" }, new string[9] { "华", "谊", "文", "忧", "愁", "春", "芳", "雨", "嘉" }, new string[6] { "之", "孝", "恩", "功", "集", "知" }, new string[2] { "君", "骄" }, new string[2] { "凡", "仇" });
		array[1403] = new HanNameItem(1403, "凝", new string[0], new string[13]
		{
			"霜", "香", "琼", "玉", "冰", "翠", "雯", "秀", "芳", "菲",
			"馨", "霁", "霜"
		}, new string[6] { "华", "染", "绛", "素", "虹", "星" }, new string[0], new string[2] { "烟", "梦" }, new string[3] { "碧", "光", "璧" });
		array[1404] = new HanNameItem(1404, "难", new string[3] { "求", "征", "平" }, new string[0], new string[0], new string[1] { "君" }, new string[2] { "圆", "娘" }, new string[0]);
		array[1405] = new HanNameItem(1405, "楠", new string[5] { "石", "梓", "乔", "轩", "舟" }, new string[7] { "芝", "芷", "湘", "香", "芸", "苓", "珠" }, new string[5] { "英", "梦", "安", "秀", "华" }, new string[4] { "君", "棋", "山", "木" }, new string[1] { "花" }, new string[4] { "竹", "枝", "叶", "溪" });
		array[1406] = new HanNameItem(1406, "能", new string[43]
		{
			"文", "武", "志", "奇", "当", "胜", "昌", "兴", "远", "刚",
			"达", "崇", "恪", "俭", "进", "存", "善", "敦", "信", "贤",
			"弘", "宏", "材", "才", "益", "荣", "忠", "贵", "毅", "守",
			"安", "顺", "业", "广", "升磐", "昭", "培", "勇", "腾", "耀",
			"诚", "骥", "思"
		}, new string[5] { "静", "敏", "慧", "恬", "淑" }, new string[0], new string[0], new string[0], new string[0]);
		array[1407] = new HanNameItem(1407, "霓", new string[1] { "志" }, new string[11]
		{
			"裳", "虹", "云", "彩", "霞", "漫", "文", "玉", "琼", "琴",
			"珠"
		}, new string[1] { "天" }, new string[0], new string[1] { "凰" }, new string[0]);
		array[1408] = new HanNameItem(1408, "浓", new string[0], new string[13]
		{
			"芳", "艳", "云", "华", "芬", "青", "霞", "霜", "菲", "馨",
			"翠", "彩", "绮"
		}, new string[1] { "思" }, new string[0], new string[3] { "愁", "春", "黛" }, new string[0]);
		array[1409] = new HanNameItem(1409, "暖", new string[2] { "阳", "嵩" }, new string[11]
		{
			"容", "茵", "苏", "月", "芳", "翠", "姝", "笙", "霁", "云",
			"玉"
		}, new string[2] { "心", "天" }, new string[0], new string[5] { "春", "暖", "晴", "衣", "霭" }, new string[2] { "青", "冬" });
		array[1410] = new HanNameItem(1410, "弄", new string[1] { "璋" }, new string[7] { "巧", "蝶", "花", "香", "月", "玉", "凤" }, new string[2] { "笛", "文" }, new string[0], new string[4] { "影", "春", "曲", "颦" }, new string[0]);
		array[1411] = new HanNameItem(1411, "纳", new string[29]
		{
			"才", "财", "福", "富", "寿", "川", "海", "祥", "忠", "贤",
			"庆", "宝", "言", "吉", "喜", "康", "昌", "德", "良", "崇",
			"恪", "俭", "仁", "进", "存", "瑞", "新", "材", "丞"
		}, new string[11]
		{
			"芳", "翠", "兰", "凤", "蝶", "清", "灵", "妍", "敏", "英",
			"瑛"
		}, new string[5] { "竹", "玉", "梅", "月", "芝" }, new string[2] { "运", "权" }, new string[0], new string[0]);
		array[1500] = new HanNameItem(1500, "鸥", new string[4] { "白", "飞", "阁", "鸣" }, new string[1] { "歌" }, new string[0], new string[0], new string[0], new string[0]);
		array[1600] = new HanNameItem(1600, "培", new string[10] { "益", "因", "邦", "昌", "齐", "义", "业", "栋", "元", "坚" }, new string[0], new string[0], new string[3] { "石", "之", "行" }, new string[0], new string[0]);
		array[1601] = new HanNameItem(1601, "佩", new string[1] { "孚" }, new string[10] { "玲", "湘", "怡", "琼", "莲", "琳", "娟", "灵", "芬", "瑶" }, new string[9] { "谊", "英", "华", "瑜", "贤", "凌", "琦", "慈", "伦" }, new string[0], new string[1] { "仪" }, new string[0]);
		array[1602] = new HanNameItem(1602, "鹏", new string[20]
		{
			"飞", "逍", "羽", "云", "兴", "晋", "进", "催", "达", "鸣",
			"临", "独", "骥", "轩", "至", "远", "雁", "回", "剑", "雪"
		}, new string[0], new string[0], new string[8] { "举", "衣", "龄", "楼", "行", "仙", "心", "来" }, new string[0], new string[0]);
		array[1603] = new HanNameItem(1603, "沛", new string[5] { "雄", "璋", "昀", "光", "丰" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1604] = new HanNameItem(1604, "品", new string[6] { "聪", "杰", "铮", "良", "彦", "贤" }, new string[4] { "贞", "嘉", "洁", "言" }, new string[0], new string[0], new string[0], new string[0]);
		array[1605] = new HanNameItem(1605, "颦", new string[0], new string[5] { "宁", "秀", "翠", "黛", "云" }, new string[0], new string[0], new string[4] { "颦", "儿", "容", "眉" }, new string[0]);
		array[1606] = new HanNameItem(1606, "萍", new string[1] { "生" }, new string[8] { "青", "芝", "蓉", "茵", "蔓", "芳", "玉", "娟" }, new string[2] { "剑", "文" }, new string[0], new string[5] { "儿", "萍", "影", "仙", "梦" }, new string[0]);
		array[1607] = new HanNameItem(1607, "盼", new string[7] { "荣", "昌", "学", "勇", "和", "德", "远" }, new string[14]
		{
			"琴", "芝", "英", "霞", "虹", "芳", "容", "柔", "嘉", "佳",
			"秀", "馨", "蓉", "琴"
		}, new string[4] { "君", "文", "卿", "书" }, new string[0], new string[4] { "兮", "盼", "儿", "眉" }, new string[0]);
		array[1608] = new HanNameItem(1608, "璞", new string[27]
		{
			"真", "昭", "凡", "君", "杰", "皓", "瑜", "彦", "辉", "阳",
			"清", "祎", "成", "素", "荣", "华", "睿", "圣", "澄", "理",
			"光", "璟", "和", "才", "岩", "珏", "钰"
		}, new string[10] { "珠", "贞", "月", "琳", "玥", "莹", "滢", "佳", "珍", "越" }, new string[4] { "灵", "婴", "言", "珉" }, new string[1] { "鉴" }, new string[0], new string[0]);
		array[1609] = new HanNameItem(1609, "屏", new string[4] { "翰", "轩", "峰", "剑" }, new string[3] { "月", "玉", "云" }, new string[1] { "文" }, new string[0], new string[0], new string[0]);
		array[1610] = new HanNameItem(1610, "凭", new string[36]
		{
			"文", "武", "仁", "智", "信", "义", "忠", "勇", "云", "瀚",
			"俭", "业", "邦", "昌", "辉", "成", "德", "立", "诚", "贤",
			"志", "远", "新", "民", "恪", "毅", "轼", "舟", "枢", "缨",
			"剑", "钰", "直", "勋", "贵", "焕"
		}, new string[2] { "芳", "娟" }, new string[4] { "念", "思", "慧", "英" }, new string[4] { "士", "国", "己", "君" }, new string[0], new string[0]);
		array[1611] = new HanNameItem(1611, "浦", new string[9] { "生", "水", "江", "景", "阳", "光", "石", "鹰", "怀" }, new string[7] { "珠", "月", "雨", "芳", "燕", "秀", "莺" }, new string[5] { "玉", "清", "云", "遇", "歌" }, new string[7] { "舟", "帆", "屿", "道", "树", "晓", "度" }, new string[0], new string[3] { "秋", "春", "寒" });
		array[1612] = new HanNameItem(1612, "溥", new string[32]
		{
			"杰", "俊", "贤", "天", "德", "威", "信", "适", "仁", "和",
			"敬", "恭", "晖", "阳", "宇", "生", "寿", "瑞", "泽", "明",
			"绶", "济", "曦", "耀", "原", "超", "邦", "骥", "轩", "峰",
			"勇", "逸"
		}, new string[14]
		{
			"怡", "芳", "洁", "淳", "欣", "佳", "琳", "云", "月", "芸",
			"慧", "瑶", "滢", "莹"
		}, new string[3] { "原", "英", "林" }, new string[5] { "将", "源", "山", "君", "军" }, new string[3] { "如", "梦", "仙" }, new string[0]);
		array[1613] = new HanNameItem(1613, "破", new string[9] { "军", "风", "浪", "立", "邪", "天", "剑", "夜", "岩" }, new string[6] { "月", "云", "雪", "琴", "岚", "霞" }, new string[1] { "虹" }, new string[8] { "石", "山", "虏", "杀", "道", "胡", "光", "空" }, new string[0], new string[3] { "愁", "晓", "影" });
		array[1614] = new HanNameItem(1614, "芃", new string[5] { "盛", "康", "昌", "武", "生" }, new string[5] { "嘉", "佳", "薇", "樱", "冉" }, new string[2] { "文", "南" }, new string[0], new string[3] { "芃", "苒", "秀" }, new string[0]);
		array[1700] = new HanNameItem(1700, "栖", new string[6] { "岩", "安", "冈", "沧", "源", "畴" }, new string[5] { "怡", "芸", "蕾", "茵", "雯" }, new string[6] { "云", "泉", "霞", "莲", "梅", "芳" }, new string[3] { "柏", "山", "南" }, new string[0], new string[3] { "梧", "梦", "桐" });
		array[1701] = new HanNameItem(1701, "期", new string[6] { "生", "杀", "衡", "仁", "和", "敬" }, new string[0], new string[2] { "谊", "华" }, new string[1] { "行" }, new string[0], new string[0]);
		array[1702] = new HanNameItem(1702, "齐", new string[3] { "丘", "贤", "天" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1703] = new HanNameItem(1703, "奇", new string[11]
		{
			"瑜", "魁", "峰", "彦", "涛", "志", "赋", "玄", "辉", "锐",
			"贤"
		}, new string[6] { "妍", "琳", "雯", "蕾", "丽", "樱" }, new string[5] { "凤", "英", "玉", "华", "芳" }, new string[2] { "川", "树" }, new string[0], new string[2] { "仙", "梦" });
		array[1704] = new HanNameItem(1704, "启", new string[14]
		{
			"峋", "震", "恒", "邦", "超", "元", "玄", "迪", "贤", "鸿",
			"化", "谏", "剑", "凌"
		}, new string[0], new string[0], new string[6] { "之", "心", "明", "山", "道", "升" }, new string[0], new string[0]);
		array[1705] = new HanNameItem(1705, "千", new string[49]
		{
			"烈", "钟", "通", "铮", "回", "弘", "宏", "训", "楷", "谷",
			"岳", "居", "逵", "琦", "伤", "峋", "锋", "槐", "遇", "磐",
			"晦", "省", "颖", "适", "游", "蛟", "逸", "钧", "瑾", "忌",
			"过", "绶", "钰", "遥", "孺", "寓", "驰", "宿", "辕", "绪",
			"欢", "宜", "醇", "玮", "伦", "踪", "焕", "澄", "会"
		}, new string[6] { "裳", "敏", "湘", "莹", "蕊", "滢" }, new string[6] { "灵", "雨", "韶", "思", "雪", "曦" }, new string[23]
		{
			"万", "秋", "叶", "里", "斗", "岁", "川", "山", "树", "功",
			"狮", "藏", "圣", "轨", "日", "仇", "敌", "咎", "河", "相",
			"贻", "葬", "影"
		}, new string[3] { "千", "如", "悠" }, new string[3] { "竹", "晴", "蓝" });
		array[1706] = new HanNameItem(1706, "乔", new string[3] { "林", "青", "生" }, new string[0], new string[0], new string[2] { "仙", "伯" }, new string[0], new string[0]);
		array[1707] = new HanNameItem(1707, "钦", new string[7] { "望", "徽", "生", "仁", "玄", "和", "亮" }, new string[1] { "妍" }, new string[3] { "华", "纯", "若" }, new string[5] { "之", "本", "梧", "孝", "豪" }, new string[0], new string[0]);
		array[1708] = new HanNameItem(1708, "青", new string[24]
		{
			"雄", "刚", "健", "松", "鹏", "峰", "锋", "牛", "熊", "驹",
			"龙", "云", "苍", "栋", "畴", "实", "质", "垣", "鼎", "骥",
			"轩", "枫", "枢", "辕"
		}, new string[25]
		{
			"缨", "青", "霞", "琼", "玉", "瑗", "媛", "梅", "燕", "萍",
			"璃", "蓉", "蕾", "琳", "茵", "蝶", "雯", "瑶", "婵", "黛",
			"萱", "曼", "菲", "霜", "荷"
		}, new string[16]
		{
			"文", "霜", "楠", "凤", "英", "琴", "莲", "华", "瑜", "羽",
			"染", "虹", "珉", "桂", "雁", "棠"
		}, new string[8] { "鹤", "川", "柏", "山", "天", "猿", "豪", "树" }, new string[12]
		{
			"钗", "妹", "萝", "罗", "碧", "花", "儿", "娥", "萼", "凰",
			"娘", "叶"
		}, new string[9] { "衣", "竹", "梧", "君", "璧", "箫", "桐", "书", "眉" });
		array[1709] = new HanNameItem(1709, "轻", new string[1] { "至" }, new string[6] { "霞", "妍", "雯", "绣", "霄", "恕" }, new string[8] { "虹", "邪", "羽", "忧", "愁", "催", "悼", "述" }, new string[1] { "候" }, new string[2] { "颜", "袖" }, new string[0]);
		array[1710] = new HanNameItem(1710, "清", new string[16]
		{
			"云", "玄", "彦", "渊", "涛", "义", "风", "源", "玄", "辉",
			"阳", "旭", "景", "远", "简", "澄"
		}, new string[18]
		{
			"芬", "妍", "怡", "琼", "玉", "霞", "瑗", "媛", "妍", "蓉",
			"雅", "琳", "雯", "婵", "秀", "芳", "菲", "馨"
		}, new string[20]
		{
			"扬", "露", "泉", "韶", "越", "乐", "白", "泉", "华", "皎",
			"霖", "素", "昕", "虹", "璟", "昭", "澜", "悦", "波", "雨"
		}, new string[6] { "之", "皋", "流", "发", "潮", "秋" }, new string[3] { "芷", "凝", "娥" }, new string[6] { "照", "璧", "梦", "约", "时", "寒" });
		array[1711] = new HanNameItem(1711, "晴", new string[0], new string[0], new string[2] { "岚", "华" }, new string[1] { "川" }, new string[1] { "儿" }, new string[1] { "清" });
		array[1712] = new HanNameItem(1712, "庆", new string[8] { "澜", "槐", "昌", "吉", "誉", "隆", "缨", "忌" }, new string[0], new string[3] { "谊", "宝", "文" }, new string[5] { "之", "长", "升", "怀", "照" }, new string[0], new string[0]);
		array[1713] = new HanNameItem(1713, "秋", new string[6] { "畴", "实", "玄", "枫", "笙", "越" }, new string[23]
		{
			"怡", "琼", "霞", "媛", "妍", "萍", "蓉", "雅", "蕾", "琳",
			"蝶", "雯", "婵", "萱", "雁", "波", "樱", "红", "雨", "月",
			"露", "杏", "莹"
		}, new string[14]
		{
			"霜", "菊", "泉", "琴", "莲", "华", "催", "昕", "临", "虹",
			"昭", "桂", "澜", "棠"
		}, new string[5] { "山", "明", "来", "树", "根" }, new string[6] { "萝", "钗", "君", "娥", "娘", "叶" }, new string[7] { "水", "魂", "梧", "桐", "寒", "初", "照" });
		array[1714] = new HanNameItem(1714, "权", new string[3] { "昌", "盛", "衡" }, new string[0], new string[0], new string[1] { "之" }, new string[0], new string[0]);
		array[1715] = new HanNameItem(1715, "全", new string[9] { "祥", "海", "义", "忠", "善", "安", "通", "方", "丰" }, new string[0], new string[1] { "真" }, new string[3] { "孝", "有", "根" }, new string[0], new string[0]);
		array[1716] = new HanNameItem(1716, "其", new string[27]
		{
			"昌", "忠", "坚", "宽", "韬", "胜", "勇", "伟", "磊", "广",
			"智", "翰", "信", "正", "义", "辉", "诚", "杰", "哲", "彦",
			"复", "盛", "焕", "泰", "亮", "浩", "贤"
		}, new string[17]
		{
			"贞", "娟", "芬", "芳", "珍", "姣", "娇", "盈", "洁", "巧",
			"颖", "谨", "慧", "静", "佳", "嘉", "菁"
		}, new string[3] { "英", "清", "昭" }, new string[1] { "骄" }, new string[1] { "韵" }, new string[2] { "真", "乐" });
		array[1717] = new HanNameItem(1717, "谦", new string[9] { "恭", "谦", "冲", "仁", "恒", "益", "慎", "德", "立" }, new string[6] { "淑", "颖", "敏", "慧", "善", "纯" }, new string[1] { "和" }, new string[0], new string[0], new string[1] { "意" });
		array[1718] = new HanNameItem(1718, "潜", new string[11]
		{
			"辉", "亨", "渊", "宽", "恭", "均", "晖", "庸", "龙", "翔",
			"志"
		}, new string[3] { "慧", "秀", "歌" }, new string[0], new string[2] { "跃", "波" }, new string[0], new string[0]);
		array[1719] = new HanNameItem(1719, "倩", new string[0], new string[9] { "芳", "媛", "婷", "怡", "云", "琼", "宁", "倩", "雅" }, new string[0], new string[0], new string[0], new string[0]);
		array[1720] = new HanNameItem(1720, "巧", new string[0], new string[9] { "云", "珍", "秀", "香", "艳", "慧", "真", "燕", "音" }, new string[0], new string[2] { "略", "俊" }, new string[0], new string[0]);
		array[1721] = new HanNameItem(1721, "求", new string[11]
		{
			"实", "新", "进", "文", "武", "礼", "诚", "义", "全", "胜",
			"贤"
		}, new string[1] { "慧" }, new string[2] { "礼", "恕" }, new string[2] { "是", "真" }, new string[0], new string[0]);
		array[1722] = new HanNameItem(1722, "泉", new string[4] { "涛", "通", "彦", "安" }, new string[4] { "英", "灵", "樱", "岚" }, new string[0], new string[0], new string[0], new string[0]);
		array[1800] = new HanNameItem(1800, "染", new string[0], new string[3] { "香", "霞", "翠" }, new string[4] { "青", "华", "忧", "愁" }, new string[2] { "尘", "之" }, new string[0], new string[3] { "衣", "血", "心" });
		array[1801] = new HanNameItem(1801, "让", new string[6] { "能", "魁", "钦", "承", "先", "贤" }, new string[0], new string[1] { "华" }, new string[2] { "夷", "之" }, new string[0], new string[0]);
		array[1802] = new HanNameItem(1802, "人", new string[9] { "智", "俊", "彦", "杰", "雄", "达", "龙", "胜", "魁" }, new string[0], new string[5] { "玉", "熙", "凤", "英", "华" }, new string[3] { "清", "豪", "伯" }, new string[0], new string[0]);
		array[1803] = new HanNameItem(1803, "仁", new string[63]
		{
			"通", "杰", "浦", "恕", "遇", "安", "乐", "盛", "诚", "钦",
			"德", "恪", "善", "典", "和", "悌", "佳", "楷", "绍", "见",
			"敬", "宣", "甫", "逵", "沛", "恕", "图", "谅", "涣", "谦",
			"逸", "护", "鹰", "钧", "宪", "斌", "瑾", "斐", "惜", "绶",
			"献", "钰", "宽", "寓", "胄", "勃", "曦", "耀", "用", "修",
			"坤", "焕", "尚", "穆", "布", "济", "筠", "爱", "会", "磊",
			"梁", "翔", "军"
		}, new string[0], new string[1] { "美" }, new string[17]
		{
			"师", "本", "厚", "轨", "孝", "富", "诺", "际", "胤", "鉴",
			"集", "照", "书", "晓", "己", "育", "影"
		}, new string[0], new string[0]);
		array[1804] = new HanNameItem(1804, "日", new string[8] { "杏", "章", "兴", "昕", "峰", "宏", "隆", "昶" }, new string[0], new string[0], new string[1] { "西" }, new string[0], new string[0]);
		array[1805] = new HanNameItem(1805, "荣", new string[17]
		{
			"贵", "康", "邦", "翰", "宝", "华", "俊", "春", "亮", "丰",
			"新", "微", "史", "锡", "宣", "丘", "遇"
		}, new string[0], new string[0], new string[7] { "光", "发", "升", "继", "连", "轨", "弼" }, new string[0], new string[0]);
		array[1806] = new HanNameItem(1806, "柔", new string[0], new string[5] { "青", "霞", "云", "嫣", "嘉" }, new string[1] { "晏" }, new string[0], new string[5] { "碧", "衣", "儿", "仙", "竹" }, new string[0]);
		array[1807] = new HanNameItem(1807, "如", new string[11]
		{
			"龙", "磐", "驹", "渊", "残", "赋", "常", "望", "骥", "枫",
			"翊"
		}, new string[20]
		{
			"怡", "凤", "琼", "玉", "霞", "莲", "冰", "萍", "琳", "翠",
			"茵", "绣", "萱", "菲", "珍", "馨", "樱", "艳", "敏", "霜"
		}, new string[23]
		{
			"风", "凤", "晦", "蝉", "悔", "白", "英", "华", "梅", "笑",
			"皎", "霖", "素", "锦", "昕", "虹", "璟", "昭", "芳", "星",
			"澜", "雨", "颖"
		}, new string[2] { "山", "怀" }, new string[8] { "烟", "意", "仙", "凝", "梦", "初", "声", "诗" }, new string[3] { "碧", "璧", "寒" });
		array[1808] = new HanNameItem(1808, "汝", new string[21]
		{
			"讷", "言", "愚", "苍", "吉", "恭", "祐", "晋", "恪", "仁",
			"刚", "哲", "存", "质", "敦", "炳", "正", "亮", "悌", "成",
			"直"
		}, new string[7] { "倩", "娇", "彩", "婵", "秀", "珍", "淳" }, new string[9] { "恬", "奇", "素", "纯", "真", "殊", "贤", "悦", "颐" }, new string[6] { "楫", "行", "发", "明", "孝", "豪" }, new string[0], new string[1] { "约" });
		array[1809] = new HanNameItem(1809, "入", new string[3] { "云", "沧", "玄" }, new string[0], new string[4] { "霞", "忧", "愁", "澜" }, new string[3] { "之", "秋", "尘" }, new string[0], new string[0]);
		array[1810] = new HanNameItem(1810, "瑞", new string[6] { "麟", "图", "安", "存", "元", "祥" }, new string[5] { "怡", "琼", "雅", "雯", "懿" }, new string[3] { "华", "瑜", "文" }, new string[4] { "候", "本", "际", "鉴" }, new string[1] { "钗" }, new string[1] { "清" });
		array[1811] = new HanNameItem(1811, "若", new string[26]
		{
			"望", "松", "淳", "琨", "渊", "枫", "鸿", "谷", "微", "巍",
			"俅", "开", "嵩", "念", "峋", "钟", "讷", "愚", "喜", "庸",
			"彬", "瑾", "洵", "登", "羲", "会"
		}, new string[29]
		{
			"兰", "萍", "怡", "凤", "琼", "霞", "莲", "冰", "梅", "璃",
			"雅", "嫣", "蕾", "琳", "茵", "蝶", "萱", "菲", "樱", "懿",
			"灵", "玲", "吟", "颖", "纤", "芙", "雪", "攸", "姣"
		}, new string[21]
		{
			"羽", "星", "华", "英", "泉", "宝", "邪", "华", "残", "风",
			"霖", "锦", "昕", "虹", "然", "雨", "琅", "林", "槐", "思",
			"曦"
		}, new string[9] { "飞", "弼", "虚", "光", "升", "辰", "怀", "狮", "河" }, new string[8] { "仙", "男", "凝", "声", "诗", "晴", "霭", "蓝" }, new string[3] { "寒", "霭", "溪" });
		array[1812] = new HanNameItem(1812, "苒", new string[0], new string[9] { "芳", "秀", "菲", "芝", "欣", "诗", "蕙", "萱", "烟" }, new string[4] { "青", "春", "华", "景" }, new string[0], new string[2] { "苒", "秋" }, new string[2] { "冬", "君" });
		array[1813] = new HanNameItem(1813, "认", new string[7] { "贤", "友", "学", "国", "邦", "义", "省" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1814] = new HanNameItem(1814, "榕", new string[9] { "海", "阳", "涛", "绍", "昭", "贵", "盛", "峰", "祥" }, new string[20]
		{
			"佳", "嘉", "宜", "华", "芷", "锦", "娟", "婷", "翠", "芳",
			"姝", "英", "瑛", "仪", "绮", "佩", "秀", "英", "诗", "舒"
		}, new string[0], new string[2] { "君", "柏" }, new string[0], new string[5] { "卿", "南", "溪", "桑", "桦" });
		array[1815] = new HanNameItem(1815, "镕", new string[20]
		{
			"金", "鑫", "显", "兆", "昭", "剑", "耀", "景", "阳", "宇",
			"成", "盛", "昊", "光", "昌", "承", "炜", "煜", "晨", "升"
		}, new string[0], new string[1] { "玉" }, new string[2] { "钊", "烁" }, new string[0], new string[0]);
		array[1816] = new HanNameItem(1816, "融", new string[7] { "钰", "瑾", "世", "昭", "光", "远", "显" }, new string[7] { "香", "芳", "馨", "玉", "雪", "翠", "月" }, new string[0], new string[0], new string[0], new string[0]);
		array[1817] = new HanNameItem(1817, "儒", new string[26]
		{
			"学", "行", "成", "斐", "兴", "凡", "才", "博", "诚", "远",
			"修", "达", "道", "弘", "知", "泽", "阳", "和", "志", "素",
			"彦", "德", "书", "谨", "仁", "庸"
		}, new string[0], new string[0], new string[2] { "喆", "鸿" }, new string[0], new string[0]);
		array[1818] = new HanNameItem(1818, "软", new string[0], new string[7] { "碧", "红", "翠", "荷", "云", "琼", "香" }, new string[0], new string[0], new string[3] { "烟", "罗", "萝" }, new string[0]);
		array[1819] = new HanNameItem(1819, "锐", new string[16]
		{
			"勇", "锋", "康", "凯", "知", "文", "武", "智", "志", "征",
			"民", "斌", "风", "阳", "涛", "军"
		}, new string[5] { "芳", "英", "瑛", "敏", "珠" }, new string[0], new string[1] { "师" }, new string[1] { "秋" }, new string[0]);
		array[1820] = new HanNameItem(1820, "睿", new string[34]
		{
			"哲", "知", "智", "文", "弘", "安", "康", "诚", "谦", "德",
			"明", "圣", "贤", "思", "涵", "宏", "博", "言", "图", "达",
			"礼", "雄", "良", "识", "阳", "才", "广", "敏", "武", "清",
			"崇", "真", "安", "学"
		}, new string[5] { "琼", "瑶", "媛", "芳", "琴" }, new string[3] { "玉", "云", "英" }, new string[0], new string[0], new string[0]);
		array[1821] = new HanNameItem(1821, "蕊", new string[0], new string[8] { "香", "芳", "馨", "棠", "珠", "丹", "心", "芯" }, new string[0], new string[0], new string[5] { "黄", "仙", "尘", "儿", "姬" }, new string[0]);
		array[1822] = new HanNameItem(1822, "润", new string[11]
		{
			"德", "林", "书", "墨", "泽", "川", "景", "晨", "恩", "声",
			"礼"
		}, new string[7] { "青", "颜", "珠", "芝", "芷", "芳", "雪" }, new string[6] { "玉", "清", "琴", "云", "雨", "月" }, new string[1] { "之" }, new string[0], new string[0]);
		array[1823] = new HanNameItem(1823, "蓉", new string[0], new string[37]
		{
			"姿", "香", "兰", "萱", "芳", "丽", "娇", "韵", "青", "碧",
			"华", "馨", "芝", "芷", "梅", "桂", "蕙", "雨", "云", "书",
			"佳", "佩", "嘉", "菁", "臻", "妍", "颜", "姝", "月", "雪",
			"舒", "琦", "娴", "瑾", "莲", "桦", "黛"
		}, new string[2] { "君", "剑" }, new string[0], new string[3] { "裳", "仙", "苑" }, new string[0]);
		array[1900] = new HanNameItem(1900, "三", new string[8] { "贵", "宾", "虎", "炯", "思", "通", "省", "铨" }, new string[0], new string[2] { "念", "七" }, new string[2] { "光", "空" }, new string[0], new string[0]);
		array[1901] = new HanNameItem(1901, "僧", new string[11]
		{
			"宝", "辩", "亮", "繇", "恪", "异", "定", "远", "度", "坦",
			"烛"
		}, new string[0], new string[0], new string[2] { "本", "象" }, new string[0], new string[0]);
		array[1902] = new HanNameItem(1902, "山", new string[7] { "峰", "松", "青", "雄", "弘", "宏", "楠" }, new string[0], new string[0], new string[2] { "君", "豪" }, new string[0], new string[0]);
		array[1903] = new HanNameItem(1903, "善", new string[40]
		{
			"均", "康", "胜", "泉", "诚", "铨", "文", "闻", "风", "福",
			"恪", "从", "全", "元", "韬", "真", "绍", "见", "可", "匡",
			"甫", "凌", "逵", "衍", "慈", "林", "楠", "让", "恕", "遇",
			"省", "辩", "隐", "充", "丞", "维", "参", "延", "跃", "登"
		}, new string[1] { "贞" }, new string[2] { "咏", "荣" }, new string[12]
		{
			"长", "之", "流", "为", "容", "辰", "继", "集", "魂", "轨",
			"意", "歌"
		}, new string[0], new string[0]);
		array[1904] = new HanNameItem(1904, "商", new string[5] { "隐", "翰", "衡", "畴", "恪" }, new string[1] { "怡" }, new string[3] { "英", "华", "奇" }, new string[0], new string[0], new string[1] { "仙" });
		array[1905] = new HanNameItem(1905, "少", new string[82]
		{
			"季", "愚", "秦", "翼", "扶", "安", "康", "牧", "诚", "魁",
			"铮", "翰", "彦", "驹", "琨", "俊", "文", "羽", "龙", "虎",
			"游", "博", "义", "风", "恭", "承", "冲", "崇", "恪", "刚",
			"哲", "鸣", "鹏", "锦", "典", "锐", "阳", "敦", "正", "雄",
			"骥", "轩", "峰", "贤", "枫", "然", "鸿", "翊", "谏", "嘉",
			"剑", "宣", "凌", "吟", "丘", "楠", "槐", "祥", "让", "浦",
			"聪", "谦", "逸", "维", "程", "斌", "珂", "瑾", "宽", "孺",
			"驰", "洵", "经", "炎", "伦", "坤", "强", "韵", "筠", "会",
			"梁", "军"
		}, new string[12]
		{
			"萍", "蓉", "雅", "蕾", "雯", "婵", "萱", "芳", "菲", "珍",
			"馨", "棠"
		}, new string[15]
		{
			"凤", "英", "青", "玉", "琴", "华", "瑜", "奇", "真", "雁",
			"悦", "慧", "敏", "颐", "惠"
		}, new string[10] { "川", "柏", "楼", "颜", "凡", "明", "秋", "辰", "怀", "极" }, new string[1] { "娥" }, new string[4] { "君", "容", "仪", "桐" });
		array[1906] = new HanNameItem(1906, "绍", new string[10] { "基", "轼", "喜", "庸", "节", "奕", "康", "庆", "安", "义" }, new string[0], new string[3] { "芳", "谊", "华" }, new string[0], new string[0], new string[0]);
		array[1907] = new HanNameItem(1907, "神", new string[17]
		{
			"风", "基", "冈", "羽", "兴", "祐", "冲", "刚", "异", "锐",
			"雄", "武", "扬", "至", "峰", "辅", "禹"
		}, new string[0], new string[0], new string[6] { "举", "知", "光", "处", "佐", "鹤" }, new string[0], new string[0]);
		array[1908] = new HanNameItem(1908, "慎", new string[8] { "由", "止", "安", "诚", "钦", "铨", "衡", "望" }, new string[0], new string[0], new string[3] { "本", "行", "语" }, new string[0], new string[0]);
		array[1909] = new HanNameItem(1909, "胜", new string[22]
		{
			"海", "奇", "龙", "虎", "通", "魁", "杀", "渊", "摧", "群",
			"超", "先", "达", "彪", "韬", "雄", "贤", "楷", "舟", "晦",
			"图", "谦"
		}, new string[0], new string[0], new string[4] { "非", "高", "豪", "名" }, new string[1] { "男" }, new string[2] { "仙", "蓝" });
		array[1910] = new HanNameItem(1910, "师", new string[8] { "诚", "德", "胜", "翰", "庆", "彦", "续", "楷" }, new string[8] { "霞", "媛", "妍", "琴", "雅", "嫣", "倩", "菲" }, new string[5] { "华", "文", "奇", "染", "贤" }, new string[4] { "周", "道", "行", "凡" }, new string[5] { "师", "钗", "仙", "君", "颜" }, new string[0]);
		array[1911] = new HanNameItem(1911, "诗", new string[3] { "诚", "云", "续" }, new string[24]
		{
			"兰", "怡", "凤", "音", "琼", "霞", "媛", "妍", "琴", "莲",
			"燕", "萍", "雅", "倩", "蕾", "琳", "彩", "秀", "芳", "菲",
			"馨", "樱", "慧", "娅"
		}, new string[12]
		{
			"谊", "英", "泉", "华", "文", "奇", "忧", "愁", "染", "残",
			"霖", "贤"
		}, new string[0], new string[6] { "诗", "仙", "君", "颜", "烟", "梦" }, new string[2] { "楼", "凡" });
		array[1912] = new HanNameItem(1912, "十", new string[9] { "方", "慎", "通", "当", "杀", "艺", "骥", "七", "九" }, new string[0], new string[1] { "华" }, new string[1] { "斗" }, new string[2] { "娘", "仙" }, new string[0]);
		array[1913] = new HanNameItem(1913, "时", new string[5] { "显", "泽", "寅", "庚", "敬" }, new string[0], new string[1] { "雨" }, new string[4] { "行", "中", "辰", "竹" }, new string[0], new string[0]);
		array[1914] = new HanNameItem(1914, "实", new string[2] { "颖", "彦" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1915] = new HanNameItem(1915, "士", new string[44]
		{
			"忠", "诚", "仁", "宵", "良", "湛", "彬", "聪", "达", "弘",
			"林", "逊", "毅", "英", "瀛", "庸", "谅", "奇", "安", "通",
			"彦", "俊", "惇", "宏", "鸿", "季", "柬", "敬", "直", "敏",
			"匡", "骏", "吟", "峋", "锋", "能", "遇", "奕", "充", "丞",
			"斌", "韵", "会", "梁"
		}, new string[0], new string[0], new string[4] { "及", "豪", "功", "轨" }, new string[0], new string[0]);
		array[1916] = new HanNameItem(1916, "世", new string[81]
		{
			"章", "魁", "鼎", "辅", "绩", "矩", "纶", "铭", "杰", "通",
			"充", "安", "康", "彦", "平", "义", "兴", "栋", "贤", "弘",
			"宏", "嘉", "翻", "楷", "懿", "直", "微", "幽", "咏", "乔",
			"隆", "可", "锡", "凌", "逵", "骏", "吟", "普", "念", "峋",
			"钟", "越", "槐", "权", "祥", "让", "能", "贵", "融", "晏",
			"隐", "喜", "颖", "聪", "谦", "游", "随", "惠", "维", "奎",
			"瑾", "钰", "遥", "寓", "烛", "勤", "洵", "延", "炎", "昶",
			"永", "攸", "坤", "珅", "强", "澄", "拯", "征", "筠", "爱",
			"会"
		}, new string[4] { "贞", "芬", "柔", "滢" }, new string[11]
		{
			"华", "凤", "羽", "玉", "谊", "芳", "瑛", "美", "衍", "韶",
			"茗"
		}, new string[22]
		{
			"恩", "南", "长", "官", "光", "明", "怀", "际", "功", "运",
			"名", "轻", "照", "晴", "厚", "轨", "尘", "如", "贻", "育",
			"友", "民"
		}, new string[1] { "媚" }, new string[0]);
		array[1917] = new HanNameItem(1917, "式", new string[8] { "开", "通", "俊", "钦", "华", "齐", "衡", "雄" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1918] = new HanNameItem(1918, "适", new string[3] { "华", "涛", "朝" }, new string[0], new string[0], new string[2] { "之", "行" }, new string[0], new string[0]);
		array[1919] = new HanNameItem(1919, "守", new string[47]
		{
			"诚", "义", "方", "存", "礼", "同", "仁", "悌", "信", "智",
			"忠", "安", "邦", "志", "残", "业", "俭", "正", "恒", "谏",
			"阔", "嘉", "直", "情", "锡", "凌", "植", "骏", "益", "岩",
			"烈", "越", "槐", "瑞", "基", "庸", "节", "奕", "谅", "绩",
			"廉", "钧", "珂", "钰", "宿", "勤", "用"
		}, new string[4] { "怡", "雅", "贞", "慧" }, new string[5] { "素", "谊", "英", "玉", "瑛" }, new string[9] { "孝", "忍", "道", "诺", "怀", "轨", "日", "命", "己" }, new string[0], new string[1] { "清" });
		array[1920] = new HanNameItem(1920, "寿", new string[11]
		{
			"昌", "慈", "图", "颐", "牛", "康", "魁", "乾", "龙", "福",
			"永"
		}, new string[0], new string[0], new string[7] { "斗", "石", "柏", "年", "山", "仙", "容" }, new string[0], new string[0]);
		array[1921] = new HanNameItem(1921, "书", new string[9] { "呤", "诚", "徽", "亮", "嘉", "季", "良", "剑", "佩" }, new string[2] { "慧", "玲" }, new string[4] { "谊", "琴", "华", "吟" }, new string[2] { "山", "厚" }, new string[0], new string[0]);
		array[1922] = new HanNameItem(1922, "淑", new string[15]
		{
			"康", "魁", "邦", "彦", "俊", "恪", "仁", "哲", "质", "和",
			"定", "正", "立", "洛", "骏"
		}, new string[64]
		{
			"真", "秀", "绣", "怡", "凤", "菊", "琼", "玉", "霞", "媛",
			"妍", "琴", "莲", "华", "梅", "燕", "萍", "染", "芸", "蓉",
			"雅", "嫣", "倩", "蕾", "琳", "纯", "蝶", "雯", "婵", "虹",
			"真", "秀", "绣", "萱", "芳", "曼", "菲", "珍", "雁", "馨",
			"棠", "樱", "雨", "贞", "嘉", "慧", "良", "懿", "幽", "娟",
			"静", "欣", "美", "吟", "衍", "佩", "芬", "越", "瑾", "莹",
			"澄", "娅", "姣", "爱"
		}, new string[19]
		{
			"懿", "艺", "涣", "谊", "英", "泉", "铮", "瑜", "文", "羽",
			"皎", "霖", "昭", "贤", "悦", "简", "益", "遇", "彬"
		}, new string[4] { "发", "客", "秋", "孝" }, new string[24]
		{
			"碧", "妹", "萝", "衣", "钗", "仙", "君", "颜", "凝", "璧",
			"人", "心", "凡", "容", "梦", "约", "娥", "凰", "娘", "仪",
			"屏", "轻", "芷", "意"
		}, new string[3] { "明", "来", "桐" });
		array[1923] = new HanNameItem(1923, "双", new string[6] { "七", "楷", "让", "节", "习", "烛" }, new string[10] { "馨", "霜", "琼", "霞", "瑗", "琴", "莲", "萍", "琳", "艳" }, new string[3] { "英", "华", "星" }, new string[2] { "鉴", "河" }, new string[4] { "儿", "仙", "萼", "环" }, new string[1] { "清" });
		array[1924] = new HanNameItem(1924, "霜", new string[0], new string[18]
		{
			"怡", "琼", "玉", "霞", "瑗", "琴", "莲", "梅", "萍", "璃",
			"蕾", "琳", "茵", "蝶", "婵", "雨", "霁", "月"
		}, new string[9] { "英", "华", "白", "瑜", "皎", "星", "七", "遇", "芹" }, new string[1] { "柏" }, new string[11]
		{
			"钗", "颜", "凝", "心", "容", "花", "儿", "娥", "萼", "娘",
			"连"
		}, new string[8] { "衣", "梧", "君", "璧", "来", "阁", "桐", "寒" });
		array[1925] = new HanNameItem(1925, "思", new string[35]
		{
			"归", "克", "平", "承", "理", "谦", "温", "廉", "安", "盛",
			"泉", "翰", "铨", "仁", "义", "进", "宏", "谏", "阔", "季",
			"良", "岳", "迁", "微", "居", "材", "佩", "丘", "楠", "辩",
			"庸", "赏", "烨", "勉", "策"
		}, new string[13]
		{
			"怡", "琼", "妍", "琴", "蓉", "雅", "嫣", "雨", "嘉", "慧",
			"懿", "敏", "静"
		}, new string[7] { "荃", "乐", "谊", "忧", "愁", "衍", "芙" }, new string[9] { "豪", "退", "行", "明", "孝", "辰", "中", "轨", "慎" }, new string[4] { "君", "容", "梦", "霭" }, new string[2] { "凡", "照" });
		array[1926] = new HanNameItem(1926, "嗣", new string[5] { "业", "立", "衍", "同", "承" }, new string[0], new string[0], new string[2] { "伯", "辰" }, new string[0], new string[0]);
		array[1927] = new HanNameItem(1927, "嵩", new string[9] { "坎", "胜", "魁", "冈", "海", "元", "玄", "正", "雄" }, new string[0], new string[0], new string[7] { "之", "柱", "期", "石", "楼", "伯", "举" }, new string[0], new string[0]);
		array[1928] = new HanNameItem(1928, "素", new string[23]
		{
			"魁", "彦", "传", "乾", "同", "苍", "俭", "存", "玄", "正",
			"骥", "轩", "远", "枫", "楷", "舟", "微", "立", "锋", "庸",
			"惟", "辕", "勤"
		}, new string[65]
		{
			"素", "怡", "凤", "菊", "琼", "玉", "霞", "瑗", "媛", "妍",
			"琴", "莲", "冰", "梅", "萍", "璃", "蓉", "雅", "嫣", "娇",
			"蕾", "琳", "茵", "彩", "蝶", "雯", "婵", "黛", "虹", "秀",
			"绣", "萱", "芳", "曼", "菲", "珍", "雁", "馨", "棠", "丽",
			"红", "贞", "嘉", "慧", "佳", "敏", "幽", "娟", "情", "灵",
			"玲", "欣", "吟", "衍", "念", "杏", "隐", "颖", "颐", "殷",
			"纤", "芹", "钰", "莹", "曦"
		}, new string[36]
		{
			"梅", "殷", "彩", "游", "白", "英", "泉", "铮", "邪", "华",
			"瑜", "文", "羽", "忧", "愁", "染", "云", "皎", "问", "霖",
			"纯", "锦", "珉", "璟", "昭", "真", "星", "贤", "澜", "简",
			"然", "良", "新", "瑛", "琅", "丘"
		}, new string[6] { "功", "川", "秋", "冬", "豪", "知" }, new string[20]
		{
			"罗", "钗", "仙", "君", "凝", "心", "凡", "容", "烟", "花",
			"儿", "娥", "萼", "凰", "娘", "屏", "连", "晴", "霭", "环"
		}, new string[17]
		{
			"碧", "衣", "楼", "血", "璧", "箫", "梦", "约", "来", "水",
			"阁", "仪", "桐", "寒", "初", "袖", "怀"
		});
		array[1929] = new HanNameItem(1929, "随", new string[6] { "徽", "涛", "波", "云", "良", "舟" }, new string[3] { "怡", "霞", "贞" }, new string[2] { "风", "羽" }, new string[2] { "道", "怀" }, new string[1] { "仙" }, new string[1] { "梦" });
		array[1930] = new HanNameItem(1930, "斯", new string[15]
		{
			"昌", "谦", "韬", "仁", "衡", "杰", "哲", "茂", "文", "义",
			"博", "睿", "伟", "豪", "正"
		}, new string[9] { "慧", "敏", "佳", "雅", "宁", "娴", "馨", "谨", "淳" }, new string[0], new string[0], new string[0], new string[0]);
		array[1931] = new HanNameItem(1931, "松", new string[8] { "涛", "峰", "泉", "茂", "奇", "友", "风", "良" }, new string[5] { "琴", "芝", "菊", "梅", "英" }, new string[3] { "玉", "云", "青" }, new string[3] { "年", "树", "之" }, new string[0], new string[4] { "君", "柏", "竹", "月" });
		array[1932] = new HanNameItem(1932, "圣", new string[11]
		{
			"恭", "通", "崇", "杰", "哲", "博", "荣", "智", "尧", "仁",
			"儒"
		}, new string[3] { "善", "雅", "宁" }, new string[2] { "昭", "贤" }, new string[0], new string[0], new string[0]);
		array[1933] = new HanNameItem(1933, "首", new string[9] { "安", "康", "奇", "昌", "聪", "毅", "廉", "敬", "良" }, new string[8] { "艳", "珍", "媛", "嘉", "懿", "慧", "灵", "静" }, new string[2] { "宁", "孝" }, new string[0], new string[0], new string[0]);
		array[1934] = new HanNameItem(1934, "庶", new string[5] { "明", "顺", "良", "杰", "昌" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[1935] = new HanNameItem(1935, "树", new string[6] { "勋", "文", "成", "良", "哲", "朋" }, new string[6] { "梅", "芳", "萱", "兰", "英", "荃" }, new string[2] { "清", "礼" }, new string[2] { "国", "己" }, new string[0], new string[1] { "真" });
		array[2000] = new HanNameItem(2000, "太", new string[5] { "冲", "平", "安", "沧", "浦" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2001] = new HanNameItem(2001, "泰", new string[8] { "开", "安", "通", "康", "当", "昌", "达", "和" }, new string[0], new string[1] { "芝" }, new string[2] { "来", "斗" }, new string[0], new string[0]);
		array[2002] = new HanNameItem(2002, "腾", new string[12]
		{
			"龙", "蛟", "虎", "起", "文", "扬", "逸", "云", "达", "飞",
			"骥", "扬"
		}, new string[0], new string[1] { "襄" }, new string[1] { "升" }, new string[0], new string[0]);
		array[2003] = new HanNameItem(2003, "天", new string[63]
		{
			"德", "雄", "保", "宏", "寿", "丞", "望", "恒", "正", "宝",
			"禄", "松", "福", "齐", "龙", "虎", "豹", "章", "云", "馥",
			"护", "通", "魁", "宝", "残", "赋", "苍", "祐", "雷", "刚",
			"鸣", "彪", "洪", "虹", "昭", "辉", "和", "独", "成", "浩",
			"回", "弘", "宏", "阔", "柬", "林", "越", "祥", "惠", "鸥",
			"惟", "维", "程", "奎", "殇", "驰", "幼", "登", "镇", "巧",
			"江", "梁", "翔"
		}, new string[2] { "娇", "裳" }, new string[8] { "抒", "霜", "芳", "星", "灵", "惠", "华", "雨" }, new string[14]
		{
			"石", "年", "川", "骄", "斗", "长", "富", "豪", "极", "骄",
			"河", "刀", "贻", "育"
		}, new string[0], new string[0]);
		array[2004] = new HanNameItem(2004, "铁", new string[12]
		{
			"鹗", "鸥", "生", "鹰", "牛", "熊", "铮", "摧", "雄", "轩",
			"枫", "轼"
		}, new string[2] { "兰", "蕾" }, new string[1] { "英" }, new string[6] { "山", "树", "狮", "鹤", "猿", "豪" }, new string[0], new string[2] { "心", "花" });
		array[2005] = new HanNameItem(2005, "廷", new string[6] { "枢", "龙", "麟", "熊", "兴", "凌" }, new string[0], new string[3] { "秀", "绣", "芳" }, new string[1] { "丹" }, new string[0], new string[0]);
		array[2006] = new HanNameItem(2006, "婷", new string[0], new string[4] { "怡", "芳", "菲", "慧" }, new string[0], new string[0], new string[3] { "仙", "君", "儿" }, new string[0]);
		array[2007] = new HanNameItem(2007, "通", new string[9] { "文", "武", "海", "胜", "翰", "博", "达", "玄", "岐" }, new string[0], new string[0], new string[2] { "天", "南" }, new string[0], new string[0]);
		array[2008] = new HanNameItem(2008, "同", new string[5] { "文", "礼", "徽", "归", "源" }, new string[1] { "贞" }, new string[1] { "雨" }, new string[1] { "怀" }, new string[0], new string[0]);
		array[2009] = new HanNameItem(2009, "图", new string[6] { "胜", "昌", "晋", "进", "续", "直" }, new string[0], new string[0], new string[1] { "南" }, new string[0], new string[0]);
		array[2010] = new HanNameItem(2010, "恬", new string[3] { "风", "亮", "伟" }, new string[9] { "怡", "雅", "蕾", "雯", "婵", "秀", "芳", "然", "丽" }, new string[7] { "简", "适", "笑", "霖", "素", "纯", "真" }, new string[0], new string[5] { "君", "儿", "仪", "如", "初" }, new string[0]);
		array[2011] = new HanNameItem(2011, "庭", new string[1] { "树" }, new string[6] { "芝", "芳", "芸", "露", "雨", "燕" }, new string[6] { "兰", "熙", "星", "月", "雪", "桂" }, new string[0], new string[0], new string[0]);
		array[2012] = new HanNameItem(2012, "台", new string[9] { "安", "成", "广", "阔", "柳", "星", "川", "江", "君" }, new string[2] { "静", "淑" }, new string[0], new string[6] { "宿", "城", "阁", "镜", "冀", "山" }, new string[0], new string[0]);
		array[2013] = new HanNameItem(2013, "昙", new string[1] { "阳" }, new string[10] { "云", "月", "雪", "素", "芳", "芸", "露", "雨", "丽", "蕾" }, new string[0], new string[1] { "听" }, new string[0], new string[2] { "谛", "霖" });
		array[2014] = new HanNameItem(2014, "堂", new string[11]
		{
			"正", "明", "翰", "柳", "济", "钰", "禄", "奕", "明", "湛",
			"宁"
		}, new string[8] { "翠", "秀", "云", "月", "燕", "婉", "慧", "嘉" }, new string[4] { "华", "英", "欢", "雪" }, new string[2] { "祺", "松" }, new string[0], new string[2] { "春", "萤" });
		array[2015] = new HanNameItem(2015, "棠", new string[3] { "舟", "绍", "林" }, new string[14]
		{
			"玉", "雪", "雨", "月", "杏", "荷", "香", "芳", "蕊", "秀",
			"丽", "艳", "娇", "蕙"
		}, new string[2] { "华", "英" }, new string[0], new string[6] { "梨", "脂", "胭", "秋", "朵", "春" }, new string[0]);
		array[2016] = new HanNameItem(2016, "涛", new string[8] { "扬", "波", "松", "海", "白", "信", "景", "瀚" }, new string[0], new string[0], new string[1] { "声" }, new string[0], new string[0]);
		array[2017] = new HanNameItem(2017, "韬", new string[19]
		{
			"世", "光", "涵", "瑜", "云", "才", "日", "华", "烨", "雄",
			"武", "远", "杰", "智", "成", "然", "文", "齐", "炜"
		}, new string[0], new string[3] { "碧", "月", "玉" }, new string[0], new string[0], new string[0]);
		array[2018] = new HanNameItem(2018, "桃", new string[0], new string[17]
		{
			"红", "华", "杏", "颜", "韵", "秀", "芳", "蕊", "丽", "艳",
			"娇", "英", "霞", "玉", "芬", "菲", "芝"
		}, new string[0], new string[2] { "源", "林" }, new string[3] { "夭", "浓", "朵" }, new string[0]);
		array[2019] = new HanNameItem(2019, "听", new string[0], new string[0], new string[5] { "风", "雨", "雪", "月", "琴" }, new string[1] { "雷" }, new string[0], new string[2] { "蝉", "竹" });
		array[2020] = new HanNameItem(2020, "亭", new string[1] { "轩" }, new string[6] { "芳", "芸", "燕", "萱", "月", "云" }, new string[3] { "文", "玉", "岚" }, new string[0], new string[0], new string[0]);
		array[2021] = new HanNameItem(2021, "桐", new string[0], new string[8] { "梓", "月", "英", "华", "秀", "菁", "谣", "琴" }, new string[1] { "萧" }, new string[0], new string[0], new string[2] { "溪", "秋" });
		array[2022] = new HanNameItem(2022, "踏", new string[1] { "浪" }, new string[0], new string[3] { "歌", "雪", "月" }, new string[0], new string[0], new string[1] { "枝" });
		array[2023] = new HanNameItem(2023, "檀", new string[1] { "舟" }, new string[14]
		{
			"香", "樱", "杏", "芸", "蕊", "鹃", "桃", "乔", "薇", "青",
			"荷", "妙", "馨", "珍"
		}, new string[2] { "心", "玉" }, new string[1] { "城" }, new string[1] { "袖" }, new string[4] { "溪", "桐", "柘", "紫" });
		array[2024] = new HanNameItem(2024, "汀", new string[3] { "洲", "舟", "柳" }, new string[6] { "芳", "蕙", "滢", "莹", "岚", "芷" }, new string[2] { "兰", "葭" }, new string[0], new string[1] { "冬" }, new string[0]);
		array[2025] = new HanNameItem(2025, "缇", new string[0], new string[15]
		{
			"莹", "岚", "芳", "蕙", "安", "秀", "丹", "英", "玉", "霞",
			"萱", "曼", "娟", "华", "云"
		}, new string[0], new string[0], new string[4] { "萦", "绣", "衣", "裳" }, new string[0]);
		array[2026] = new HanNameItem(2026, "霆", new string[15]
		{
			"锋", "峰", "风", "宇", "雨", "音", "威", "振", "泽", "声",
			"坚", "云", "淞", "嵩", "岳"
		}, new string[0], new string[0], new string[1] { "霄" }, new string[0], new string[0]);
		array[2100] = new HanNameItem(2100, "婉", new string[0], new string[60]
		{
			"慧", "静", "妙", "然", "柔", "悦", "怡", "白", "英", "菊",
			"琼", "玉", "邪", "霞", "媛", "妍", "琴", "情", "莲", "华",
			"恬", "萍", "忧", "愁", "蓉", "雅", "嫣", "倩", "素", "娇",
			"琳", "纯", "蝶", "雯", "催", "婵", "秀", "绣", "萱", "芳",
			"珍", "馨", "然", "丽", "菁", "慧", "贞", "幽", "娟", "誉",
			"宣", "灵", "月", "玲", "慕", "吟", "湘", "淑", "抒", "滢"
		}, new string[0], new string[0], new string[21]
		{
			"清", "儿", "仪", "妹", "萝", "仙", "君", "颜", "凝", "心",
			"梦", "约", "娥", "萼", "娘", "仪", "桐", "初", "屏", "连",
			"歌"
		}, new string[0]);
		array[2101] = new HanNameItem(2101, "万", new string[32]
		{
			"嗔", "钧", "安", "胜", "泉", "宝", "涛", "博", "全", "韬",
			"弘", "宏", "化", "舟", "骏", "岚", "祥", "恕", "均", "喜",
			"庸", "止", "聪", "奎", "驰", "绅", "勇", "贯", "朋", "巧",
			"军", "力"
		}, new string[1] { "颐" }, new string[4] { "春", "谊", "英", "华" }, new string[18]
		{
			"年", "山", "亭", "里", "仇", "斗", "川", "楼", "千", "象",
			"叶", "辰", "怀", "名", "知", "世", "骄", "敌"
		}, new string[0], new string[2] { "紫", "朱" });
		array[2102] = new HanNameItem(2102, "旺", new string[3] { "先", "通", "宝" }, new string[0], new string[0], new string[1] { "发" }, new string[0], new string[0]);
		array[2103] = new HanNameItem(2103, "望", new string[8] { "海", "摧", "先", "阳", "岐", "禹", "淞", "嵩" }, new string[0], new string[7] { "舒", "琴", "莲", "春", "昕", "虹", "雨" }, new string[7] { "之", "楼", "阁", "空", "辰", "西", "犀" }, new string[0], new string[2] { "仙", "水" });
		array[2104] = new HanNameItem(2104, "为", new string[16]
		{
			"义", "宪", "彦", "仁", "善", "震", "悌", "阔", "谏", "材",
			"情", "莫", "益", "绩", "谦", "用"
		}, new string[3] { "怡", "雅", "贞" }, new string[2] { "嘉", "懿" }, new string[4] { "孝", "怀", "语", "中" }, new string[0], new string[1] { "梦" });
		array[2105] = new HanNameItem(2105, "惟", new string[6] { "浚", "庸", "杀", "摧", "异", "谏" }, new string[0], new string[0], new string[1] { "学" }, new string[0], new string[0]);
		array[2106] = new HanNameItem(2106, "维", new string[5] { "扬", "甸", "翰", "祐", "岳" }, new string[0], new string[0], new string[2] { "道", "宗" }, new string[0], new string[0]);
		array[2107] = new HanNameItem(2107, "未", new string[7] { "参", "铨", "达", "成", "雨", "季", "俅" }, new string[0], new string[1] { "弃" }, new string[6] { "央", "换", "逢", "辰", "圣", "央" }, new string[0], new string[0]);
		array[2108] = new HanNameItem(2108, "畏", new string[1] { "宣" }, new string[0], new string[1] { "雨" }, new string[1] { "之" }, new string[0], new string[0]);
		array[2109] = new HanNameItem(2109, "文", new string[77]
		{
			"德", "通", "冲", "亮", "成", "理", "安", "程", "辉", "奎",
			"铨", "田", "伟", "显", "岳", "哲", "仲", "宾", "斌", "彬",
			"翰", "泉", "铮", "昌", "彦", "俊", "渊", "龙", "虎", "兴",
			"生", "先", "畴", "崇", "质", "典", "广", "韬", "裕", "昭",
			"鼎", "锐", "定", "炳", "正", "扬", "轩", "泰", "启", "浩",
			"嘉", "嵩", "钟", "越", "权", "祥", "恕", "贵", "基", "显",
			"泽", "起", "逸", "襄", "豹", "枢", "宽", "烛", "宿", "绪",
			"经", "修", "踪", "强", "会", "翔", "军"
		}, new string[28]
		{
			"丽", "怡", "琼", "霞", "媛", "妍", "燕", "雅", "倩", "蕾",
			"琳", "茵", "婵", "菲", "慧", "静", "露", "熙", "珈", "绮",
			"娅", "茜", "荷", "婕", "琬", "滢", "洁", "爱"
		}, new string[34]
		{
			"秀", "锦", "馨", "琪", "纪", "珂", "思", "熙", "言", "瑾",
			"斐", "澜", "雅", "懿", "凤", "英", "菊", "琴", "莲", "华",
			"恬", "奇", "笑", "染", "皎", "素", "催", "芳", "贤", "新",
			"缨", "惠", "琪", "卓"
		}, new string[8] { "期", "山", "凡", "来", "阁", "举", "金", "池" }, new string[5] { "钗", "君", "萼", "娘", "竹" }, new string[10] { "心", "仙", "璧", "箫", "梦", "约", "师", "仪", "初", "霭" });
		array[2110] = new HanNameItem(2110, "无", new string[14]
		{
			"忌", "望", "常", "宇", "伤", "杀", "摧", "闻", "艺", "垣",
			"端", "季", "理", "用"
		}, new string[5] { "艳", "邪", "妍", "怜", "秀" }, new string[12]
		{
			"殇", "念", "寂", "琴", "情", "华", "奇", "忧", "愁", "离",
			"悔", "馨"
		}, new string[12]
		{
			"命", "畏", "为", "极", "敌", "咎", "期", "换", "怀", "忍",
			"仇", "己"
		}, new string[2] { "容", "颜" }, new string[14]
		{
			"施", "双", "垢", "病", "瑕", "缺", "心", "花", "声", "难",
			"痕", "凡", "声", "名"
		});
		array[2111] = new HanNameItem(2111, "武", new string[8] { "德", "通", "刚", "和", "雄", "扬", "嘉", "田" }, new string[0], new string[0], new string[1] { "功" }, new string[0], new string[0]);
		array[2112] = new HanNameItem(2112, "晚", new string[5] { "平", "枫", "明", "荣", "成" }, new string[9] { "珍", "英", "月", "艳", "岚", "静", "红", "梅", "荷" }, new string[1] { "星" }, new string[0], new string[0], new string[0]);
		array[2113] = new HanNameItem(2113, "忘", new string[0], new string[0], new string[0], new string[0], new string[0], new string[9] { "忧", "愁", "我", "机", "俗", "尘", "荃", "言", "情" });
		array[2114] = new HanNameItem(2114, "伟", new string[20]
		{
			"博", "毅", "彦", "光", "强", "忠", "荣", "雄", "良", "超",
			"康", "健", "杰", "亮", "鸿", "卓", "文", "贤", "良", "浩"
		}, new string[3] { "英", "敏", "珍" }, new string[0], new string[5] { "成", "略", "韬", "霖", "廉" }, new string[0], new string[0]);
		array[2115] = new HanNameItem(2115, "问", new string[6] { "玄", "鼎", "远", "孝", "宇", "天" }, new string[3] { "慧", "敏", "雪" }, new string[1] { "心" }, new string[3] { "樵", "陶", "海" }, new string[0], new string[1] { "月" });
		array[2116] = new HanNameItem(2116, "吾", new string[7] { "谦", "德", "安", "思", "勇", "胜", "昌" }, new string[4] { "珍", "敏", "英", "慧" }, new string[1] { "清" }, new string[0], new string[0], new string[0]);
		array[2117] = new HanNameItem(2117, "务", new string[8] { "先", "兴", "忠", "实", "勇", "诚", "俭", "信" }, new string[0], new string[0], new string[1] { "道" }, new string[0], new string[0]);
		array[2118] = new HanNameItem(2118, "宛", new string[0], new string[54]
		{
			"然", "音", "容", "如", "虹", "丽", "仪", "姿", "欣", "玉",
			"兰", "槿", "荷", "蓉", "萍", "静", "岚", "姝", "芬", "霞",
			"诗", "彤", "吟", "云", "月", "芸", "娉", "婕", "珂", "妤",
			"馨", "歆", "宁", "淑", "贞", "茵", "怡", "琼", "妍", "心",
			"婷", "莹", "琴", "芳", "茹", "秀", "英", "瑛", "娴", "玥",
			"洁", "莲", "佳", "嘉"
		}, new string[3] { "俞", "榕", "桦" }, new string[1] { "之" }, new string[4] { "秋", "清", "君", "晴" }, new string[0]);
		array[2119] = new HanNameItem(2119, "威", new string[54]
		{
			"远", "铭", "震", "兴", "武", "勇", "豪", "振", "熊", "虎",
			"宇", "伏", "雄", "迅", "军", "胜", "锋", "德", "礼", "固",
			"义", "信", "智", "扬", "存", "轩", "昌", "城", "强", "龙",
			"晗", "毅", "来", "福", "和", "正", "衡", "立", "翔", "泽",
			"光", "乐", "行", "弘", "瀚", "元", "韬", "新", "恕", "庆",
			"永", "勋", "荣", "峰"
		}, new string[0], new string[0], new string[4] { "神", "世", "钊", "鸣" }, new string[0], new string[0]);
		array[2200] = new HanNameItem(2200, "西", new string[1] { "云" }, new string[7] { "琼", "霞", "瑗", "媛", "妍", "琴", "雯" }, new string[5] { "冉", "莲", "华", "虹", "还" }, new string[5] { "山", "行", "明", "来", "豪" }, new string[0], new string[3] { "梧", "桐", "寒" });
		array[2201] = new HanNameItem(2201, "希", new string[7] { "节", "仁", "烈", "哲", "同", "玄", "翊" }, new string[3] { "怡", "霞", "妍" }, new string[5] { "华", "敏", "瑜", "贤", "荣" }, new string[2] { "之", "官" }, new string[4] { "弟", "妹", "君", "凝" }, new string[0]);
		array[2202] = new HanNameItem(2202, "惜", new string[7] { "过", "摧", "残", "源", "远", "弥", "锋" }, new string[14]
		{
			"琼", "霞", "瑗", "妍", "娇", "蝶", "雯", "雨", "贞", "裳",
			"慧", "娟", "霜", "吟"
		}, new string[18]
		{
			"生", "言", "谊", "青", "玉", "琴", "莲", "华", "梅", "文",
			"忧", "愁", "云", "虹", "然", "誉", "荣", "琦"
		}, new string[5] { "之", "恩", "辰", "怀", "金" }, new string[4] { "钗", "君", "颜", "容" }, new string[6] { "弱", "光", "凡", "梦", "花", "怀" });
		array[2203] = new HanNameItem(2203, "锡", new string[7] { "宝", "畴", "衮", "爵", "熊", "章", "振" }, new string[12]
		{
			"琼", "霞", "瑗", "媛", "妍", "萍", "娇", "蕾", "琳", "雯",
			"婵", "绣"
		}, new string[6] { "绶", "琴", "华", "瑜", "文", "璟" }, new string[4] { "龄", "官", "明", "豪" }, new string[3] { "钗", "颜", "萼" }, new string[3] { "君", "仪", "桐" });
		array[2204] = new HanNameItem(2204, "习", new string[3] { "颠", "晋", "嘉" }, new string[0], new string[0], new string[1] { "之" }, new string[0], new string[0]);
		array[2205] = new HanNameItem(2205, "霞", new string[0], new string[3] { "玉", "妍", "彩" }, new string[3] { "殇", "瑜", "染" }, new string[0], new string[4] { "姑", "钗", "颜", "娥" }, new string[3] { "楼", "光", "明" });
		array[2206] = new HanNameItem(2206, "夏", new string[1] { "实" }, new string[7] { "莲", "蓉", "蕾", "婵", "玲", "吟", "荷" }, new string[0], new string[0], new string[0], new string[0]);
		array[2207] = new HanNameItem(2207, "仙", new string[5] { "魁", "宇", "驹", "景", "辕" }, new string[15]
		{
			"琼", "霞", "瑗", "媛", "妍", "琴", "莲", "羽", "芸", "雅",
			"蕾", "琳", "茵", "雯", "婵"
		}, new string[9] { "英", "泉", "华", "瑜", "霖", "临", "虹", "珉", "越" }, new string[4] { "客", "龄", "川", "山" }, new string[15]
		{
			"罗", "仙", "娘", "萝", "衣", "颜", "钗", "君", "容", "梦",
			"儿", "阁", "娥", "萼", "仪"
		}, new string[4] { "梧", "来", "桐", "鉴" });
		array[2208] = new HanNameItem(2208, "纤", new string[0], new string[8] { "纤", "素", "琴", "华", "雯", "婵", "秀", "曼" }, new string[0], new string[0], new string[2] { "钗", "君" }, new string[0]);
		array[2209] = new HanNameItem(2209, "贤", new string[7] { "忠", "翰", "俊", "齐", "哲", "礼", "让" }, new string[1] { "慧" }, new string[0], new string[1] { "名" }, new string[0], new string[1] { "鉴" });
		array[2210] = new HanNameItem(2210, "献", new string[14]
		{
			"忠", "安", "魁", "钦", "艺", "义", "赋", "仁", "元", "韬",
			"鼎", "东", "敬", "材"
		}, new string[10] { "怡", "琼", "霞", "瑗", "琴", "莲", "蕾", "雯", "芳", "珍" }, new string[12]
		{
			"云", "芹", "乐", "谊", "英", "玉", "华", "瑜", "梅", "奇",
			"羽", "真"
		}, new string[1] { "之" }, new string[0], new string[0]);
		array[2211] = new HanNameItem(2211, "香", new string[5] { "驹", "生", "轩", "偃", "伏" }, new string[48]
		{
			"香", "灵", "兰", "芙", "怡", "泉", "琼", "玉", "霞", "瑗",
			"媛", "妍", "琴", "莲", "梅", "萍", "璃", "染", "芸", "蓉",
			"雅", "蕾", "琳", "茵", "蝶", "雯", "婵", "虹", "绣", "萱",
			"桂", "曼", "菲", "馨", "霁", "吟", "湘", "丘", "楠", "杏",
			"融", "隐", "颐", "荃", "钰", "延", "茗", "滢"
		}, new string[10] { "华", "瑜", "文", "源", "霖", "催", "锦", "临", "澜", "淳" }, new string[6] { "川", "候", "柏", "官", "潮", "秋" }, new string[16]
		{
			"罗", "儿", "萝", "衣", "钗", "君", "凝", "梦", "阁", "娥",
			"丹", "蔼", "萼", "仪", "里", "照"
		}, new string[4] { "楼", "梧", "来", "桐" });
		array[2212] = new HanNameItem(2212, "湘", new string[0], new string[13]
		{
			"兰", "怡", "英", "泉", "琼", "玉", "霞", "琴", "莲", "萍",
			"芸", "蓉", "蕾"
		}, new string[0], new string[1] { "河" }, new string[4] { "梧", "君", "儿", "桐" }, new string[0]);
		array[2213] = new HanNameItem(2213, "祥", new string[10] { "瑞", "钰", "安", "通", "乐", "泉", "云", "风", "丰", "顺" }, new string[0], new string[3] { "凤", "莲", "霖" }, new string[2] { "河", "道" }, new string[0], new string[0]);
		array[2214] = new HanNameItem(2214, "象", new string[15]
		{
			"先", "损", "融", "宝", "钦", "乾", "坤", "龙", "衡", "残",
			"冲", "广", "玄", "敦", "雄"
		}, new string[0], new string[0], new string[4] { "祖", "本", "光", "容" }, new string[0], new string[0]);
		array[2215] = new HanNameItem(2215, "逍", new string[1] { "遥" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2216] = new HanNameItem(2216, "小", new string[8] { "宝", "二", "三", "四", "五", "六", "八", "飞" }, new string[14]
		{
			"蝶", "莹", "翠", "慧", "青", "玉", "蓉", "雅", "倩", "蕾",
			"婵", "棠", "樱", "红"
		}, new string[3] { "七", "九", "凤" }, new string[1] { "狗" }, new string[5] { "钗", "仙", "猫", "环", "小" }, new string[2] { "妹", "山" });
		array[2217] = new HanNameItem(2217, "晓", new string[3] { "峰", "风", "东" }, new string[1] { "月" }, new string[0], new string[0], new string[0], new string[0]);
		array[2218] = new HanNameItem(2218, "孝", new string[24]
		{
			"廉", "文", "武", "德", "杰", "宽", "铭", "孺", "忠", "良",
			"康", "诚", "彦", "徽", "恭", "先", "存", "悌", "直", "衍",
			"祥", "让", "延", "严"
		}, new string[0], new string[0], new string[3] { "之", "怀", "集" }, new string[0], new string[1] { "鉴" });
		array[2219] = new HanNameItem(2219, "笑", new string[2] { "协", "望" }, new string[6] { "怡", "琼", "雅", "嫣", "蕾", "婵" }, new string[8] { "梅", "邪", "奇", "忧", "愁", "离", "飞", "雨" }, new string[3] { "官", "行", "凡" }, new string[0], new string[2] { "眉", "君" });
		array[2220] = new HanNameItem(2220, "啸", new string[10] { "风", "海", "虎", "龙", "林", "熊", "雷", "雄", "谷", "丘" }, new string[0], new string[0], new string[2] { "天", "怀" }, new string[0], new string[0]);
		array[2221] = new HanNameItem(2221, "心", new string[32]
		{
			"昂", "彦", "传", "涛", "同", "恪", "仁", "锐", "潜", "沛",
			"烈", "敖", "丞", "豹", "护", "奎", "遥", "宽", "孺", "啸",
			"寓", "胄", "宿", "绪", "欢", "延", "朗", "严", "允", "会",
			"梁", "晨"
		}, new string[30]
		{
			"兰", "怡", "琼", "瑗", "霞", "妍", "梅", "萍", "雅", "倩",
			"蕾", "蝶", "雯", "婵", "越", "熙", "遇", "融", "惠", "斐",
			"莹", "琰", "珅", "卓", "蕊", "茗", "滢", "巧", "洁", "琛"
		}, new string[17]
		{
			"省", "寓", "烛", "乐", "泉", "莲", "华", "文", "羽", "悦",
			"回", "岩", "恕", "随", "惜", "钰", "辕"
		}, new string[2] { "潮", "赤" }, new string[9] { "钗", "罗", "娥", "连", "轨", "眉", "依", "环", "育" }, new string[4] { "梦", "厚", "仇", "一" });
		array[2222] = new HanNameItem(2222, "星", new string[30]
		{
			"武", "文", "寿", "驰", "泉", "魁", "驹", "渊", "云", "残",
			"超", "祐", "嗣", "元", "垣", "玄", "辉", "鼎", "独", "亮",
			"景", "轩", "至", "伏", "远", "洋", "宏", "越", "钰", "宿"
		}, new string[17]
		{
			"怡", "琼", "玉", "瑗", "璃", "倩", "蕾", "翠", "彩", "蝶",
			"雯", "婵", "怜", "绣", "星", "棠", "璨"
		}, new string[19]
		{
			"阑", "霞", "莲", "华", "瑜", "文", "奇", "忧", "皎", "锦",
			"临", "虹", "璟", "昭", "飞", "殊", "冕", "还", "回"
		}, new string[10] { "河", "魂", "石", "川", "天", "客", "南", "豪", "鉴", "河" }, new string[12]
		{
			"钗", "颜", "凝", "罗", "容", "儿", "阁", "娥", "萼", "娘",
			"鸾", "如"
		}, new string[8] { "池", "衣", "璧", "梦", "来", "桐", "寒", "照" });
		array[2223] = new HanNameItem(2223, "兴", new string[32]
		{
			"恕", "云", "胄", "勃", "通", "盛", "昌", "翰", "徽", "志",
			"齐", "义", "业", "德", "冲", "续", "彪", "洪", "阳", "雄",
			"扬", "固", "鸿", "阔", "荣", "丘", "岚", "瑞", "腾", "逸",
			"振", "霸"
		}, new string[0], new string[0], new string[9] { "楼", "流", "明", "潮", "怀", "竹", "世", "枝", "民" }, new string[0], new string[0]);
		array[2224] = new HanNameItem(2224, "杏", new string[0], new string[5] { "怡", "琼", "妍", "蕾", "芳" }, new string[2] { "雨", "英" }, new string[0], new string[3] { "仙", "颜", "儿" }, new string[1] { "白" });
		array[2225] = new HanNameItem(2225, "熊", new string[4] { "昌", "祥", "刚", "林" }, new string[0], new string[0], new string[1] { "光" }, new string[0], new string[0]);
		array[2226] = new HanNameItem(2226, "宿", new string[7] { "风", "海", "全", "安", "苍", "谷", "伟" }, new string[2] { "怡", "月" }, new string[3] { "云", "华", "吟" }, new string[4] { "本", "怀", "狮", "日" }, new string[0], new string[0]);
		array[2227] = new HanNameItem(2227, "秀", new string[14]
		{
			"达", "捷", "康", "彦", "义", "风", "实", "仁", "哲", "骥",
			"扬", "景", "峰", "林"
		}, new string[44]
		{
			"怡", "凤", "琼", "玉", "媛", "妍", "琴", "莲", "华", "冰",
			"梅", "萍", "芸", "蓉", "雅", "嫣", "春", "娇", "蕾", "琳",
			"茵", "彩", "蝶", "雯", "婵", "虹", "秀", "萱", "桂", "芳",
			"曼", "珍", "雁", "馨", "棠", "然", "丽", "樱", "红", "菁",
			"慧", "贞", "娟", "芹"
		}, new string[15]
		{
			"乐", "谊", "白", "英", "铮", "青", "瑜", "文", "奇", "羽",
			"皎", "锦", "昭", "贤", "让"
		}, new string[4] { "夫", "川", "山", "树" }, new string[22]
		{
			"娘", "妹", "萝", "衣", "钗", "仙", "君", "颜", "凝", "心",
			"罗", "容", "约", "儿", "阁", "娥", "萼", "凰", "仪", "桐",
			"连", "环"
		}, new string[1] { "明" });
		array[2228] = new HanNameItem(2228, "轩", new string[13]
		{
			"辕", "青", "谷", "乔", "宵", "弥", "妙", "植", "莫", "吟",
			"靖", "林", "宿"
		}, new string[1] { "香" }, new string[0], new string[1] { "镜" }, new string[0], new string[0]);
		array[2229] = new HanNameItem(2229, "玄", new string[42]
		{
			"风", "同", "通", "当", "宇", "徽", "志", "羽", "杀", "摧",
			"破", "苍", "超", "兴", "栋", "生", "祐", "冲", "望", "质",
			"鹏", "元", "锦", "异", "垣", "韬", "玄", "辉", "鼎", "定",
			"阳", "信", "炳", "正", "亮", "武", "景", "殊", "度", "禹",
			"磐", "殷"
		}, new string[1] { "月" }, new string[11]
		{
			"凤", "英", "玉", "霞", "琴", "冰", "弃", "星", "素", "昭",
			"真"
		}, new string[12]
		{
			"道", "龄", "光", "客", "处", "秋", "阁", "丹", "象", "非",
			"空", "名"
		}, new string[0], new string[4] { "衣", "心", "箫", "初" });
		array[2230] = new HanNameItem(2230, "学", new string[9] { "海", "骥", "廉", "勤", "韬", "谊", "彦", "训", "征" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2231] = new HanNameItem(2231, "寻", new string[6] { "绪", "欢", "徽", "义", "风", "林" }, new string[2] { "嫣", "香" }, new string[9] { "琴", "幽", "春", "虹", "真", "芳", "星", "珍", "馨" }, new string[2] { "道", "根" }, new string[0], new string[2] { "仙", "梦" });
		array[2232] = new HanNameItem(2232, "雪", new string[4] { "宜", "生", "岩", "聪" }, new string[24]
		{
			"璇", "怡", "琼", "霞", "瑗", "媛", "妍", "萍", "璃", "嫣",
			"倩", "娇", "琳", "婵", "雁", "丽", "芝", "熙", "蝉", "抒",
			"瑾", "芙", "莹", "柳"
		}, new string[10] { "洵", "芹", "英", "琴", "莲", "华", "梅", "临", "昭", "贤" }, new string[3] { "亭", "川", "柏" }, new string[8] { "钗", "仙", "颜", "凝", "儿", "娥", "萼", "娘" }, new string[6] { "衣", "君", "璧", "心", "桐", "尘" });
		array[2233] = new HanNameItem(2233, "夕", new string[0], new string[5] { "艳", "雯", "晴", "虹", "兰" }, new string[3] { "星", "月", "宁" }, new string[0], new string[0], new string[0]);
		array[2234] = new HanNameItem(2234, "喜", new string[0], new string[4] { "樱", "梅", "芙", "静" }, new string[3] { "雨", "真", "文" }, new string[0], new string[0], new string[3] { "颜", "君", "宝" });
		array[2235] = new HanNameItem(2235, "闲", new string[4] { "逸", "平", "康", "舟" }, new string[4] { "英", "淑", "歌", "柔" }, new string[3] { "云", "安", "宁" }, new string[1] { "之" }, new string[0], new string[0]);
		array[2236] = new HanNameItem(2236, "宪", new string[13]
		{
			"康", "安", "典", "平", "斌", "武", "昌", "宽", "仁", "承",
			"成", "杰", "哲"
		}, new string[4] { "英", "琪", "敏", "芳" }, new string[2] { "文", "和" }, new string[0], new string[0], new string[0]);
		array[2237] = new HanNameItem(2237, "羡", new string[10] { "涛", "奇", "安", "鹏", "良", "远", "杰", "义", "礼", "武" }, new string[7] { "英", "怡", "灵", "雪", "萍", "晴", "歌" }, new string[3] { "宁", "真", "文" }, new string[0], new string[0], new string[1] { "仙" });
		array[2238] = new HanNameItem(2238, "翔", new string[10] { "宇", "远", "文", "武", "鹏", "龙", "云", "蛟", "鸥", "翰" }, new string[2] { "莺", "幽" }, new string[1] { "云" }, new string[1] { "空" }, new string[0], new string[0]);
		array[2239] = new HanNameItem(2239, "相", new string[5] { "骏", "荣", "安", "邦", "恕" }, new string[0], new string[0], new string[2] { "如", "君" }, new string[0], new string[0]);
		array[2240] = new HanNameItem(2240, "新", new string[16]
		{
			"邦", "丰", "征", "谦", "明", "元", "毅", "勇", "仁", "智",
			"哲", "良", "礼", "义", "武", "文"
		}, new string[1] { "雨" }, new string[0], new string[2] { "民", "国" }, new string[1] { "语" }, new string[0]);
		array[2241] = new HanNameItem(2241, "欣", new string[7] { "成", "仁", "存", "恒", "荣", "逸", "泰" }, new string[2] { "宁", "欣" }, new string[0], new string[0], new string[2] { "怡", "如" }, new string[0]);
		array[2242] = new HanNameItem(2242, "信", new string[10] { "彰", "诚", "忠", "荣", "良", "义", "达", "昌", "和", "勇" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2243] = new HanNameItem(2243, "虚", new string[4] { "志", "平", "远", "俭" }, new string[2] { "谨", "和" }, new string[0], new string[0], new string[0], new string[0]);
		array[2244] = new HanNameItem(2244, "萱", new string[0], new string[4] { "兰", "怡", "梅", "芝" }, new string[0], new string[0], new string[2] { "仪", "草" }, new string[0]);
		array[2245] = new HanNameItem(2245, "迅", new string[5] { "平", "风", "浪", "彪", "思" }, new string[1] { "景" }, new string[0], new string[3] { "舟", "帆", "影" }, new string[0], new string[0]);
		array[2300] = new HanNameItem(2300, "雅", new string[7] { "风", "淳", "醇", "亮", "胜", "赋", "俊" }, new string[34]
		{
			"怡", "菊", "琼", "瑗", "媛", "妍", "琴", "莲", "萍", "芸",
			"蓉", "嫣", "倩", "娇", "蕾", "琳", "纯", "雯", "婵", "虹",
			"秀", "绣", "萱", "芳", "珍", "馨", "棠", "丽", "菁", "芝",
			"荃", "随", "斐", "洁"
		}, new string[8] { "谊", "邪", "文", "恬", "霖", "昕", "昭", "贤" }, new string[4] { "相", "厚", "候", "客" }, new string[13]
		{
			"萝", "钗", "仙", "君", "颜", "人", "罗", "约", "阁", "娥",
			"仪", "屏", "晴"
		}, new string[1] { "歌" });
		array[2301] = new HanNameItem(2301, "烟", new string[0], new string[6] { "怡", "琼", "霞", "雯", "虹", "霁" }, new string[6] { "飞", "华", "波", "宵", "琦", "莫" }, new string[2] { "辰", "日" }, new string[1] { "凝" }, new string[0]);
		array[2302] = new HanNameItem(2302, "延", new string[25]
		{
			"昌", "福", "广", "翰", "钧", "朗", "赏", "寿", "泰", "遇",
			"经", "通", "胜", "盛", "庆", "徽", "平", "义", "业", "禄",
			"誉", "荣", "喜", "枢", "习"
		}, new string[2] { "艳", "香" }, new string[2] { "曦", "谊" }, new string[7] { "嗣", "政", "己", "龄", "年", "胤", "知" }, new string[0], new string[0]);
		array[2303] = new HanNameItem(2303, "炎", new string[5] { "昶", "武", "兴", "刚", "辅" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2304] = new HanNameItem(2304, "妍", new string[0], new string[14]
		{
			"耽", "黛", "玉", "妍", "雅", "彩", "芳", "丽", "慧", "静",
			"抒", "卓", "娅", "茜"
		}, new string[0], new string[0], new string[0], new string[0]);
		array[2305] = new HanNameItem(2305, "衍", new string[0], new string[3] { "兰", "茵", "雯" }, new string[2] { "忧", "愁" }, new string[0], new string[0], new string[0]);
		array[2306] = new HanNameItem(2306, "彦", new string[9] { "博", "威", "玮", "章", "康", "诚", "邦", "昌", "博" }, new string[0], new string[0], new string[2] { "之", "祖" }, new string[0], new string[0]);
		array[2307] = new HanNameItem(2307, "瑶", new string[4] { "绅", "琨", "生", "辉" }, new string[18]
		{
			"珈", "凤", "琼", "玉", "琴", "素", "蕾", "琳", "翠", "彩",
			"婵", "秀", "菲", "珍", "贞", "琦", "沛", "弼"
		}, new string[5] { "英", "泉", "华", "璟", "星" }, new string[3] { "斗", "石", "川" }, new string[6] { "衣", "光", "钗", "仙", "烟", "娥" }, new string[3] { "山", "璧", "桐" });
		array[2308] = new HanNameItem(2308, "耀", new string[12]
		{
			"轩", "康", "昌", "文", "苍", "辉", "东", "阳", "星", "荣",
			"岩", "丘"
		}, new string[0], new string[0], new string[7] { "之", "发", "祖", "南", "辰", "怀", "名" }, new string[0], new string[0]);
		array[2309] = new HanNameItem(2309, "一", new string[14]
		{
			"鸣", "啸", "雷", "飞", "笑", "耀", "勇", "元", "鸿", "平",
			"帆", "贯", "胜", "伤"
		}, new string[0], new string[0], new string[2] { "刀", "品" }, new string[0], new string[1] { "清" });
		array[2310] = new HanNameItem(2310, "依", new string[0], new string[13]
		{
			"怡", "瑗", "萍", "蓉", "蕾", "琴", "玉", "雯", "贤", "敏",
			"娟", "乔", "瑾"
		}, new string[0], new string[0], new string[2] { "人", "水" }, new string[0]);
		array[2311] = new HanNameItem(2311, "贻", new string[2] { "范", "桂" }, new string[3] { "情", "雅", "嫣" }, new string[0], new string[0], new string[0], new string[0]);
		array[2312] = new HanNameItem(2312, "颐", new string[4] { "浩", "昌", "俊", "风" }, new string[1] { "雅" }, new string[1] { "心" }, new string[0], new string[0], new string[0]);
		array[2313] = new HanNameItem(2313, "以", new string[5] { "勤", "同", "智", "敦", "庚" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2314] = new HanNameItem(2314, "义", new string[14]
		{
			"兴", "伦", "通", "渊", "博", "承", "先", "存", "方", "弘",
			"宏", "阔", "植", "昉"
		}, new string[0], new string[1] { "琰" }, new string[7] { "府", "山", "发", "升", "金", "鉴", "河" }, new string[0], new string[0]);
		array[2315] = new HanNameItem(2315, "英", new string[18]
		{
			"杰", "松", "奇", "雄", "熊", "魁", "龙", "虎", "摧", "超",
			"德", "洪", "鹏", "武", "宏", "浦", "昉", "会"
		}, new string[13]
		{
			"琼", "媛", "妍", "梅", "蓉", "雅", "蕾", "彩", "蝶", "雯",
			"婵", "贞", "芝"
		}, new string[9] { "虹", "玉", "华", "瑜", "奇", "纯", "飞", "贤", "慕" }, new string[4] { "豪", "际", "继", "连" }, new string[3] { "钗", "娥", "娘" }, new string[1] { "儿" });
		array[2316] = new HanNameItem(2316, "莺", new string[0], new string[5] { "莺", "媛", "妍", "羽", "飞" }, new string[0], new string[0], new string[5] { "钗", "仙", "来", "儿", "屏" }, new string[0]);
		array[2317] = new HanNameItem(2317, "盈", new string[0], new string[10] { "盈", "霞", "华", "心", "笑", "雅", "蕾", "彩", "芳", "菲" }, new string[0], new string[0], new string[3] { "仙", "君", "袖" }, new string[0]);
		array[2318] = new HanNameItem(2318, "应", new string[7] { "溥", "咸", "扬", "元", "熊", "昌", "直" }, new string[0], new string[4] { "琦", "谊", "华", "梅" }, new string[2] { "榴", "怀" }, new string[0], new string[0]);
		array[2319] = new HanNameItem(2319, "映", new string[0], new string[0], new string[4] { "棠", "泉", "霞", "莲" }, new string[4] { "川", "之", "光", "空" }, new string[0], new string[0]);
		array[2320] = new HanNameItem(2320, "永", new string[50]
		{
			"吉", "盛", "忠", "兴", "固", "安", "通", "康", "平", "衡",
			"信", "正", "贤", "禄", "成", "顺", "鸿", "阔", "嘉", "谏",
			"良", "懿", "建", "新", "铄", "宣", "慕", "衍", "念", "岩",
			"林", "健", "岚", "祥", "让", "恕", "贵", "瑞", "思", "廉",
			"田", "斌", "献", "宽", "欢", "延", "昶", "宁", "烨", "筠"
		}, new string[7] { "贞", "霁", "霜", "熙", "淑", "莹", "琰" }, new string[6] { "青", "谊", "芳", "悦", "慧", "韶" }, new string[12]
		{
			"明", "孝", "升", "辰", "语", "继", "胤", "金", "鉴", "镜",
			"晴", "厚"
		}, new string[1] { "依" }, new string[1] { "清" });
		array[2321] = new HanNameItem(2321, "用", new string[5] { "挚", "诚", "徽", "义", "韬" }, new string[0], new string[6] { "谊", "琴", "忧", "愁", "悔", "真" }, new string[0], new string[0], new string[1] { "仪" });
		array[2322] = new HanNameItem(2322, "攸", new string[0], new string[1] { "怡" }, new string[2] { "宁", "弥" }, new string[1] { "行" }, new string[0], new string[0]);
		array[2323] = new HanNameItem(2323, "幽", new string[0], new string[20]
		{
			"怡", "琼", "瑗", "媛", "妍", "琴", "莲", "梅", "萍", "倩",
			"蕾", "茵", "彩", "蝶", "雯", "婵", "虹", "芳", "菲", "馨"
		}, new string[12]
		{
			"求", "昉", "泉", "邪", "华", "离", "云", "临", "璟", "澜",
			"然", "居"
		}, new string[0], new string[6] { "萝", "颜", "凝", "儿", "娥", "萼" }, new string[8] { "衣", "清", "君", "梦", "来", "水", "阁", "桐" });
		array[2324] = new HanNameItem(2324, "由", new string[4] { "敦", "艺", "义", "恪" }, new string[0], new string[0], new string[1] { "换" }, new string[0], new string[0]);
		array[2325] = new HanNameItem(2325, "游", new string[5] { "严", "驹", "龙", "玄", "骥" }, new string[0], new string[0], new string[1] { "道" }, new string[0], new string[0]);
		array[2326] = new HanNameItem(2326, "有", new string[7] { "方", "德", "诚", "义", "福", "禄", "荣" }, new string[0], new string[0], new string[4] { "道", "孝", "怀", "声" }, new string[0], new string[0]);
		array[2327] = new HanNameItem(2327, "幼", new string[2] { "聪", "孺" }, new string[26]
		{
			"萍", "薇", "怡", "琼", "邪", "妍", "琴", "莲", "冰", "梅",
			"羽", "嫣", "蕾", "琳", "纯", "彩", "蝶", "雯", "婵", "怜",
			"珍", "馨", "吟", "韶", "颐", "瑾"
		}, new string[0], new string[0], new string[5] { "钗", "仙", "凝", "桐", "鸾" }, new string[0]);
		array[2328] = new HanNameItem(2328, "与", new string[0], new string[0], new string[0], new string[1] { "之" }, new string[1] { "仙" }, new string[0]);
		array[2329] = new HanNameItem(2329, "羽", new string[0], new string[8] { "柔", "兰", "怡", "倩", "蝶", "婵", "馨", "裳" }, new string[1] { "飞" }, new string[0], new string[4] { "衣", "钗", "仙", "娘" }, new string[0]);
		array[2330] = new HanNameItem(2330, "雨", new string[0], new string[19]
		{
			"柔", "怡", "琼", "霞", "琴", "莲", "心", "萍", "忧", "蓉",
			"娇", "蕾", "琳", "蝶", "婵", "芳", "菲", "馨", "荷"
		}, new string[4] { "泉", "华", "虹", "止" }, new string[0], new string[7] { "钗", "仙", "凝", "烟", "梦", "娥", "娘" }, new string[4] { "楼", "清", "桐", "寒" });
		array[2331] = new HanNameItem(2331, "语", new string[0], new string[19]
		{
			"嫣", "绮", "怡", "琼", "邪", "妍", "琴", "莲", "冰", "梅",
			"心", "恬", "奇", "忧", "娇", "芳", "贤", "馨", "然"
		}, new string[0], new string[1] { "堂" }, new string[4] { "轻", "仙", "心", "梦" }, new string[0]);
		array[2332] = new HanNameItem(2332, "玉", new string[21]
		{
			"龙", "虎", "麟", "仑", "权", "圭", "珪", "篆", "沣", "驹",
			"栋", "质", "垣", "独", "景", "轩", "峰", "枫", "琮", "锋",
			"翔"
		}, new string[44]
		{
			"琼", "霞", "瑗", "媛", "妍", "琴", "冰", "梅", "燕", "心",
			"萍", "蓉", "雅", "娇", "蕾", "琳", "茵", "彩", "蝶", "婵",
			"秀", "绣", "萱", "桂", "芳", "菲", "珍", "雁", "馨", "棠",
			"立", "菁", "贞", "敏", "露", "熙", "蝉", "颖", "襄", "芙",
			"珅", "姣", "洁", "琛"
		}, new string[19]
		{
			"凤", "函", "泉", "白", "英", "泉", "华", "文", "皎", "霖",
			"锦", "星", "冕", "贤", "琅", "林", "楠", "祥", "蛟"
		}, new string[10] { "堂", "郎", "书", "斗", "川", "柏", "山", "客", "豪", "树" }, new string[22]
		{
			"环", "娘", "如", "妹", "萝", "钗", "仙", "君", "颜", "人",
			"罗", "容", "烟", "儿", "阁", "娥", "萼", "仪", "袖", "鸾",
			"连", "竹"
		}, new string[7] { "衣", "梧", "璧", "箫", "明", "桐", "寒" });
		array[2333] = new HanNameItem(2333, "元", new string[111]
		{
			"献", "龙", "霸", "安", "崇", "方", "亨", "纮", "基", "爵",
			"楷", "礼", "生", "式", "信", "益", "综", "炎", "牧", "盛",
			"魁", "当", "虎", "衡", "质", "鼎", "武", "治", "鸿", "阔",
			"嘉", "七", "楷", "绍", "直", "敏", "霄", "乔", "伟", "开",
			"隆", "匡", "逵", "沛", "植", "莫", "慕", "普", "靖", "念",
			"益", "佩", "丘", "钟", "韶", "祥", "让", "浦", "恕", "贵",
			"融", "晏", "磐", "图", "基", "节", "止", "彬", "聪", "毅",
			"殷", "起", "逸", "惠", "舒", "奎", "斌", "珂", "殇", "惜",
			"绶", "献", "宽", "啸", "昂", "勃", "宿", "捷", "绪", "宜",
			"醇", "朗", "经", "曦", "昶", "永", "昉", "纮", "修", "复",
			"坤", "烨", "镇", "焕", "尚", "羲", "济", "筠", "会", "翔",
			"晨"
		}, new string[5] { "姬", "雅", "慧", "湘", "爱" }, new string[17]
		{
			"凤", "素", "琰", "瑾", "九", "英", "玉", "霞", "华", "慧",
			"佳", "瑛", "缨", "襄", "璨", "柳", "洁"
		}, new string[21]
		{
			"鹤", "升", "怀", "藏", "圣", "镜", "根", "竹", "照", "厚",
			"轨", "日", "知", "慎", "敌", "晓", "池", "夫", "相", "一",
			"甲"
		}, new string[2] { "娘", "芷" }, new string[2] { "衣", "霭" });
		array[2334] = new HanNameItem(2334, "沅", new string[0], new string[9] { "沅", "怡", "英", "琼", "青", "妍", "莲", "琳", "湛" }, new string[0], new string[1] { "际" }, new string[4] { "芷", "清", "君", "儿" }, new string[0]);
		array[2335] = new HanNameItem(2335, "远", new string[10] { "图", "沧", "超", "望", "扬", "鸿", "舟", "居", "乔", "淞" }, new string[0], new string[0], new string[4] { "山", "来", "辰", "怀" }, new string[0], new string[0]);
		array[2336] = new HanNameItem(2336, "曰", new string[4] { "可", "熙", "修", "敦" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2337] = new HanNameItem(2337, "月", new string[0], new string[15]
		{
			"灵", "琼", "琴", "莲", "梅", "娇", "婵", "桂", "芳", "英",
			"珍", "馨", "咏", "瑛", "吟"
		}, new string[3] { "云", "泉", "华" }, new string[0], new string[7] { "如", "容", "仙", "凝", "儿", "娥", "桐" }, new string[0]);
		array[2338] = new HanNameItem(2338, "岳", new string[1] { "峰" }, new string[1] { "灵" }, new string[1] { "英" }, new string[1] { "年" }, new string[0], new string[0]);
		array[2339] = new HanNameItem(2339, "跃", new string[3] { "龙", "驹", "晋" }, new string[0], new string[0], new string[2] { "之", "升" }, new string[0], new string[0]);
		array[2340] = new HanNameItem(2340, "云", new string[44]
		{
			"方", "龙", "岳", "踪", "槐", "泉", "渊", "涛", "志", "海",
			"兴", "生", "望", "进", "存", "达", "鹏", "广", "辉", "和",
			"培", "飞", "骥", "扬", "景", "轩", "偃", "至", "伏", "峰",
			"远", "浩", "化", "开", "嵩", "祥", "图", "啸", "驰", "曦",
			"帆", "踪", "坤", "翔"
		}, new string[21]
		{
			"芳", "琼", "霞", "雅", "倩", "茵", "彩", "蝶", "婵", "黛",
			"秀", "绣", "菲", "珍", "馨", "丽", "咏", "颖", "攸", "绮",
			"姣"
		}, new string[20]
		{
			"鹊", "英", "华", "心", "奇", "笑", "素", "锦", "昭", "星",
			"冕", "雁", "澜", "波", "然", "雨", "佩", "若", "岚", "惜"
		}, new string[12]
		{
			"山", "天", "鹤", "孙", "换", "客", "处", "豪", "裔", "藏",
			"根", "河"
		}, new string[12]
		{
			"罗", "雀", "萝", "仙", "烟", "儿", "娥", "萼", "娘", "仪",
			"依", "悠"
		}, new string[11]
		{
			"衣", "楼", "清", "梦", "约", "来", "水", "阁", "初", "霭",
			"溪"
		});
		array[2341] = new HanNameItem(2341, "允", new string[20]
		{
			"泰", "生", "璨", "垂", "孚", "恭", "谦", "随", "文", "元",
			"章", "庚", "化", "谏", "嘉", "直", "求", "宣", "植", "烈"
		}, new string[2] { "艳", "熙" }, new string[1] { "若" }, new string[2] { "升", "怀" }, new string[0], new string[0]);
		array[2342] = new HanNameItem(2342, "蕴", new string[5] { "章", "铮", "传", "钦", "辉" }, new string[9] { "怡", "琼", "霞", "妍", "雅", "嫣", "春", "彩", "芳" }, new string[7] { "谊", "英", "泉", "文", "真", "贤", "淳" }, new string[2] { "长", "发" }, new string[0], new string[2] { "清", "初" });
		array[2343] = new HanNameItem(2343, "悠", new string[2] { "永", "远" }, new string[3] { "柔", "怡", "曼" }, new string[2] { "然", "居" }, new string[2] { "期", "长" }, new string[0], new string[0]);
		array[2344] = new HanNameItem(2344, "嫣", new string[0], new string[14]
		{
			"柔", "雯", "怡", "琴", "霞", "红", "然", "琼", "邪", "华",
			"蝶", "婵", "然", "慧"
		}, new string[0], new string[0], new string[7] { "儿", "娥", "梦", "娘", "如", "仪", "媚" }, new string[0]);
		array[2345] = new HanNameItem(2345, "阳", new string[3] { "明", "辉", "康" }, new string[2] { "梅", "芝" }, new string[0], new string[1] { "甫" }, new string[0], new string[0]);
		array[2346] = new HanNameItem(2346, "尧", new string[4] { "德", "钦", "昌", "华" }, new string[0], new string[0], new string[1] { "臣" }, new string[0], new string[1] { "裔" });
		array[2347] = new HanNameItem(2347, "夜", new string[2] { "白", "明" }, new string[3] { "雪", "梅", "琴" }, new string[0], new string[2] { "笛", "萧" }, new string[2] { "萤", "月" }, new string[0]);
		array[2348] = new HanNameItem(2348, "怡", new string[5] { "安", "霖", "良", "博", "康" }, new string[14]
		{
			"贞", "淑", "娟", "珍", "芬", "琼", "静", "婷", "敏", "佳",
			"珍", "秀", "娴", "欣"
		}, new string[0], new string[0], new string[2] { "君", "心" }, new string[0]);
		array[2349] = new HanNameItem(2349, "仪", new string[3] { "伟", "斌", "凯" }, new string[3] { "凤", "婷", "雅" }, new string[0], new string[0], new string[0], new string[0]);
		array[2350] = new HanNameItem(2350, "宜", new string[10] { "文", "武", "勇", "忠", "诚", "昌", "兴", "先", "彰", "庆" }, new string[12]
		{
			"静", "芳", "娟", "萱", "淑", "巧", "慧", "贞", "珍", "秀",
			"歌", "敏"
		}, new string[1] { "宁" }, new string[0], new string[0], new string[3] { "君", "年", "乐" });
		array[2351] = new HanNameItem(2351, "意", new string[18]
		{
			"平", "康", "新", "彬", "昌", "归", "平", "谦", "廉", "安",
			"盛", "泉", "铨", "仁", "宏", "良", "迁", "先"
		}, new string[9] { "婷", "敏", "琼", "雅", "嫣", "嘉", "慧", "静", "佳" }, new string[2] { "欣", "忧" }, new string[3] { "豪", "孝", "慎" }, new string[2] { "君", "容" }, new string[0]);
		array[2352] = new HanNameItem(2352, "艺", new string[2] { "伟", "奇" }, new string[4] { "佳", "敏", "真", "华" }, new string[1] { "文" }, new string[0], new string[0], new string[0]);
		array[2353] = new HanNameItem(2353, "毅", new string[28]
		{
			"杰", "雄", "哲", "忠", "新", "成", "晖", "恒", "坚", "宽",
			"恭", "坤", "斌", "谦", "昌", "徽", "刚", "超", "衡", "诚",
			"弘", "宏", "廉", "铨", "俭", "志", "博", "贤"
		}, new string[9] { "贞", "敏", "芳", "珍", "琼", "婕", "婷", "谨", "淑" }, new string[3] { "舒", "嘉", "文" }, new string[0], new string[0], new string[0]);
		array[2354] = new HanNameItem(2354, "懿", new string[7] { "斌", "辉", "亨", "宽", "徽", "杰", "哲" }, new string[10] { "清", "华", "婷", "慧", "珍", "敏", "倩", "嘉", "纯", "淑" }, new string[0], new string[0], new string[4] { "韵", "范", "行", "言" }, new string[1] { "君" });
		array[2355] = new HanNameItem(2355, "引", new string[1] { "涛" }, new string[3] { "芳", "霞", "萍" }, new string[0], new string[0], new string[0], new string[0]);
		array[2356] = new HanNameItem(2356, "莹", new string[1] { "辉" }, new string[11]
		{
			"洁", "华", "瑛", "霞", "珍", "翠", "清", "莹", "玉", "琼",
			"英"
		}, new string[0], new string[0], new string[0], new string[0]);
		array[2357] = new HanNameItem(2357, "咏", new string[3] { "杰", "平", "良" }, new string[13]
		{
			"梅", "雪", "芝", "芬", "芳", "兰", "娴", "霞", "琳", "菊",
			"萍", "荷", "琴"
		}, new string[0], new string[0], new string[1] { "絮" }, new string[0]);
		array[2358] = new HanNameItem(2358, "友", new string[15]
		{
			"庆", "杰", "松", "荣", "恭", "敬", "谅", "直", "闻", "廉",
			"良", "信", "诚", "仁", "义"
		}, new string[9] { "芳", "慧", "真", "兰", "纯", "菊", "梅", "馨", "嘉" }, new string[1] { "文" }, new string[2] { "民", "年" }, new string[0], new string[0]);
		array[2359] = new HanNameItem(2359, "佑", new string[8] { "成", "荣", "宏", "平", "诚", "忠", "仁", "贤" }, new string[3] { "芬", "敏", "芳" }, new string[0], new string[3] { "民", "国", "军" }, new string[0], new string[0]);
		array[2360] = new HanNameItem(2360, "逸", new string[4] { "兴", "超", "群", "贤" }, new string[6] { "霞", "萱", "娇", "丽", "清", "新" }, new string[0], new string[0], new string[0], new string[0]);
		array[2361] = new HanNameItem(2361, "宇", new string[19]
		{
			"盛", "泰", "雄", "康", "淳", "峰", "辰", "鹏", "杰", "轩",
			"博", "昌", "晖", "浩", "辉", "弘", "宽", "玄", "澄"
		}, new string[10] { "珊", "素", "涵", "霜", "秀", "静", "欣", "慧", "珍", "华" }, new string[8] { "清", "和", "英", "奕", "飞", "晨", "谦", "枢" }, new string[3] { "熠", "阳", "敖" }, new string[0], new string[0]);
		array[2362] = new HanNameItem(2362, "育", new string[11]
		{
			"勇", "新", "民", "明", "德", "仁", "儒", "忠", "博", "杰",
			"哲"
		}, new string[16]
		{
			"芳", "馨", "敏", "慧", "珍", "秀", "兰", "萱", "芝", "梅",
			"英", "惠", "雅", "静", "娴", "柔"
		}, new string[1] { "贤" }, new string[0], new string[0], new string[0]);
		array[2363] = new HanNameItem(2363, "芸", new string[0], new string[13]
		{
			"华", "芳", "菲", "芝", "婷", "兰", "萱", "竹", "茜", "娟",
			"芬", "馨", "清"
		}, new string[0], new string[0], new string[0], new string[0]);
		array[2364] = new HanNameItem(2364, "运", new string[4] { "昌", "隆", "亨", "同" }, new string[2] { "霞", "滢" }, new string[0], new string[0], new string[0], new string[0]);
		array[2365] = new HanNameItem(2365, "晏", new string[1] { "安" }, new string[4] { "柔", "温", "宁", "清" }, new string[1] { "和" }, new string[0], new string[0], new string[2] { "如", "然" });
		array[2400] = new HanNameItem(2400, "再", new string[23]
		{
			"复", "盛", "兴", "昌", "铨", "摧", "超", "承", "续", "回",
			"翊", "慧", "迁", "铄", "隆", "荣", "衍", "锋", "祥", "贵",
			"省", "腾", "洵"
		}, new string[0], new string[3] { "荣", "华", "珅" }, new string[3] { "升", "日", "忍" }, new string[0], new string[0]);
		array[2401] = new HanNameItem(2401, "在", new string[6] { "乾", "坤", "冈", "畴", "程", "遥" }, new string[2] { "怡", "霞" }, new string[0], new string[3] { "怀", "标", "尘" }, new string[0], new string[0]);
		array[2402] = new HanNameItem(2402, "葬", new string[10] { "海", "珅", "龙", "虎", "鹏", "轩", "舟", "念", "丘", "雪" }, new string[8] { "琼", "璃", "蓉", "蕾", "琳", "彩", "霁", "月" }, new string[15]
		{
			"英", "菊", "玉", "霞", "琴", "莲", "华", "梅", "忧", "愁",
			"珍", "雨", "情", "葵", "吟"
		}, new string[2] { "秋", "鹤" }, new string[0], new string[4] { "花", "仙", "璧", "梦" });
		array[2403] = new HanNameItem(2403, "泽", new string[6] { "远", "邦", "渊", "源", "淞", "弥" }, new string[0], new string[2] { "英", "华" }, new string[2] { "本", "中" }, new string[0], new string[1] { "清" });
		array[2404] = new HanNameItem(2404, "昭", new string[4] { "德", "度", "胜", "义" }, new string[3] { "敏", "怡", "琼" }, new string[7] { "谊", "凤", "英", "霞", "华", "文", "贤" }, new string[4] { "裔", "胤", "之", "明" }, new string[3] { "娘", "君", "颜" }, new string[0]);
		array[2405] = new HanNameItem(2405, "兆", new string[13]
		{
			"文", "武", "兴", "康", "和", "登", "槐", "基", "麟", "仑",
			"霖", "吉", "鸿"
		}, new string[0], new string[2] { "英", "华" }, new string[0], new string[0], new string[0]);
		array[2406] = new HanNameItem(2406, "振", new string[10] { "武", "雄", "飞", "麟", "猛", "牛", "龙", "业", "超", "元" }, new string[0], new string[0], new string[3] { "甲", "行", "豪" }, new string[0], new string[0]);
		array[2407] = new HanNameItem(2407, "震", new string[9] { "烨", "魁", "虎", "摧", "苍", "雷", "东", "霄", "宵" }, new string[0], new string[0], new string[6] { "山", "天", "南", "百", "千", "万" }, new string[0], new string[0]);
		array[2408] = new HanNameItem(2408, "镇", new string[5] { "魁", "邦", "海", "鼎", "远" }, new string[0], new string[0], new string[7] { "山", "恶", "百", "千", "万", "中", "西" }, new string[0], new string[0]);
		array[2409] = new HanNameItem(2409, "正", new string[50]
		{
			"风", "德", "伦", "平", "鸿", "淳", "焕", "伦", "治", "纲",
			"魁", "义", "大", "齐", "仁", "玄", "阳", "礼", "信", "扬",
			"轩", "丰", "禹", "坦", "宏", "嘉", "敬", "瑛", "靖", "烈",
			"锋", "岚", "祥", "晏", "均", "基", "彬", "殷", "奎", "斌",
			"洵", "醇", "经", "昶", "伦", "仑", "羲", "朋", "筠", "磊"
		}, new string[0], new string[0], new string[15]
		{
			"明", "夫", "一", "怀", "辰", "中", "标", "名", "轨", "日",
			"晓", "夫", "贻", "范", "枝"
		}, new string[0], new string[0]);
		array[2410] = new HanNameItem(2410, "之", new string[4] { "骅", "常", "羽", "冲" }, new string[0], new string[0], new string[3] { "屏", "仆", "伯" }, new string[0], new string[0]);
		array[2411] = new HanNameItem(2411, "芝", new string[3] { "昌", "彦", "畴" }, new string[11]
		{
			"兰", "怡", "琼", "妍", "梅", "心", "萍", "芸", "茵", "芳",
			"馨"
		}, new string[5] { "华", "泉", "宝", "青", "霖" }, new string[2] { "年", "山" }, new string[4] { "萝", "钗", "仙", "颜" }, new string[0]);
		array[2412] = new HanNameItem(2412, "知", new string[9] { "礼", "诰", "章", "回", "谏", "慧", "艳", "季", "良" }, new string[0], new string[0], new string[4] { "白", "古", "秋", "语" }, new string[0], new string[0]);
		array[2413] = new HanNameItem(2413, "织", new string[0], new string[4] { "香", "云", "华", "霞" }, new string[0], new string[0], new string[0], new string[0]);
		array[2414] = new HanNameItem(2414, "执", new string[5] { "谊", "牧", "翰", "钦", "徽" }, new string[0], new string[3] { "柔", "忧", "愁" }, new string[1] { "中" }, new string[1] { "钗" }, new string[0]);
		array[2415] = new HanNameItem(2415, "芷", new string[0], new string[20]
		{
			"兰", "怡", "琼", "青", "玉", "媛", "妍", "心", "萍", "蓉",
			"嫣", "倩", "茵", "萱", "芳", "菲", "贤", "馨", "葵", "若"
		}, new string[0], new string[0], new string[6] { "清", "仙", "颜", "容", "约", "儿" }, new string[0]);
		array[2416] = new HanNameItem(2416, "至", new string[6] { "德", "忠", "诚", "仁", "义", "阔" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2417] = new HanNameItem(2417, "志", new string[30]
		{
			"灵", "宁", "绪", "鹏", "尚", "通", "昌", "传", "奇", "云",
			"博", "刚", "达", "坚", "独", "炳", "远", "坦", "阔", "新",
			"乔", "匡", "荣", "衍", "由", "廉", "遥", "纮", "登", "梁"
		}, new string[0], new string[0], new string[12]
		{
			"行", "光", "发", "明", "来", "高", "豪", "怀", "金", "连",
			"厚", "甲"
		}, new string[0], new string[0]);
		array[2418] = new HanNameItem(2418, "致", new string[4] { "远", "乾", "义", "先" }, new string[0], new string[0], new string[3] { "本", "伯", "流" }, new string[0], new string[0]);
		array[2419] = new HanNameItem(2419, "智", new string[9] { "宏", "华", "超", "仁", "锐", "弘", "宏", "阔", "衍" }, new string[0], new string[0], new string[5] { "周", "及", "光", "行", "明" }, new string[0], new string[0]);
		array[2420] = new HanNameItem(2420, "中", new string[0], new string[0], new string[3] { "玉", "棠", "贤" }, new string[1] { "恩" }, new string[0], new string[1] { "烟" });
		array[2421] = new HanNameItem(2421, "忠", new string[8] { "彦", "义", "德", "仁", "悌", "甫", "健", "祥" }, new string[0], new string[0], new string[4] { "孝", "继", "鉴", "根" }, new string[0], new string[0]);
		array[2422] = new HanNameItem(2422, "重", new string[9] { "霸", "荣", "杀", "涛", "义", "铄", "岚", "祥", "遇" }, new string[0], new string[1] { "阮" }, new string[4] { "山", "楼", "光", "霭" }, new string[0], new string[0]);
		array[2423] = new HanNameItem(2423, "珠", new string[0], new string[11]
		{
			"琼", "玉", "霞", "瑗", "妍", "琴", "璃", "蕾", "琳", "雯",
			"婵"
		}, new string[3] { "瑚", "华", "瑜" }, new string[0], new string[3] { "凝", "儿", "娥" }, new string[0]);
		array[2424] = new HanNameItem(2424, "卓", new string[22]
		{
			"诚", "伦", "永", "康", "魁", "昌", "俊", "文", "涛", "群",
			"艺", "超", "勋", "异", "韬", "彰", "贤", "成", "然", "锋",
			"越", "伦"
		}, new string[3] { "贞", "瑶", "娅" }, new string[5] { "凤", "邪", "莲", "华", "凌" }, new string[3] { "年", "豪", "鉴" }, new string[1] { "君" }, new string[0]);
		array[2425] = new HanNameItem(2425, "子", new string[28]
		{
			"安", "穆", "柳", "聪", "良", "英", "澄", "布", "文", "虎",
			"昭", "亮", "建", "剑", "敬", "慕", "靖", "健", "均", "翼",
			"奕", "惟", "惜", "钰", "孺", "烛", "曦", "幼"
		}, new string[2] { "月", "莹" }, new string[9] { "灵", "衿", "邪", "琴", "莲", "瑛", "吟", "韶", "攸" }, new string[6] { "明", "豪", "牙", "城", "柏", "镜" }, new string[0], new string[1] { "清" });
		array[2426] = new HanNameItem(2426, "紫", new string[1] { "琨" }, new string[29]
		{
			"玉", "霞", "怡", "琼", "青", "瑗", "媛", "妍", "琴", "莲",
			"萍", "璃", "嫣", "娇", "蕾", "琳", "茵", "蝶", "雯", "婵",
			"萱", "雁", "馨", "棠", "樱", "红", "珊", "琦", "薇"
		}, new string[4] { "英", "霖", "昕", "星" }, new string[1] { "川" }, new string[10] { "罗", "衣", "钗", "萝", "仙", "君", "娥", "萼", "竹", "依" }, new string[2] { "梧", "桐" });
		array[2427] = new HanNameItem(2427, "自", new string[19]
		{
			"拯", "征", "省", "修", "安", "当", "铮", "铨", "平", "摧",
			"归", "晋", "恪", "彰", "慧", "俅", "求", "祥", "廉"
		}, new string[0], new string[7] { "珍", "忧", "愁", "离", "悔", "怜", "还" }, new string[5] { "在", "行", "明", "来", "中" }, new string[0], new string[1] { "清" });
		array[2428] = new HanNameItem(2428, "宗", new string[62]
		{
			"羲", "敏", "朝", "海", "勉", "儒", "彦", "籍", "谊", "盛",
			"华", "齐", "业", "福", "祐", "仁", "玄", "保", "礼", "正",
			"贤", "宏", "化", "良", "楷", "绍", "建", "剑", "岳", "敬",
			"敏", "伟", "宣", "荣", "沛", "慕", "衍", "靖", "佩", "烈",
			"林", "若", "楠", "祥", "恕", "晏", "瑞", "麟", "弼", "显",
			"泽", "护", "旺", "延", "昶", "耀", "勇", "永", "严", "允",
			"梁", "茂"
		}, new string[0], new string[0], new string[13]
		{
			"尹", "本", "伯", "明", "豪", "继", "胤", "鉴", "藏", "名",
			"如", "范", "堂"
		}, new string[0], new string[0]);
		array[2429] = new HanNameItem(2429, "祖", new string[28]
		{
			"德", "诰", "培", "同", "贤", "化", "慧", "良", "楷", "建",
			"剑", "誉", "隆", "宣", "荣", "瑛", "凌", "骏", "祥", "逸",
			"绶", "勤", "宜", "威", "伦", "用", "攸", "梁"
		}, new string[0], new string[0], new string[7] { "荫", "胤", "鉴", "运", "名", "根", "贻" }, new string[0], new string[0]);
		array[2430] = new HanNameItem(2430, "作", new string[9] { "朋", "济", "牧", "谊", "邦", "彦", "铨", "义", "赋" }, new string[1] { "冰" }, new string[4] { "琴", "忧", "愁", "离" }, new string[2] { "清", "标" }, new string[0], new string[2] { "仙", "璧" });
		array[2431] = new HanNameItem(2431, "招", new string[1] { "艳" }, new string[1] { "怡" }, new string[4] { "谊", "玉", "雨", "慧" }, new string[0], new string[1] { "弟" }, new string[0]);
		array[2432] = new HanNameItem(2432, "遵", new string[3] { "武", "义", "纪" }, new string[0], new string[0], new string[0], new string[0], new string[0]);
		array[2433] = new HanNameItem(2433, "占", new string[4] { "鳌", "成", "先", "荣" }, new string[4] { "霞", "芬", "巧", "灵" }, new string[1] { "文" }, new string[0], new string[0], new string[0]);
		array[2434] = new HanNameItem(2434, "彰", new string[8] { "志", "荣", "益", "睿", "牧", "化", "恕", "义" }, new string[3] { "慧", "雅", "慈" }, new string[5] { "贤", "敬", "礼", "平", "和" }, new string[1] { "怀" }, new string[0], new string[1] { "如" });
		array[2435] = new HanNameItem(2435, "贞", new string[6] { "良", "毅", "勇", "昌", "义", "恪" }, new string[4] { "淑", "慧", "英", "静" }, new string[1] { "和" }, new string[0], new string[0], new string[0]);
		array[2436] = new HanNameItem(2436, "直", new string[5] { "刚", "诚", "忠", "谦", "勇" }, new string[1] { "英" }, new string[0], new string[0], new string[0], new string[0]);
		array[2437] = new HanNameItem(2437, "竹", new string[4] { "卿", "海", "石", "声" }, new string[6] { "梅", "琴", "英", "兰", "菊", "烟" }, new string[3] { "松", "仙", "雪" }, new string[0], new string[1] { "韵" }, new string[2] { "君", "青" });
		array[2438] = new HanNameItem(2438, "资", new string[4] { "平", "杰", "成", "秀" }, new string[4] { "颖", "灵", "慧", "敏" }, new string[4] { "华", "尧", "安", "善" }, new string[0], new string[0], new string[3] { "民", "道", "君" });
		array[2439] = new HanNameItem(2439, "姿", new string[0], new string[6] { "秀", "淑", "媛", "妍", "倩", "雅" }, new string[0], new string[0], new string[0], new string[0]);
		AllNamesCore = array;
	}
}
